      *==============================================================*  00001000
       IDENTIFICATION                            DIVISION.              00002000
      *==============================================================*  00003000
                                                                        00004000
       PROGRAM-ID.  ARQ005.                                             00005000
                                                                        00006000
      *==============================================================*  00007000
      *     AUTOR   : AUGUSTO MARTINS                                   00008000
      *     EMPRESA : FOURSYS                                           00009000
      *--------------------------------------------------------------*  00010000
      *     DATA    : 04/05/2022                                        00020000
      *     OBJETIVO: GRAVAR ARQUIVOS RESUM, COM O USO DE BOOK.         00021000
      *                                                                 00021100
      *==============================================================*  00022000
                                                                        00023000
      *==============================================================*  00024000
       ENVIRONMENT                               DIVISION.              00025000
      *==============================================================*  00026000
       INPUT-OUTPUT                              SECTION.               00026100
       FILE-CONTROL.                                                    00026200
             SELECT PRODUCT  ASSIGN TO JCLARQ02                         00026300
                FILE STATUS  IS WRK-FS-PRODUCT.                         00026400
             SELECT RESUM   ASSIGN TO RESUM                             00026500
                FILE STATUS  IS WRK-FS-RESUM.                           00026600
      *==============================================================*  00026700
       DATA                                      DIVISION.              00026800
      *==============================================================*  00026900
       FILE                                      SECTION.               00027000
       FD PRODUCT                                                       00027100
           RECORDING MODE IS F                                          00027200
           BLOCK CONTAINS 0 RECORDS.                                    00027300
       01 FD-PRODUCT PIC X(70).                                         00027400
                                                                        00027500
       FD RESUM                                                         00027600
           RECORDING MODE IS F                                          00027700
           BLOCK CONTAINS 0 RECORDS.                                    00027800
       01 FD-RESUM   PIC X(40).                                         00027900
                                                                        00028000
      *-------------------------------------------------------------*   00028100
       WORKING-STORAGE                           SECTION.               00028200
      *-------------------------------------------------------------*   00028300
                                                                        00028500
                                                                        00028600
      *-------------------------------------------------------------*   00028700
       01  FILLER                      PIC  X(030) VALUE                00028800
                 '***  AREA DE BOOK  ***'.                              00028900
      *-------------------------------------------------------------*   00029000
                                                                        00029100
             COPY 'B#PROD'.                                             00029200
             COPY 'B#RESUM'.                                            00029300
                                                                        00029400
      *-------------------------------------------------------------*   00029500
       01  FILLER                      PIC  X(030) VALUE                00029700
                 '***  TESTE DE FILE STATUS ***'.                       00029800
      *-------------------------------------------------------------*   00029900
                                                                        00030000
       77 WRK-FS-RESUM    PIC X(02) VALUE SPACES.                       00030100
       77 WRK-FS-PRODUCT  PIC X(02) VALUE SPACES.                       00030200
                                                                        00030700
      *-------------------------------------------------------------*   00030800
       01  FILLER                      PIC  X(030) VALUE                00030900
                 '***  AREA PARA AUXILIARES ***'.                       00031000
      *-------------------------------------------------------------*   00031100
                                                                        00031200
       77 WRK-MSG         PIC X(50) VALUE SPACES.                       00031300
                                                                        00031400
      *-------------------------------------------------------------*   00031600
                                                                        00031700
                                                                        00031800
      *=============================================================*   00031900
       PROCEDURE DIVISION.                                              00032000
      *=============================================================*   00032100
                                                                        00032200
      *-------------------------------------------------------------*   00032300
       0000-PRINCIPAL                     SECTION.                      00032400
      *-------------------------------------------------------------*   00032500
                                                                        00032600
           PERFORM 1000-INICIAR.                                        00032700
           PERFORM 2000-PROCESSAR UNTIL WRK-FS-PRODUCT EQUAL '10'       00032800
           PERFORM 3000-FINALIZAR.                                      00032900
                                                                        00033000
                                                                        00033100
      *-------------------------------------------------------------*   00033200
       0000-99-FIM.                       EXIT.                         00033300
      *-------------------------------------------------------------*   00033400
                                                                        00033500
                                                                        00033600
      *-------------------------------------------------------------*   00033700
       1000-INICIAR                       SECTION.                      00033800
      *-------------------------------------------------------------*   00033900
                                                                        00034000
            OPEN INPUT  PRODUCT                                         00034100
                 OUTPUT RESUM.                                          00034200
              PERFORM 1100-TESTAR-FILE-STATUS                           00034300
              READ PRODUCT INTO WRK-REG-PRODUCT.                        00034400
                                                                        00034500
      *-------------------------------------------------------------*   00034600
       1000-99-FIM.                       EXIT.                         00034700
      *-------------------------------------------------------------*   00034800
                                                                        00034900
                                                                        00035000
                                                                        00035100
      *-------------------------------------------------------------*   00035200
       1100-TESTAR-FILE-STATUS            SECTION.                      00035300
      *-------------------------------------------------------------*   00035400
                                                                        00035500
                IF WRK-FS-PRODUCT  NOT EQUAL ZEROS                      00035600
                   MOVE ' ERRO OPEN '   TO WRK-MSG                      00035700
                     PERFORM 9000-TRATAR-ERROS                          00035800
                END-IF.                                                 00035900
                                                                        00036000
                IF WRK-FS-RESUM    NOT EQUAL ZEROS                      00036100
                   MOVE ' ERRO OPEN '   TO WRK-MSG                      00036200
                     PERFORM 9000-TRATAR-ERROS                          00036300
                END-IF.                                                 00036400
                                                                        00036500
      *-------------------------------------------------------------*   00036600
       1100-99-FIM.                       EXIT.                         00036700
      *-------------------------------------------------------------*   00036800
                                                                        00036900
                                                                        00037000
      *-------------------------------------------------------------*   00037100
       1200-TESTAR-FILE-STATUS            SECTION.                      00037200
      *-------------------------------------------------------------*   00037300
                                                                        00037400
                IF WRK-FS-PRODUCT  NOT EQUAL ZEROS                      00037500
                   MOVE ' ERRO CLOSE '   TO WRK-MSG                     00037600
                     PERFORM 9000-TRATAR-ERROS                          00037700
                END-IF.                                                 00037800
                                                                        00037900
                IF WRK-FS-RESUM    NOT EQUAL ZEROS                      00038000
                   MOVE ' ERRO CLOSE '   TO WRK-MSG                     00038100
                     PERFORM 9000-TRATAR-ERROS                          00038200
                END-IF.                                                 00038300
                                                                        00038400
      *-------------------------------------------------------------*   00038500
       1200-99-FIM.                       EXIT.                         00038600
      *-------------------------------------------------------------*   00038700
                                                                        00038800
                                                                        00038900
      *-------------------------------------------------------------*   00039000
       2000-PROCESSAR                     SECTION.                      00039100
      *-------------------------------------------------------------*   00039200
                                                                        00039300
               IF WRK-FS-PRODUCT  EQUAL ZEROS                           00039400
                   MOVE  WRK-REG-PRODUCT(1:40)  TO FD-RESUM             00039500
                    MOVE FD-RESUM               TO WRK-REG-RESUM        00039700
                                                                        00039800
                      IF WRK-REG-FORN EQUAL 'LG'                        00039900
                                                                        00040000
                   WRITE  FD-RESUM       FROM WRK-REG-RESUM             00040100
                      END-IF                                            00040200
                                                                        00040300
                      IF WRK-REG-FORN EQUAL 'LG'                        00040400
                        DISPLAY 'GRAVADO ' WRK-REG-COD  WRK-REG-FORN    00040500
                      END-IF                                            00040600
                                                                        00040700
                ELSE                                                    00040800
                     MOVE 'FINAL DE ARQUIVO '   TO WRK-MSG              00040900
                END-IF                                                  00041000
                                                                        00041100
                READ PRODUCT INTO WRK-REG-PRODUCT.                      00041200
                                                                        00041300
      *-------------------------------------------------------------*   00041400
       2000-99-FIM.                       EXIT.                         00041500
      *-------------------------------------------------------------*   00041600
                                                                        00041700
                                                                        00041800
      *-------------------------------------------------------------*   00041900
       3000-FINALIZAR                     SECTION.                      00042000
      *-------------------------------------------------------------*   00042100
                                                                        00042200
            CLOSE PRODUCT                                               00042300
            CLOSE RESUM                                                 00042400
                                                                        00042500
                PERFORM 1200-TESTAR-FILE-STATUS                         00042600
                                                                        00042700
                 MOVE ' FINAL DO PROCESSO ' TO WRK-MSG                  00042800
                 PERFORM 9000-TRATAR-ERROS.                             00042900
                                                                        00043000
      *-------------------------------------------------------------*   00043100
       3000-99-FIM.                       EXIT.                         00043200
      *-------------------------------------------------------------*   00043300
                                                                        00043400
                                                                        00043500
                                                                        00043600
      *-------------------------------------------------------------*   00043700
       9000-TRATAR-ERROS                  SECTION.                      00043800
      *-------------------------------------------------------------*   00043900
                                                                        00044000
             DISPLAY '========================='                        00044100
             DISPLAY   WRK-MSG                                          00044200
             DISPLAY '========================='                        00044300
                STOP RUN.                                               00044400
                                                                        00044500
      *-------------------------------------------------------------*   00044600
       9000-99-FIM.            EXIT.                                    00044700
      *-------------------------------------------------------------*   00045000
                                                                        00050000
