      *=======================================================*         00001000
       IDENTIFICATION                            DIVISION.              00002000
      *=======================================================*         00003000
                                                                        00004000
       PROGRAM-ID.  ARQ006.                                             00005000
                                                                        00006000
      *=======================================================*         00006100
                                                                        00006200
                                                                        00006300
      *=======================================================*         00006400
      *     AUTOR   : AUGUSTO MARTINS                                   00006500
      *     EMPRESA : FOURSYS                                           00006600
      *     DATA    : 29/04/2022                                        00006800
      *     OBJETIVO: CRIAR UM LAYOUT E IMPRIMIR OS DADOS.              00006900
      *=======================================================*         00007000
                                                                        00008000
      *=======================================================*         00009000
       ENVIRONMENT                               DIVISION.              00010000
      *=======================================================*         00020000
       INPUT-OUTPUT                              SECTION.               00021000
       FILE-CONTROL.                                                    00022000
             SELECT ROTINA   ASSIGN TO JCLROTIN                         00023000
                FILE STATUS  IS WRK-FS-ROTINA.                          00024000
      *=======================================================*         00025000
       DATA                                      DIVISION.              00026000
      *=======================================================*         00026100
       FILE                                      SECTION.               00026200
       FD ROTINA                                                        00026300
           RECORDING MODE IS F                                          00026400
           BLOCK CONTAINS 0 RECORDS.                                    00026500
                                                                        00026600
       01 FD-ROTINA       PIC X(53).                                    00026700
                                                                        00027202
      *---------------------------------------------------              00027300
       WORKING-STORAGE                           SECTION.               00027400
      *---------------------------------------------------              00027500
      * **********    AREA PARA BOOK    ******************              00027600
                                                                        00027700
      *---------------------------------------------------              00027800
                COPY 'B#ROTIN'.                                         00028000
                                                                        00028100
                                                                        00028200
      *---------------------------------------------------              00028300
       77 WRK-MSG         PIC X(25) VALUE SPACES.                       00028400
       77 WRK-ACUM        PIC 9(02) VALUE ZEROS.                        00028500
       77 WRK-FS-ROTINA   PIC 9(02) VALUE ZEROS.                        00028600
      *---------------------------------------------------              00028700
                                                                        00028800
                                                                        00028900
                                                                        00029000
      *========================================================*        00029100
       PROCEDURE                          DIVISION.                     00029200
      *========================================================*        00029300
                                                                        00029400
      *--------------------------------------------------------*        00029500
       0000-PRINCIPAL                     SECTION.                      00029600
      *--------------------------------------------------------*        00029700
                                                                        00029800
            PERFORM 1000-INICIAR.                                       00029900
              IF WRK-FS-ROTINA EQUAL ZEROS                              00030000
                PERFORM 2000-PROCESSAR UNTIL WRK-FS-ROTINA EQUAL '10'   00030500
              END-IF.                                                   00030600
            PERFORM 4000-FIMARQ                                         00030700
                STOP RUN.                                               00031100
                                                                        00031200
      *--------------------------------------------------------*        00031300
       0000-99-FIM.                       EXIT.                         00031400
      *--------------------------------------------------------*        00031500
                                                                        00031600
                                                                        00031700
                                                                        00031800
      *--------------------------------------------------------*        00031900
       1000-INICIAR                       SECTION.                      00032000
      *--------------------------------------------------------*        00032100
                                                                        00033000
                OPEN INPUT ROTINA.                                      00034000
                   IF WRK-FS-ROTINA NOT EQUAL ZEROS                     00035000
                     DISPLAY 'ERRO OPEN'                                00036000
                   ELSE                                                 00037000
                     READ ROTINA INTO  WRK-NOVA-ROTINA                  00038000
                      IF WRK-FS-ROTINA NOT EQUAL ZEROS                  00038200
                         DISPLAY 'FIM DE ARQUIVO '                      00038300
                      END-IF                                            00038400
                                                                        00038500
                   END-IF.                                              00039000
                                                                        00050000
      *-----------------------------------------------------------*     00051000
       1000-99-FIM.                       EXIT.                         00052000
      *-----------------------------------------------------------*-    00053000
                                                                        00054000
                                                                        00054100
      *-----------------------------------------------------------*     00054200
       2000-PROCESSAR                     SECTION.                      00054300
      *-----------------------------------------------------------*-    00054400
                                                                        00055100
                    DISPLAY '-REG- ' WRK-MATERIA                        00055200
                     READ ROTINA                                        00055400
                                                                        00055500
                    IF WRK-FS-ROTINA NOT EQUAL ZEROS                    00055600
                      DISPLAY 'FIM DE ARQUIVO'                          00055700
                    ELSE                                                00055800
                      MOVE FD-ROTINA   TO WRK-NOVA-ROTINA               00055900
                                                                        00056000
                    END-IF.                                             00056100
                                                                        00056200
                                                                        00056400
      *-----------------------------------------------------------*     00056500
       2000-99-FIM.                       EXIT.                         00056600
      *-----------------------------------------------------------*-    00057000
                                                                        00058000
                                                                        00059000
                                                                        00069000
      *--------------------------------------------------------------   00070000
       4000-FIMARQ                       SECTION.                       00080000
      *--------------------------------------------------------------   00090000
                                                                        00090100
               CLOSE ROTINA                                             00091000
                                                                        00091100
                     IF WRK-FS-ROTINA NOT EQUAL ZEROS                   00092000
                        DISPLAY 'ERRO CLOSE' WRK-FS-ROTINA              00093000
                     END-IF.                                            00093100
                                                                        00095000
                                                                        00096000
      *--------------------------------------------------------------   00099000
       4000-99-FIM.                      EXIT.                          00100000
      *--------------------------------------------------------------   00110000
                                                                        00111000
                                                                        00112000
