      *=======================================================*         00001000
       IDENTIFICATION                            DIVISION.              00002000
      *=======================================================*         00003000
                                                                        00004000
       PROGRAM-ID.  ARQ002.                                             00005000
                                                                        00006000
      *=======================================================*         00006100
                                                                        00006200
                                                                        00006300
      * ======================================================*         00006401
      *     AUTOR   : AUGUSTO MARTINS                                   00006500
      *     EMPRESA : FOURSYS                                           00006600
      *-------------------------------------------------------*         00006700
      *     DATA    : 29/04/2022                              *         00006800
      *     OBJETIVO: ABERTURA DO ARQUIVO ARQNOVO E IMPRIMIR  *         00006901
      *               TOTAL DE REGISTROS LIDOS E SOMAR OS     *         00007000
      *               ANALISTAS                               *         00007100
      *=======================================================*         00007200
                                                                        00008000
      *=======================================================*         00009000
       ENVIRONMENT                               DIVISION.              00010000
      *=======================================================*         00020000
       INPUT-OUTPUT                              SECTION.               00021000
       FILE-CONTROL.                                                    00022000
             SELECT ARQNOVO  ASSIGN TO JCLARQ01                         00023000
                FILE STATUS  IS WRK-FS-ARQ.                             00024000
      *=======================================================*         00025000
       DATA                                      DIVISION.              00026000
      *=======================================================*         00026100
       FILE                                      SECTION.               00026200
       FD ARQNOVO                                                       00026300
           RECORDING MODE IS F                                          00026400
           BLOCK CONTAINS 0 RECORDS.                                    00026500
                                                                        00026600
       01 FD-REGISTRO.                                                  00026700
          05 FD-CODIG     PIC X(05).                                    00026800
          05 FD-NOME      PIC X(18).                                    00026900
          05 FD-CARG      PIC X(11).                                    00027000
          05 FD-HORA      PIC 9(06).                                    00027100
                                                                        00027200
      *---------------------------------------------------              00027300
       WORKING-STORAGE                           SECTION.               00027400
      *---------------------------------------------------              00027500
       77 WRK-FS-ARQ      PIC X(02) VALUE SPACES.                       00027600
       77 WRK-MENSAG      PIC X(25) VALUE SPACES.                       00027700
       77 WRK-ACUM        PIC 9(02) VALUE ZEROS.                        00027800
       77 WRK-ACUM-ANSTA  PIC 9(02) VALUE ZEROS.                        00027900
       77 WRK-ERRO        PIC 9(02) VALUE ZEROS.                        00028000
      *---------------------------------------------------              00028100
                                                                        00028200
                                                                        00028300
                                                                        00028400
      *========================================================*        00028500
       PROCEDURE                          DIVISION.                     00028600
      *========================================================*        00028700
                                                                        00028800
      *--------------------------------------------------------*        00028900
       0000-PRINCIPAL                     SECTION.                      00029000
      *--------------------------------------------------------*        00029100
                                                                        00029200
                PERFORM 1000-INICIAR.                                   00029300
                IF WRK-FS-ARQ EQUAL ZEROS                               00030000
                   PERFORM 2000-PROCESSAR UNTIL WRK-FS-ARQ EQUAL '10'   00030100
                   PERFORM 3000-RESUMO                                  00030200
                END-IF.                                                 00030400
                PERFORM 4000-FIMARQ.                                    00030600
                STOP RUN.                                               00030700
      *--------------------------------------------------------*        00030800
       0000-99-FIM.                       EXIT.                         00030900
      *--------------------------------------------------------*        00031000
                                                                        00031100
                                                                        00031200
      **********************************************************        00031300
      *               ABRIR ARQUIVO ARQNOVO                    *        00032000
      **********************************************************        00033000
                                                                        00034000
      *--------------------------------------------------------*        00035000
       1000-INICIAR                       SECTION.                      00036000
      *--------------------------------------------------------*        00037000
                                                                        00038000
            OPEN INPUT ARQNOVO.                                         00039000
                 IF WRK-FS-ARQ NOT EQUAL ZEROS                          00040000
                    MOVE '-ERRO  DE ABERTURA-' TO WRK-MENSAG            00050000
                    PERFORM  9000-TRATAR-ERRO                           00051000
                 ELSE                                                   00052000
                    DISPLAY '-----------REGISTROS DE CLIENTES---------' 00053000
                 END-IF.                                                00054000
                                                                        00054100
      *-----------------------------------------------------------*     00054200
       1000-99-FIM.                       EXIT.                         00054300
      *-----------------------------------------------------------*-    00054400
                                                                        00054500
                                                                        00054600
      *-----------------------------------------------------------*     00054700
       2000-PROCESSAR                     SECTION.                      00054800
      *-----------------------------------------------------------*-    00054900
                                                                        00055000
               READ ARQNOVO                                             00055100
                                                                        00055200
                 IF WRK-FS-ARQ NOT EQUAL ZEROS                          00055300
                    MOVE 1                  TO WRK-ERRO                 00055400
                    PERFORM 9000-TRATAR-ERRO                            00055500
                 ELSE                                                   00055600
                    DISPLAY '-REG-'     FD-REGISTRO                     00055700
                    ADD 1                   TO WRK-ACUM-ANSTA           00055800
                     IF FD-CARG EQUAL 'ANALISTA'                        00055900
                       ADD 1                TO WRK-ACUM                 00056000
                     END-IF                                             00056100
                  END-IF.                                               00056500
                                                                        00056600
      *-----------------------------------------------------------*     00060400
       2000-99-FIM.                       EXIT.                         00060500
      *-----------------------------------------------------------*-    00060600
                                                                        00060700
                                                                        00060800
      *------------------------------------------------------------     00060900
       9000-TRATAR-ERRO                   SECTION.                      00061000
      *------------------------------------------------------------     00061100
                 IF WRK-ERRO EQUAL 1                                    00062200
                     MOVE '-FIM DA LEITURA-' TO WRK-MENSAG              00063000
                 END-IF.                                                00063100
                                                                        00064000
      *------------------------------------------------------------*    00065000
       9000-99-FIM.                      EXIT.                          00066000
      *------------------------------------------------------------*    00067000
                                                                        00068000
                                                                        00068100
      *------------------------------------------------------------*    00068200
       3000-RESUMO                       SECTION.                       00068300
      *------------------------------------------------------------*    00068400
                                                                        00068500
                   DISPLAY '----------------------------'               00068600
                   DISPLAY '-TOTAL DE REGISTROS LIDOS-       '          00068700
                                                       WRK-ACUM-ANSTA   00068800
                   DISPLAY '-TOTAL DE REGISTROS COM ANALISTA-'          00068900
                                                                        00069000
                                                       WRK-ACUM.        00069100
                                                                        00069200
      *------------------------------------------------------------*    00069400
       3000-99-FIM.                      EXIT.                          00069500
      *------------------------------------------------------------*    00069600
                                                                        00069700
                                                                        00069800
      *--------------------------------------------------------------   00070000
       4000-FIMARQ                       SECTION.                       00080000
      *--------------------------------------------------------------   00090000
                                                                        00091000
              CLOSE ARQNOVO                                             00092000
                IF WRK-FS-ARQ NOT EQUAL ZEROS                           00093000
                  MOVE '-ERRO  FEHAMENTO-' TO WRK-MENSAG                00094000
                   PERFORM 9000-TRATAR-ERRO                             00095000
                                                                        00096000
                END-IF.                                                 00098000
                                                                        00099000
      *--------------------------------------------------------------   00100000
       4000-99-FIM.                      EXIT.                          00110000
      *--------------------------------------------------------------   00111000
                                                                        00112000
                                                                        00113000
