      *=======================================================*         00001001
       IDENTIFICATION                            DIVISION.              00002001
      *=======================================================*         00003001
                                                                        00004001
       PROGRAM-ID.  ARQ003.                                             00005001
                                                                        00006001
      *=======================================================*         00006101
                                                                        00006201
                                                                        00006301
      *=======================================================*         00006401
      *     AUTOR   : AUGUSTO MARTINS                                   00006501
      *     EMPRESA : FOURSYS                                           00006601
      *-------------------------------------------------------*         00006701
      *     DATA    : 29/04/2022                                        00006801
      *     OBJETIVO: ABERTURA DA ARQUIVO ARQ001                        00006901
      *=======================================================*         00007001
                                                                        00008001
      *=======================================================*         00009001
       ENVIRONMENT                               DIVISION.              00010001
      *=======================================================*         00020001
       INPUT-OUTPUT                              SECTION.               00021001
       FILE-CONTROL.                                                    00022001
             SELECT ARQNOV01 ASSIGN TO JCLARQ02                         00023007
                FILE STATUS  IS WRK-FS-ARQ.                             00024001
      *=======================================================*         00025001
       DATA                                      DIVISION.              00026001
      *=======================================================*         00026101
       FILE                                      SECTION.               00026201
       FD ARQNOV01                                                      00026307
           RECORDING MODE IS F                                          00026401
           BLOCK CONTAINS 0 RECORDS.                                    00026501
                                                                        00026601
       01 FD-REGISTRO.                                                  00026701
          05 FD-CODIG        PIC 9(05).                                 00026810
          05 FD-PRODUTO      PIC X(20).                                 00026904
          05 FD-FORCDR       PIC X(15).                                 00027004
          05 FD-VALOR        PIC 9(06)V99.                              00027110
          05 FD-ESTOQUE      PIC 9(05).                                 00027210
          05 FILLER          PIC 9(17).                                 00027310
      *---------------------------------------------------              00027402
       WORKING-STORAGE                           SECTION.               00027502
      *---------------------------------------------------              00027602
                                                                        00027713
       66 WRK-RDF RENAMES FD-CODIG THRU FD-FORCDR.                      00027813
                                                                        00027913
       77 WRK-FS-ARQ         PIC X(02) VALUE SPACES.                    00028002
       77 WRK-MENSAG         PIC X(25) VALUE SPACES.                    00028102
       77 WRK-ACUM           PIC 9(02) VALUE ZEROS.                     00028202
       77 WRK-ACUM-ANSTA     PIC 9(02) VALUE ZEROS.                     00028302
       77 WRK-ERRO           PIC 9(02) VALUE ZEROS.                     00028402
      *---------------------------------------------------              00028502
                                                                        00028602
                                                                        00028702
                                                                        00028802
      *========================================================*        00028902
       PROCEDURE                          DIVISION.                     00029002
      *========================================================*        00029102
                                                                        00029202
      *--------------------------------------------------------*        00029302
       0000-PRINCIPAL                     SECTION.                      00029402
      *--------------------------------------------------------*        00029502
                                                                        00029602
                PERFORM 1000-INICIAR.                                   00029702
                IF WRK-FS-ARQ EQUAL ZEROS                               00029802
                   PERFORM 2000-PROCESSAR UNTIL WRK-FS-ARQ EQUAL '10'   00029902
                   PERFORM 3000-RESUMO                                  00030002
                END-IF.                                                 00030102
                PERFORM 4000-FIMARQ.                                    00030202
                STOP RUN.                                               00030302
      *--------------------------------------------------------*        00030402
       0000-99-FIM.                       EXIT.                         00030502
      *--------------------------------------------------------*        00030602
                                                                        00030702
                                                                        00030802
      **********************************************************        00030902
      *               ABRIR ARQUIVO ARQNOVO                    *        00031002
      **********************************************************        00031102
                                                                        00031202
      *--------------------------------------------------------*        00031302
       1000-INICIAR                       SECTION.                      00031402
      *--------------------------------------------------------*        00032001
                                                                        00033001
            OPEN INPUT ARQNOV01                                         00034007
                 IF WRK-FS-ARQ NOT EQUAL ZEROS                          00035001
                    MOVE '-ERRO  DE ABERTURA-' TO WRK-MENSAG            00036001
                    PERFORM  9000-TRATAR-ERRO                           00037001
                 ELSE                                                   00038001
                    DISPLAY '-----------REGISTROS DE PRODUTOS ---------'00039003
                 END-IF.                                                00040001
                                                                        00050001
      *-----------------------------------------------------------*     00051001
       1000-99-FIM.                       EXIT.                         00052001
      *-----------------------------------------------------------*-    00053001
                                                                        00054001
                                                                        00054101
      *-----------------------------------------------------------*     00054201
       2000-PROCESSAR                     SECTION.                      00054301
      *-----------------------------------------------------------*-    00054401
                                                                        00054501
               READ ARQNOV01                                            00054607
                                                                        00054701
                 IF WRK-FS-ARQ NOT EQUAL ZEROS                          00054801
                    MOVE 1                  TO WRK-ERRO                 00054901
                    PERFORM 9000-TRATAR-ERRO                            00055001
                 ELSE                                                   00055101
                    DISPLAY '-REG-'     FD-CODIG                        00055215
                                        FD-PRODUTO                      00055316
                                        FD-FORCDR                       00055416
                    ADD 1                   TO WRK-ACUM-ANSTA           00055516
                  END-IF.                                               00055901
                                                                        00056001
      *-----------------------------------------------------------*     00056101
       2000-99-FIM.                       EXIT.                         00056201
      *-----------------------------------------------------------*-    00057001
                                                                        00058001
                                                                        00059001
      *------------------------------------------------------------     00060001
       9000-TRATAR-ERRO                   SECTION.                      00061001
      *------------------------------------------------------------     00062001
                 IF WRK-ERRO EQUAL 1                                    00062101
                     MOVE '-FIM DA LEITURA-' TO WRK-MENSAG              00062201
                 END-IF.                                                00062301
                                                                        00062401
      *------------------------------------------------------------*    00062501
       9000-99-FIM.                      EXIT.                          00062601
      *------------------------------------------------------------*    00062701
                                                                        00062801
                                                                        00062901
      *------------------------------------------------------------*    00063001
       3000-RESUMO                       SECTION.                       00064001
      *------------------------------------------------------------*    00065001
                                                                        00066001
                   DISPLAY '----------------------------'               00067001
                   DISPLAY '-TOTAL DE REGISTROS LIDOS-       '          00068001
                                                       WRK-ACUM-ANSTA.  00068111
                                                                        00068501
      *------------------------------------------------------------*    00068601
       3000-99-FIM.                      EXIT.                          00068701
      *------------------------------------------------------------*    00068801
                                                                        00068901
                                                                        00069001
      *--------------------------------------------------------------   00070001
       4000-FIMARQ                       SECTION.                       00080001
      *--------------------------------------------------------------   00090001
                                                                        00091001
              CLOSE ARQNOV01                                            00092007
                IF WRK-FS-ARQ NOT EQUAL ZEROS                           00093001
                  MOVE '-ERRO  FEHAMENTO-' TO WRK-MENSAG                00094001
                   PERFORM 9000-TRATAR-ERRO                             00095001
                                                                        00096001
                END-IF.                                                 00097001
                                                                        00098001
      *--------------------------------------------------------------   00099001
       4000-99-FIM.                      EXIT.                          00100001
      *--------------------------------------------------------------   00110001
                                                                        00111001
                                                                        00112001
