      *=======================================================*         00001000
       IDENTIFICATION                            DIVISION.              00002000
      *=======================================================*         00003000
                                                                        00004000
       PROGRAM-ID.  ARQ001.                                             00005000
                                                                        00006000
      *=======================================================*         00006100
                                                                        00006200
                                                                        00006300
      *=======================================================*         00007000
      *     AUTOR   : AUGUSTO MARTINS                                   00008000
      *     EMPRESA : FOURSYS                                           00009000
      *-------------------------------------------------------*         00010000
      *     DATA    : 29/04/2022                                        00020000
      *     OBJETIVO: ABERTURA DO ARQUIVO ARQ001, IMPRIMIR              00021000
      *               A MENSAGEM COM O NUMERO DE STATUS DE              00021100
      *               ABERTURA.                                         00021200
      *=======================================================*         00022000
                                                                        00023000
      *=======================================================*         00024000
       ENVIRONMENT                               DIVISION.              00025000
      *=======================================================*         00026000
       INPUT-OUTPUT                              SECTION.               00026100
       FILE-CONTROL.                                                    00026200
             SELECT ARQNOVO  ASSIGN TO JCLARQ01                         00026300
                FILE STATUS  IS WRK-FS-ARQ.                             00026400
      *=======================================================*         00026500
       DATA                                      DIVISION.              00026600
      *=======================================================*         00026700
       FILE                                      SECTION.               00026800
       FD ARQNOVO                                                       00026900
           RECORDING MODE IS F                                          00027000
           BLOCK CONTAINS 0 RECORDS.                                    00027100
                                                                        00027200
       01 FD-REGISTRO.                                                  00027300
          05 FD-CODIG     PIC X(05).                                    00027400
          05 FD-NOME      PIC X(18).                                    00027500
          05 FD-CARG      PIC X(09).                                    00027600
          05 FD-HORA      PIC 9(08).                                    00027800
                                                                        00027900
      *---------------------------------------------------              00028000
       WORKING-STORAGE                           SECTION.               00028100
      *---------------------------------------------------              00028200
       77 WRK-FS-ARQ    PIC X(02) VALUE SPACES.                         00028300
       77 WRK-MENSAG    PIC X(25) VALUE SPACES.                         00028400
      *---------------------------------------------------              00028500
                                                                        00028600
                                                                        00028700
                                                                        00028800
      *========================================================*        00028900
       PROCEDURE                          DIVISION.                     00029000
      *========================================================*        00029100
                                                                        00029200
      *--------------------------------------------------------*        00029300
       0000-PRINCIPAL                     SECTION.                      00029400
      *--------------------------------------------------------*        00029500
                                                                        00029600
                PERFORM 1000-INICIAR.                                   00029900
                IF WRK-FS-ARQ EQUAL ZEROS                               00030000
                    PERFORM 2000-PROCESSAR                              00030100
                END-IF.                                                 00030200
                PERFORM 9999-FIMARQ.                                    00030300
                STOP RUN.                                               00030400
      *--------------------------------------------------------*        00031000
       0000-99-FIM.                       EXIT.                         00040000
      *--------------------------------------------------------*        00050000
                                                                        00050100
                                                                        00050200
      **********************************************************        00050300
      *               ABRIR ARQUIVO ARQNOVO                    *        00050400
      **********************************************************        00051000
                                                                        00052000
      *--------------------------------------------------------*        00052100
       1000-INICIAR                       SECTION.                      00052200
      *--------------------------------------------------------*        00052300
                                                                        00053000
            OPEN INPUT ARQNOVO                                          00053100
                 IF WRK-FS-ARQ NOT EQUAL ZEROS                          00053200
                    MOVE '-ERRO  DE ABERTURA-' TO WRK-MENSAG            00053300
                    PERFORM  9000-TRATAR-ERRO                           00053400
                 ELSE                                                   00053500
                                                                        00053600
                    DISPLAY 'STATUS OPEN-   '    WRK-FS-ARQ             00053700
                 END-IF.                                                00054000
                                                                        00054100
      *-----------------------------------------------------------*     00055000
       1000-99-FIM.                       EXIT.                         00056000
      *-----------------------------------------------------------*-    00057000
                                                                        00058000
                                                                        00059000
      *-----------------------------------------------------------*     00059100
       2000-PROCESSAR                     SECTION.                      00059200
      *-----------------------------------------------------------*-    00059300
                 READ ARQNOVO                                           00059400
                 IF WRK-FS-ARQ NOT EQUAL ZEROS                          00059500
                    MOVE '-FIM DE ARQUIVO-' TO WRK-MENSAG               00059700
                    PERFORM 9000-TRATAR-ERRO                            00059800
                 ELSE                                                   00059900
                    DISPLAY '-REG- ' WRK-FS-ARQ                         00060000
                 END-IF.                                                00060100
                                                                        00060200
      *-----------------------------------------------------------*     00060300
       2000-99-FIM.                       EXIT.                         00060400
      *-----------------------------------------------------------*-    00060500
                                                                        00060600
                                                                        00061000
      *------------------------------------------------------------     00070000
       9000-TRATAR-ERRO                   SECTION.                      00080000
      *------------------------------------------------------------     00090000
                                                                        00090100
                DISPLAY WRK-MENSAG  WRK-FS-ARQ.                         00091000
                                                                        00091200
      *------------------------------------------------------------*    00092000
       9000-99-FIM.                      EXIT.                          00093000
      *------------------------------------------------------------*    00094000
                                                                        00095000
                                                                        00095100
      *--------------------------------------------------------------   00096000
       9999-FIMARQ                       SECTION.                       00097000
      *--------------------------------------------------------------   00098000
                                                                        00099000
              CLOSE ARQNOVO.                                            00099100
                 IF WRK-FS-ARQ NOT EQUAL ZEROS                          00099300
                    MOVE '-ERRO  FEHAMENTO-' TO WRK-MENSAG              00099400
                    PERFORM 9000-TRATAR-ERRO                            00099500
                 ELSE                                                   00099600
                    DISPLAY '-STATUS CLOSE-   ' WRK-FS-ARQ              00099800
                 END-IF.                                                00099900
                                                                        00110000
      *--------------------------------------------------------------   00111000
       9999-99-FIM.                      EXIT.                          00112000
      *--------------------------------------------------------------   00113000
                                                                        00120000
                                                                        00130000
