      *============================================================*    00001000
       IDENTIFICATION                            DIVISION.              00002000
      *============================================================*    00003000
                                                                        00003100
                                                                        00003200
       PROGRAM-ID.  BALANC.                                             00003300
       AUTHOR.      AUGUSTO MARTINS.                                    00003400
                                                                        00003500
                                                                        00003600
      *============================================================*    00003700
                                                                        00003800
      *                   T R E I N A M E N T O                    *    00003900
                                                                        00004000
      *============================================================*    00005000
      *     EMPRESA    : FOURSYS *                                      00006000
      *     PROGRAMA   : FR03EX01 *                                     00006100
      *     PROGRAMADOR: AUGUSTO MARTINS *                              00006200
      *     ANALISTA   : IVAN PETRUCCI *                                00006300
      *     DATA       : 19/05/2022 *                                   00006400
      *------------------------------------------------------------*    00006500
      *     OBJETIVO   : PROGRAMA SERVE PARA LANÇAR DADOS EM UM    *    00006600
      *                : ARQUIVO DE SAIDA                          *    00006700
      *============================================================*    00006800
                                                                        00006900
                                                                        00007000
      *============================================================*    00007100
       ENVIRONMENT                               DIVISION.              00007200
      *============================================================*    00007300
                                                                        00007400
                                                                        00007500
      *------------------------------------------------------------*    00007600
       CONFIGURATION                             SECTION.               00007700
      *------------------------------------------------------------*    00007800
                                                                        00007900
                                                                        00008000
       SPECIAL-NAMES.                                                   00009000
             DECIMAL-POINT                      IS COMMA.               00010000
                                                                        00010100
                                                                        00010200
      *------------------------------------------------------------*    00010300
       INPUT-OUTPUT                              SECTION.               00010400
      *------------------------------------------------------------*    00010500
                                                                        00010600
       FILE-CONTROL.                                                    00010700
                                                                        00010800
             SELECT CLINT    ASSIGN          TO JCLCLT                  00010900
                             FILE STATUS     IS WRK-FS-CLT.             00011000
                                                                        00011114
             SELECT CLINTE   ASSIGN          TO JCLCLTE                 00011214
                             FILE STATUS     IS WRK-FS-CLTE.            00011314
                                                                        00011417
             SELECT LANC     ASSIGN          TO JCLLNC                  00011517
                             FILE STATUS     IS WRK-FS-LNC.             00011617
                                                                        00012000
      *============================================================*    00019000
       DATA                                      DIVISION.              00020000
      *============================================================*    00021000
                                                                        00021109
      *------------------------------------------------------------*    00021209
       FILE                                      SECTION.               00021309
      *------------------------------------------------------------*    00021409
                                                                        00022000
      *------------------------------------------------------------*    00022100
      *       INPUT - DADOS DO ARQUIVO DE ENTRADA (CLINT)          *    00022219
      *                                           LRECL = 37       *    00022300
      *------------------------------------------------------------*    00022400
                                                                        00023000
       FD CLINT                                                         00023100
           RECORDING MODE IS F                                          00023200
           LABEL RECORD IS STANDARD                                     00023334
           BLOCK CONTAINS 0 RECORDS.                                    00023400
                                                                        00023500
       01 FD-CLINT                        PIC X(37).                    00023600
                                                                        00024000
      *------------------------------------------------------------*    00024119
      *       INPUT - DADOS DO ARQUIVO DE ENTRADA (CLINTE)         *    00024219
      *                                           LRECL = 37       *    00024319
      *------------------------------------------------------------*    00024419
       FD CLINTE                                                        00025014
           RECORDING MODE IS F                                          00026014
           LABEL RECORD IS STANDARD                                     00026134
           BLOCK CONTAINS 0 RECORDS.                                    00027014
                                                                        00028014
       01 FD-CLINTE                       PIC X(37).                    00028114
                                                                        00028217
      *------------------------------------------------------------*    00028319
      *       INPUT - DADOS DO ARQUIVO DE ENTRADA (LANC)           *    00028419
      *                                           LRECL = 18       *    00028519
      *------------------------------------------------------------*    00028619
       FD LANC                                                          00028717
           RECORDING MODE IS F                                          00028817
           LABEL RECORD IS STANDARD                                     00028934
           BLOCK CONTAINS 0 RECORDS.                                    00029017
                                                                        00029117
       01 FD-LANC                         PIC X(18).                    00029219
                                                                        00029317
      *------------------------------------------------------------*    00029400
       WORKING-STORAGE                           SECTION.               00029508
      *------------------------------------------------------------*    00029600
                                                                        00029700
                                                                        00029800
      *------------------------------------------------------------*    00029900
                                                                        00030000
       01 FILLER                          PIC X(050)   VALUE            00030113
             '****** INICIO DA WORKING BALANC *****'.                   00030208
                                                                        00030300
      *------------------------------------------------------------*    00030400
                                                                        00031000
                                                                        00031600
      *------------------------------------------------------------*    00031700
       01 FILLER                          PIC X(050)   VALUE            00031800
             '*******AREA PARA CHAMAR MODULO ***'.                      00031905
      *------------------------------------------------------------*    00032000
                                                                        00032100
       01 WRK-MOD      PIC X(06) VALUE 'GRAVAR'.                        00032209
                                                                        00035200
      *------------------------------------------------------------*    00038600
                                                                        00038700
                                                                        00038800
      *------------------------------------------------------------*    00038900
       01 FILLER                          PIC X(050)   VALUE            00039000
             '*******TESTE DE FILE STATUS ******'.                      00039100
      *------------------------------------------------------------*    00039200
                                                                        00039300
       77 WRK-FS-CLT                      PIC 9(02) VALUE ZEROS.        00039422
       77 WRK-FS-CLTE                     PIC 9(02) VALUE ZEROS.        00039514
       77 WRK-FS-LNC                      PIC 9(02) VALUE ZEROS.        00039619
                                                                        00039719
      *------------------------------------------------------------*    00039819
                                                                        00039919
                                                                        00040800
      *------------------------------------------------------------*    00040900
       01 FILLER                          PIC X(050)   VALUE            00041000
             '*****AREA DE BOOK******'.                                 00041100
      *------------------------------------------------------------*    00041200
                                                                        00041300
                COPY 'B#CLT'.                                           00041401
                COPY 'B#GLOG'.                                          00041503
                COPY 'B#LNC'.                                           00041617
                                                                        00041717
      *------------------------------------------------------------*    00041800
                                                                        00041900
                                                                        00042000
      *============================================================*    00042100
       PROCEDURE                                 DIVISION.              00042208
      *============================================================*    00042300
                                                                        00042400
                                                                        00042500
      *------------------------------------------------------------*    00042600
                                                                        00042700
      *           R O T I N A  P R I N C I P A L                   *    00042800
                                                                        00042900
      *------------------------------------------------------------*    00043000
                                                                        00043100
                                                                        00043300
      *------------------------------------------------------------*    00043400
       0000-PRINCIPAL                            SECTION.               00043508
      *------------------------------------------------------------*    00043600
                                                                        00043700
             PERFORM 1000-INICIAR.                                      00043800
                                                                        00043900
                                                                        00044000
             PERFORM 2000-PROCESSAR UNTIL WRK-FS-CLT  EQUAL 10          00044139
                                     AND  WRK-FS-LNC  EQUAL 10.         00044237
                                                                        00044400
             PERFORM 4000-FINALIZAR.                                    00044500
                                                                        00044633
                                                                        00044800
      *------------------------------------------------------------*    00044900
       0000-99-FIM.                              EXIT.                  00045008
      *------------------------------------------------------------*    00045100
                                                                        00045200
                                                                        00045300
      *------------------------------------------------------------*    00045400
                                                                        00045500
      *           P R O C E D I M E N T O S   I N I C I A I S      *    00045600
                                                                        00045700
      *------------------------------------------------------------*    00045800
                                                                        00045900
                                                                        00046000
                                                                        00046100
      *------------------------------------------------------------*    00046200
       1000-INICIAR                              SECTION.               00046308
      *------------------------------------------------------------*    00046400
                                                                        00046500
             OPEN INPUT   CLINT LANC                                    00046626
                  OUTPUT  CLINTE                                        00046735
             PERFORM 1100-TESTAR-FILE-STATUS                            00046800
                                                                        00046900
                  READ CLINT  INTO WRK-CLIENT                           00047049
                  READ LANC   INTO WRK-LANCAMENTO                       00047149
                                                                        00047250
                                                                        00047518
             PERFORM 1300-VERIFICAR-VAZIO.                              00047600
                                                                        00047746
                                                                        00048400
      *------------------------------------------------------------*    00048500
       1000-99-FIM.                              EXIT.                  00048608
      *------------------------------------------------------------*    00048700
                                                                        00048800
                                                                        00048900
      *------------------------------------------------------------*    00049000
                                                                        00049100
      *           T E S T E   D E  F I L E  S T A T U S            *    00049200
                                                                        00049300
      *------------------------------------------------------------*    00049400
                                                                        00049500
                                                                        00049600
      *------------------------------------------------------------*    00049700
       1100-TESTAR-FILE-STATUS                   SECTION.               00049808
      *------------------------------------------------------------*    00049900
                                                                        00050000
                  IF WRK-FS-CLT NOT EQUAL ZEROS                         00050101
                                                                        00050200
                     MOVE 'BALANC'                 TO WRK-PROGRAMA      00050305
                     MOVE 'ERRO NO OPEN CLT '      TO WRK-MENSAGEM      00050415
                     MOVE '1000'                   TO WRK-SECAO         00050505
                     MOVE WRK-FS-CLT               TO WRK-STATUS        00050705
                                                                        00050804
                      PERFORM 9000-TRATAR-ERRO                          00050904
                                                                        00051004
                  END-IF                                                00051115
                                                                        00051600
                  IF WRK-FS-CLTE NOT EQUAL ZEROS                        00051715
                                                                        00051815
                     MOVE 'BALANC'                 TO WRK-PROGRAMA      00051915
                     MOVE 'ERRO NO OPEN CLINTE'    TO WRK-MENSAGEM      00052015
                     MOVE '1000'                   TO WRK-SECAO         00052115
                     MOVE WRK-FS-CLTE              TO WRK-STATUS        00052215
                                                                        00052315
                      PERFORM 9000-TRATAR-ERRO                          00052415
                                                                        00052515
                  END-IF                                                00052619
                                                                        00052715
                  IF WRK-FS-LNC NOT EQUAL ZEROS                         00052819
                                                                        00052919
                     MOVE 'BALANC'                 TO WRK-PROGRAMA      00053019
                     MOVE 'ERRO NO OPEN LANC'    TO WRK-MENSAGEM        00053119
                     MOVE '1000'                   TO WRK-SECAO         00053219
                     MOVE WRK-FS-LNC               TO WRK-STATUS        00053319
                                                                        00053419
                      PERFORM 9000-TRATAR-ERRO                          00053519
                                                                        00053619
                  END-IF.                                               00053719
                                                                        00053819
      *------------------------------------------------------------*    00053900
       1100-99-FIM.                              EXIT.                  00054008
      *------------------------------------------------------------*    00054100
                                                                        00054200
                                                                        00054300
                                                                        00054400
      *------------------------------------------------------------*    00054500
       1200-TESTAR-FILE-STATUS                   SECTION.               00054608
      *------------------------------------------------------------*    00054700
                                                                        00054805
                  IF WRK-FS-CLT NOT EQUAL ZEROS                         00054905
                                                                        00055005
                     MOVE 'BALANC'                  TO WRK-PROGRAMA     00055105
                     MOVE 'ERRO NO CLOSE CLT'       TO WRK-MENSAGEM     00055215
                     MOVE '1000'                    TO WRK-SECAO        00055305
                     MOVE WRK-FS-CLT                TO WRK-STATUS       00055405
                                                                        00055505
                      PERFORM 9000-TRATAR-ERRO                          00055605
                                                                        00055705
                  END-IF                                                00055815
                                                                        00055900
                  IF WRK-FS-CLTE NOT EQUAL ZEROS                        00056015
                                                                        00056115
                     MOVE 'BALANC'                  TO WRK-PROGRAMA     00056215
                     MOVE 'ERRO NO CLOSE CLINTE'    TO WRK-MENSAGEM     00056315
                     MOVE '1000'                    TO WRK-SECAO        00056415
                     MOVE WRK-FS-CLTE               TO WRK-STATUS       00056515
                                                                        00056615
                      PERFORM 9000-TRATAR-ERRO                          00056715
                                                                        00056815
                  END-IF                                                00056919
                                                                        00057019
                                                                        00057100
                  IF WRK-FS-LNC NOT EQUAL ZEROS                         00057219
                                                                        00057319
                     MOVE 'BALANC'                  TO WRK-PROGRAMA     00057419
                     MOVE 'ERRO NO CLOSE LANC'      TO WRK-MENSAGEM     00057519
                     MOVE '1000'                    TO WRK-SECAO        00057619
                     MOVE WRK-FS-LNC                TO WRK-STATUS       00057719
                                                                        00057819
                      PERFORM 9000-TRATAR-ERRO                          00057919
                                                                        00058019
                  END-IF.                                               00058119
      *------------------------------------------------------------*    00058200
       1200-99-FIM.                              EXIT.                  00058308
      *------------------------------------------------------------*    00058400
                                                                        00058500
                                                                        00058600
      *------------------------------------------------------------*    00058700
                                                                        00058800
      *           V R I F I C A R  V A Z I O                       *    00058900
                                                                        00059000
      *------------------------------------------------------------*    00059100
                                                                        00059200
                                                                        00059300
      *------------------------------------------------------------*    00059400
       1300-VERIFICAR-VAZIO                      SECTION.               00059508
      *------------------------------------------------------------*    00059600
                                                                        00059700
                  IF WRK-FS-CLT NOT EQUAL ZEROS                         00059805
                                                                        00059900
                     DISPLAY 'FINAL DE ARQUIVO CLT '                    00060019
                                                                        00060100
                      PERFORM 4000-FINALIZAR                            00060200
                                                                        00060300
                  END-IF.                                               00060400
                                                                        00060519
                                                                        00060600
                  IF WRK-FS-CLTE  NOT EQUAL ZEROS                       00060719
                                                                        00060819
                     DISPLAY 'FINAL DE ARQUIVO CLTE '                   00060919
                                                                        00061019
                      PERFORM 4000-FINALIZAR                            00061119
                                                                        00061219
                  END-IF.                                               00061319
                                                                        00061419
                  IF WRK-FS-LNC  NOT EQUAL ZEROS                        00061519
                                                                        00061619
                     DISPLAY 'FINAL DE ARQUIVO LNC '                    00061719
                                                                        00061819
                      PERFORM 4000-FINALIZAR                            00061919
                                                                        00062019
                  END-IF.                                               00062119
      *------------------------------------------------------------*    00062200
       1300-99-FIM.                              EXIT.                  00062308
      *------------------------------------------------------------*    00062400
                                                                        00062500
                                                                        00062600
      *------------------------------------------------------------*    00062700
                                                                        00062800
      *          P R O C E S S A R  A R Q P E C A S                *    00062900
      *          E  M O V I M E N T A R  P A R A   P E C A C O M P *    00063000
      *------------------------------------------------------------*    00063100
                                                                        00063200
                                                                        00063300
      *------------------------------------------------------------*    00063400
       2000-PROCESSAR                            SECTION.               00063508
      *------------------------------------------------------------*    00063600
                                                                        00063708
              EVALUATE TRUE                                             00063822
                  WHEN WRK-CHAVE-CLINT LESS WRK-LANC-CHAVE              00063947
                    WRITE FD-CLINTE  FROM  WRK-CLIENT                   00064259
                     READ CLINT INTO WRK-CLIENT                         00064360
                                                                        00064457
                  WHEN WRK-CHAVE-CLINT EQUAL WRK-LANC-CHAVE             00064523
                     PERFORM 2200-ATUALIZAR-SALDO                       00064823
                     PERFORM 2100-LER-LANCAM                            00064923
                                                                        00065057
                  WHEN OTHER                                            00065123
                     DISPLAY 'CHAVE ERRADA'                             00065223
                     PERFORM 2100-LER-LANCAM                            00065323
              END-EVALUATE.                                             00065423
                                                                        00065523
      *------------------------------------------------------------*    00065623
       2000-99-FIM.                              EXIT.                  00065723
      *------------------------------------------------------------*    00065823
                                                                        00065923
                                                                        00066023
      *------------------------------------------------------------*    00066100
       2200-ATUALIZAR-SALDO                      SECTION.               00066223
      *------------------------------------------------------------*    00066300
                                                                        00066423
                IF WRK-TIPO EQUAL 'C'                                   00066523
                   ADD WRK-LANC TO WRK-SALDO                            00066623
                ELSE                                                    00066952
                   SUBTRACT WRK-LANC FROM WRK-SALDO                     00067052
                END-IF.                                                 00067152
                                                                        00067259
      *------------------------------------------------------------*    00067352
       2100-LER-LANCAM                           SECTION.               00067452
      *------------------------------------------------------------*    00067552
                                                                        00067652
               READ LANC INTO WRK-LANCAMENTO                            00067758
                                                                        00067852
               IF WRK-FS-LNC  EQUAL 10                                  00067952
                  MOVE HIGH-VALUES TO WRK-LANC-CHAVE                    00068052
               END-IF.                                                  00068152
                                                                        00068252
      *------------------------------------------------------------*    00068352
       2100-99-FIM.                              EXIT.                  00068452
      *------------------------------------------------------------*    00068552
                                                                        00068652
                                                                        00068823
                                                                        00068923
      *------------------------------------------------------------*    00069000
                                                                        00069100
      *              T R A T A R   D E    E R R O                  *    00069200
                                                                        00069300
      *------------------------------------------------------------*    00069400
                                                                        00069500
                                                                        00069600
      *------------------------------------------------------------*    00069700
       9000-TRATAR-ERRO                          SECTION.               00069808
      *------------------------------------------------------------*    00069900
                                                                        00070000
              CALL WRK-MOD   USING WRK-LOG                              00070105
              PERFORM 4000-FINALIZAR.                                   00070209
                                                                        00070300
      *------------------------------------------------------------*    00070600
       9000-99-FIM.                              EXIT.                  00070708
      *------------------------------------------------------------*    00070800
                                                                        00070900
                                                                        00071000
      *------------------------------------------------------------*    00071100
                                                                        00071200
      *              F I N A L I Z A C A O                         *    00071300
                                                                        00071400
      *------------------------------------------------------------*    00071500
                                                                        00071600
                                                                        00071700
      *------------------------------------------------------------*    00071800
       4000-FINALIZAR                            SECTION.               00071908
      *------------------------------------------------------------*    00072000
                                                                        00072100
             CLOSE CLINT CLINTE                                         00072233
                   LANC.                                                00072633
                   PERFORM 1200-TESTAR-FILE-STATUS.                     00072733
               STOP RUN.                                                00072836
                                                                        00073700
      *------------------------------------------------------------*    00073800
       4000-99-FIM.                              EXIT.                  00073908
      *------------------------------------------------------------*    00074000
                                                                        00075000
                                                                        00076000
