      *=======================================================*         00010001
       IDENTIFICATION                            DIVISION.              00011001
      *=======================================================*         00012001
                                                                        00013001
       PROGRAM-ID. F03CIP3.                                             00014001
                                                                        00015001
      *=======================================================*         00016001
      *             T  R  E  I  N  A  M  E  N  T  O                     00017001
      *=======================================================*         00018001
      *     PROGRAMA......: F03CIP3                                     00019001
      *     TIPO..........: SERVICO DE ACESSO A DADOS                   00020001
      *-------------------------------------------------------*         00021001
      *    PROGRAMADOR(A): AUGUSTO MARTINS  - TREINAMENTO               00021101
      *    ANALISTA......: IVAN PETRUCCI    - TREINAMENTO               00021201
      *    DATA..........: 28/06/2022                                   00021301
      *-------------------------------------------------------*         00021401
      *-------------------------------------------------------*         00021501
      *    OBJETIVO..: CRIAR FERRAMENTAS PARA MANIPULAR DADOS *         00021601
      *                DENTRO DO CICS.INSERIR,DELETAR,UPDATE  *         00021701
      *                SAIR, CONSULTAR E ATUALIZAR PAGINA.    *         00021801
      *                                                       *         00021901
      *-------------------------------------------------------*         00022001
      *=======================================================*         00022101
       DATA                                       DIVISION.             00022201
      *=======================================================*         00022301
                                                                        00022401
      *-------------------------------------------------------*         00022501
       WORKING-STORAGE                            SECTION.              00022601
      *-------------------------------------------------------*         00022701
                                                                        00022801
                                                                        00022901
      *-------------------------------------------------------*         00023001
       01 FILLER                          PIC X(050)   VALUE            00023101
                 '*******AREA DA  BOOK   ******'.                       00023201
      *-------------------------------------------------------*         00023301
                                                                        00023401
            COPY F03CIM1.                                               00023501
            COPY DFHAID.                                                00023601
                                                                        00023701
      *-------------------------------------------------------*         00023801
       01 FILLER                          PIC X(050)   VALUE            00023901
                 '*******AREA DB2  ********'.                           00024001
      *-------------------------------------------------------*         00024101
                                                                        00024201
                                                                        00024301
                                                                        00024401
      *-------------------------------------------------------*         00024501
       01 FILLER                          PIC X(050)   VALUE            00024601
                '*******AREA DE AUXILIARES********'.                    00024701
      *-------------------------------------------------------*         00024801
       77 WRK-SAIDA       PIC X(40)  VALUE SPACES.                      00024901
       77 WRK-FASE        PIC 9(01).                                    00025001
       77 WRK-FLAG        PIC S9(04).                                   00026001
       77 WRK-FLAG-CICS   PIC S9(04).                                   00027001
       01 WRK-RET-CICS    PIC S9(04) COMP.                              00027101
       01 WRK-DADOS.                                                    00027201
          05 WRK-CHAVE    PIC X(05).                                    00027301
          05 WRK-NOME     PIC X(30).                                    00027401
          05 WRK-SETOR    PIC X(04).                                    00027501
          05 WRK-SALARIO  PIC X(10).                                    00027601
          05 WRK-DATAADM  PIC X(10).                                    00027701
          05 WRK-EMAIL    PIC X(40).                                    00027801
      *=======================================================*         00027901
       PROCEDURE                                  DIVISION.             00028001
      *=======================================================*         00029001
                                                                        00029101
                                                                        00029201
      *-------------------------------------------------------*         00029301
                                                                        00029401
      *         R O T I N A  P R I N C I P A L *                        00029501
                                                                        00029601
      *-------------------------------------------------------*         00029701
                                                                        00029801
      *-------------------------------------------------------*         00029901
       0000-PRINCIPAL                              SECTION.             00030001
      *-------------------------------------------------------*         00040001
                                                                        00050001
                  PERFORM 1000-INICIAR-CICS                             00051001
                                                                        00051101
                  PERFORM 2000-PROCESSAR                                00051201
                                                                        00051301
                  PERFORM 3000-FINALIZAR-CICS                           00051401
                                                                        00051501
                  EXEC CICS                                             00051601
                    RETURN TRANSID('T033')                              00051701
                    COMMAREA(WRK-FASE)                                  00051801
                  END-EXEC.                                             00051901
                                                                        00052001
      *-------------------------------------------------------*         00052101
       0000-999-FIM.                               EXIT.                00052201
      *-------------------------------------------------------*         00052301
                                                                        00052401
                                                                        00052501
      *-------------------------------------------------------*         00052601
       1000-INICIAR-CICS                          SECTION.              00052701
      *-------------------------------------------------------*         00052801
                                                                        00052901
                IF EIBCALEN EQUAL 0                                     00053001
                   EXEC CICS SEND                                       00054001
                     MAPSET('F03CIM1')                                  00054101
                     MAP('MAPTEST')                                     00054201
                     ERASE                                              00054301
                     MAPONLY                                            00054401
                  END-EXEC                                              00054501
                     MOVE 2 TO  WRK-FASE                                00054601
                END-IF.                                                 00054701
                                                                        00054801
      *-------------------------------------------------------*         00054901
       1000-999-FIM.                              EXIT.                 00055001
      *-------------------------------------------------------*         00056001
                                                                        00056101
                                                                        00056201
      *-------------------------------------------------------*         00056301
       2000-PROCESSAR                             SECTION.              00056401
      *-------------------------------------------------------*         00056501
                                                                        00056601
                EXEC CICS RECEIVE                                       00056701
                  MAPSET('F03CIM1')                                     00056801
                  MAP('MAPTEST')                                        00056901
                  INTO(MAPTESTI)                                        00057001
                END-EXEC                                                00057101
                                                                        00057201
                EVALUATE EIBAID                                         00057301
                  WHEN 6                                                00057401
                    PERFORM 2100-CONSULTAR                              00057501
                  WHEN 5                                                00057601
                    PERFORM 2200-INSERIR                                00057701
                  WHEN 8                                                00057801
                    PERFORM 2300-UPDATE                                 00057901
                  WHEN 9                                                00058001
                    PERFORM 2400-DELETAR                                00058101
                  WHEN 3                                                00058201
                    PERFORM 2500-SAIR                                   00058301
                  WHEN ''''                                             00058401
                    PERFORM 2600-ATUALIZAR                              00058501
                  WHEN OTHER                                            00058601
                    MOVE 'ERRO DE OPERACAO'  TO MSGO                    00058701
                END-EVALUATE.                                           00058801
                                                                        00058901
      *-------------------------------------------------------*         00059001
       2000-999-FIM.                              EXIT.                 00059101
      *-------------------------------------------------------*         00059201
                                                                        00059301
      *********************************************************         00059401
      *             BOTAO F6 - CONSULTAR                      *         00059501
      *********************************************************         00059601
                                                                        00059701
      *-------------------------------------------------------*         00059801
       2100-CONSULTAR                             SECTION.              00059901
      *-------------------------------------------------------*         00060001
                                                                        00061001
               MOVE IDI                 TO WRK-CHAVE                    00061101
                                                                        00061201
               EXEC CICS READ                                           00061301
                    FILE('FUNC')                                        00061401
                    RIDFLD(WRK-CHAVE)                                   00061501
                    INTO(WRK-DADOS)                                     00061601
                    RESP(WRK-RET-CICS)                                  00061701
               END-EXEC                                                 00061801
              IF WRK-RET-CICS EQUAL DFHRESP(NORMAL)                     00061901
                                                                        00062001
                   MOVE WRK-CHAVE       TO IDO                          00062101
                   MOVE WRK-NOME        TO NOMEO                        00062201
                   MOVE WRK-SETOR       TO SETORO                       00062301
                   MOVE WRK-SALARIO     TO SALO                         00062401
                   MOVE WRK-DATAADM     TO DATADMO                      00062501
                   MOVE WRK-EMAIL       TO EMAILO                       00062601
                   MOVE '--ENCONTRADO--' TO MSGO                        00062701
               END-IF                                                   00062801
                                                                        00062901
               IF WRK-RET-CICS EQUAL DFHRESP(NOTFND)                    00063001
                   MOVE '--NAO ENCONTRADO--' TO MSGO                    00063101
               END-IF.                                                  00063201
                                                                        00063301
                                                                        00063401
      *-------------------------------------------------------*         00063501
       2100-999-FIM.                              EXIT.                 00063601
      *-------------------------------------------------------*         00063701
                                                                        00063801
      *********************************************************         00063901
      *             BOTAO F5 - INSERIR                        *         00064001
      *********************************************************         00065001
                                                                        00066001
      *-------------------------------------------------------*         00067001
       2200-INSERIR                               SECTION.              00068001
      *-------------------------------------------------------*         00069001
                                                                        00070001
                                                                        00080001
      *-------------------------------------------------------*         00090001
       2200-999-FIM.                              EXIT.                 00100001
      *-------------------------------------------------------*         00110001
                                                                        00120001
      *********************************************************         00130001
      *             BOTAO F8 - UPDATE                         *         00131001
      *********************************************************         00132001
                                                                        00133001
      *-------------------------------------------------------*         00134001
       2300-UPDATE                                SECTION.              00135001
      *-------------------------------------------------------*         00136001
                                                                        00137001
                                                                        00138001
      *-------------------------------------------------------*         00139001
       2300-999-FIM.                              EXIT.                 00140001
      *-------------------------------------------------------*         00141001
                                                                        00142001
      *********************************************************         00143001
      *             BOTAO F9 - DELETAR                        *         00144001
      *********************************************************         00145001
                                                                        00146001
      *-------------------------------------------------------*         00147001
       2400-DELETAR                               SECTION.              00148001
      *-------------------------------------------------------*         00148101
                                                                        00148201
                                                                        00148301
                                                                        00148401
                                                                        00148501
      *-------------------------------------------------------*         00148601
       2400-999-FIM.                              EXIT.                 00148701
      *-------------------------------------------------------*         00148801
                                                                        00148901
      *********************************************************         00149001
      *             BOTAO F3 - SAIR                           *         00150001
      *********************************************************         00151001
                                                                        00152001
      *-------------------------------------------------------*         00153001
       2500-SAIR                                  SECTION.              00153101
      *-------------------------------------------------------*         00153201
                                                                        00153301
               MOVE '--OBRIGADO--'          TO WRK-SAIDA                00153401
                                                                        00153501
               EXEC CICS SEND TEXT                                      00153601
                 FROM(WRK-SAIDA)                                        00153701
                 ERASE                                                  00153801
               END-EXEC                                                 00153901
                                                                        00154001
               EXEC CICS                                                00154101
                 RETURN                                                 00154201
               END-EXEC.                                                00154301
                                                                        00154401
      *-------------------------------------------------------*         00154501
       2500-999-FIM.                              EXIT.                 00154601
      *-------------------------------------------------------*         00154701
                                                                        00154801
      *********************************************************         00154901
      *             BOTAO ENTER - ATUALIZAR                 *           00155001
      *********************************************************         00155101
                                                                        00155201
      *-------------------------------------------------------*         00155301
       2600-ATUALIZAR                             SECTION.              00155401
      *-------------------------------------------------------*         00155501
                                                                        00155601
                                                                        00155701
                                                                        00155801
               MOVE SPACES                                              00155901
                    TO NOMEO SETORO EMAILO DATADMO                      00156001
               MOVE ZEROS              TO SALO IDO                      00157001
               MOVE 'YYYY-MM-DD'       TO FORMO                         00158001
               MOVE 'PROXIMA OPERACAO' TO MSGO.                         00158101
                                                                        00158201
      *-------------------------------------------------------*         00158301
       2600-999-FIM.                              EXIT.                 00158401
      *-------------------------------------------------------*         00158501
                                                                        00158601
                                                                        00158701
      *-------------------------------------------------------*         00158801
       3000-FINALIZAR-CICS                        SECTION.              00158901
      *-------------------------------------------------------*         00159001
                                                                        00160001
                EXEC CICS SEND                                          00161001
                  MAPSET('F03CIM1')                                     00161101
                  MAP('MAPTEST')                                        00161201
                  DATAONLY                                              00161301
                  FROM(MAPTESTO)                                        00161401
                END-EXEC.                                               00161501
                                                                        00161601
      *-------------------------------------------------------*         00161701
       3000-999-FIM.                              EXIT.                 00161801
      *-------------------------------------------------------*         00161901
                                                                        00162001
