                                                                        00001000
      *=======================================================*         00002000
       IDENTIFICATION                            DIVISION.              00003000
      *=======================================================*         00004000
                                                                        00005000
       PROGRAM-ID.  F03CIP1.                                            00006000
                                                                        00007000
      *=======================================================*         00008000
      *              TREINAMENTO MAINFRAME                    *         00009000
      *=======================================================*         00010000
      *     AUTOR    : AUGUSTO MARTINS                                  00020000
      *     EMPRESA  : FOURSYS                                          00030000
      *     DATA     : 16/06/2022                                       00040000
      *     OBJETIVO : PROGRAMA CRIADO PARA UMA ESTRUTURA CICS
      *              :
      *=======================================================*         00070000
       ENVIRONMENT                                    DIVISION.         00080000
      *=======================================================*         00081000
                                                                        00081100
      *=======================================================*         00081200
       CONFIGURATION                                  SECTION.          00081300
      *=======================================================*         00081400
                                                                        00081500
          SPECIAL-NAMES.                                                00081600
              DECIMAL-POINT IS COMMA.                                   00081700
                                                                        00081800
      *=======================================================*         00081900
                                                                        00082000
      *=======================================================*         00082100
       DATA                                       DIVISION.             00082200
      *=======================================================*         00082300
                                                                        00082400
      *-------------------------------------------------------*         00082500
       WORKING-STORAGE                            SECTION.              00082600
      *-------------------------------------------------------*         00082700
                                                                        00082800
      *-------------------------------------------------------*         00082900
        01 FILLER                          PIC X(050)   VALUE           00083000
                '*******AREA CICS ******'.                              00083100
      *-------------------------------------------------------*         00083200
                                                                        00083300

             COPY F03CIM1

      *=======================================================*         00090600
       PROCEDURE                                  DIVISION.             00090700
      *=======================================================*         00090800
                                                                        00090900
                                                                        00091000
      *-------------------------------------------------------*         00091100
                                                                        00091200
      *         R O T I N A  P R I N C I P A L *                        00091300
                                                                        00091400
      *-------------------------------------------------------*         00091500
                                                                        00091600
                                                                        00091700
      *-------------------------------------------------------*         00091800
       0000-PRINCIPAL                              SECTION.             00091900
      *-------------------------------------------------------*         00092000
                                                                        00092100
            PERFORM 1000-INICIAR-CICS.                                  00092200
            PERFORM 2000-PROCESSAR.                                     00092300
            PERFORM 3000-FINALIZAR-CICS.                                     000

                                                                        00092500
      *-------------------------------------------------------*         00092600
       0000-999-FIM.                               EXIT.                00092700
      *-------------------------------------------------------*         00092800

			
                                                                        00093000
      *-------------------------------------------------------*         00093100
       1000-INICIAR-CICS                           SECTION.             00093200
      *-------------------------------------------------------*         00093300
            EXEC CICS SEND
                MAPSET('F03CIM1')
                MAP('MAPTEST')
                ERASE
                MAPONLY
            END-EXEC.

            EXEC CICS RECEIVE
                MAPSET('F03CIM1')
                MAP('MAPTEST')
                INTO(MAPTESTI)
            END-EXEC.



      *-------------------------------------------------------*
       1000-999-FIM.                              EXIT.
      *-------------------------------------------------------*         00095700
                                                                        00095800
                                                                        00095900
      *-------------------------------------------------------*         00096000
       2000-PROCESSAR                             SECTION.              00096100
      *-------------------------------------------------------*

	        MOVE 'DODO'                        TO NOMEO
            EXEC CICS SEND
                MAPSET('F03CIM1')
                MAP('MAPTEST')
                DATAONLY
             END-EXEC.
										
      *-------------------------------------------------------*         00105300
       2000-999-FIM.                              EXIT.                 00105400
      *-------------------------------------------------------*         00105500
                                                                        00105600
                                                                        00105700

                                                                        00108600
      *-------------------------------------------------------*         00108700
       6000-DADOS-ALTERADOS                       SECTION.              00108800
      *-------------------------------------------------------*         00108900

                                                                        00110000
      *-------------------------------------------------------*         00111000
       6000-999-FIM.                              EXIT.                 00111100
      *-------------------------------------------------------*         00111200
                                                                        00111300
                                                                        00111400
      *-------------------------------------------------------*         00111500
       3000-FINALIZAR-CICS                        SECTION.              00111600
      *-------------------------------------------------------*         00111700
                                                                        00111800
            EXEC CICS
                RETURN
            END-EXEC.
                                                                        00112000
      *-------------------------------------------------------*         00112100
       3000-999-FIM.                              EXIT.                 00112200
      *-------------------------------------------------------*         00112300
                                                                        00112400
