      *=======================================================*         00010099
       IDENTIFICATION                            DIVISION.              00011099
      *=======================================================*         00012099
                                                                        00013099
       PROGRAM-ID. F03CIP2.                                             00014099
                                                                        00015099
      *=======================================================*         00016099
      *             T  R  E  I  N  A  M  E  N  T  O                     00017099
      *=======================================================*         00018099
      *     PROGRAMA......: F03CIP2                                     00019099
      *     TIPO..........: SERVICO DE ACESSO A DADOS                   00020099
      *-------------------------------------------------------*         00021099
      *    PROGRAMADOR(A): AUGUSTO MARTINS  - TREINAMENTO               00021199
      *    ANALISTA......: IVAN PETRUCCI    - TREINAMENTO               00021299
      *    DATA..........: 30/06/2022                                   00021399
      *-------------------------------------------------------*         00021499
      *-------------------------------------------------------*         00021599
      *    OBJETIVO..: CRIAR UM PROGRAMA QUE PODE CONSUMIR    *         00021699
      *                DADOS DO PROGRAMA F03COVSA.            *         00021799
      *-------------------------------------------------------*         00021899
      *=======================================================*         00021999
       DATA                                       DIVISION.             00022099
      *=======================================================*         00022199
                                                                        00022299
      *-------------------------------------------------------*         00022399
       WORKING-STORAGE                            SECTION.              00022499
      *-------------------------------------------------------*         00022599
                                                                        00022699
                                                                        00022799
      *-------------------------------------------------------*         00022899
       01 FILLER                          PIC X(050)   VALUE            00022999
                 '*******AREA DA  BOOK   ******'.                       00023099
      *-------------------------------------------------------*         00023199
                                                                        00023399
            COPY F03CIM1.                                               00023499
                                                                        00023699
      *-------------------------------------------------------*         00023799
      *01 FILLER                          PIC X(050)   VALUE            00023899
      *          '*******AREA DB2  ********'.                           00023999
      *-------------------------------------------------------*         00024099
                                                                        00024199
                                                                        00025099
                                                                        00025199
      *-------------------------------------------------------*         00025299
       01 FILLER                          PIC X(050)   VALUE            00025399
                '*******AREA DE AUXILIARES********'.                    00025499
      *-------------------------------------------------------*         00025599
                                                                        00025699
       01 WRK-DADOS.                                                    00025899
          05 WRK-CHAVE    PIC X(05).                                    00026099
          05 WRK-NOME     PIC X(30).                                    00027099
          05 WRK-SETOR    PIC X(04).                                    00028099
          05 WRK-SALARIO  PIC X(10).                                    00028199
          05 WRK-DATAADM  PIC X(10).                                    00028299
          05 WRK-EMAIL    PIC X(40).                                    00028399
          05 WRK-STATUS   PIC X(01).                                    00028499
                                                                        00028599
       77 WRK-RET         PIC S9(04) COMP.                              00028699
       77 WRK-SAIDA       PIC X(30).                                    00028799
       77 WRK-FLAG        PIC 9(01).                                    00028899
       77 WRK-SQLCODE     PIC -999.                                     00028999
       77 WRK-EMAIL-NULL  PIC S9(04) COMP.                              00029099
                                                                        00029199
      *=======================================================*         00029499
       PROCEDURE                                  DIVISION.             00029599
      *=======================================================*         00029699
                                                                        00029799
                                                                        00029899
      *-------------------------------------------------------*         00029999
                                                                        00030099
      *         R O T I N A  P R I N C I P A L                *         00030199
                                                                        00030299
      *-------------------------------------------------------*         00030399
                                                                        00030499
      *-------------------------------------------------------*         00030599
       0000-PRINCIPAL                              SECTION.             00030699
      *-------------------------------------------------------*         00030799
                                                                        00030899
                  PERFORM 1000-INICIAR-CICS                             00030999
                                                                        00031099
                  PERFORM 2000-PROCESSAR                                00032099
                                                                        00033099
                  PERFORM 3000-FINALIZAR-CICS                           00034099
                                                                        00035099
                  EXEC CICS                                             00036099
                    RETURN TRANSID('T032')                              00037099
                  END-EXEC.                                             00038099
                                                                        00039099
      *-------------------------------------------------------*         00040099
       0000-999-FIM.                               EXIT.                00050099
      *-------------------------------------------------------*         00051099
                                                                        00052099
                                                                        00053099
      *-------------------------------------------------------*         00054099
       1000-INICIAR-CICS                          SECTION.              00054199
      *-------------------------------------------------------*         00054299
                                                                        00054399
                  EXEC CICS RECEIVE                                     00054499
                    MAPSET('F03CIM1')                                   00054599
                    MAP('MAPTEST')                                      00054699
                    INTO(MAPTESTI)                                      00054799
                    RESP(WRK-RET)                                       00054899
                  END-EXEC.                                             00054999
                                                                        00055199
                  IF WRK-RET EQUAL DFHRESP(MAPFAIL)                     00055299
                     MOVE 1 TO WRK-FLAG                                 00055399
                   ELSE                                                 00055499
                     MOVE 2 TO WRK-FLAG                                 00055599
                  END-IF.                                               00055699
                                                                        00055899
      *-------------------------------------------------------*         00055999
       1000-999-FIM.                              EXIT.                 00056099
      *-------------------------------------------------------*         00056199
                                                                        00056299
                                                                        00056399
      *-------------------------------------------------------*         00056499
       2000-PROCESSAR                             SECTION.              00056599
      *-------------------------------------------------------*         00056699
                                                                        00056799
                 EVALUATE EIBAID                                        00056899
                   WHEN 3                                               00056999
                     PERFORM 2100-SAIR                                  00057099
                   WHEN 6                                               00057199
                     PERFORM 2200-ROTINA-SELECAO                        00058099
                   WHEN ''''                                            00059699
                     PERFORM 2300-ATUALIZAR                             00059799
                   WHEN OTHER                                           00059899
                     MOVE 'ERRO DE OPERACAO'  TO MSGO                   00060099
                 END-EVALUATE.                                          00061399
                                                                        00061499
      *-------------------------------------------------------*         00061599
       2000-999-FIM.                              EXIT.                 00061699
      *-------------------------------------------------------*         00061799
                                                                        00061899
                                                                        00061999
      *********************************************************         00062099
      *               TECLA F3 SAIR                           *         00062199
      *********************************************************         00062299
                                                                        00062399
                                                                        00062499
      *-------------------------------------------------------*         00062599
       2100-SAIR                                  SECTION.              00062699
      *-------------------------------------------------------*         00062799
                                                                        00062899
                  MOVE '-FIM PROCESSAMENTO-' TO WRK-SAIDA               00062999
                                                                        00063099
                  EXEC CICS SEND                                        00063199
                   FROM(WRK-SAIDA)                                      00063299
                   ERASE                                                00063799
                  END-EXEC.                                             00063899
                                                                        00063999
                  EXEC CICS                                             00064099
                    RETURN                                              00064199
                  END-EXEC.                                             00064299
                                                                        00064399
      *-------------------------------------------------------*         00064499
       2100-999-FIM.                              EXIT.                 00064599
      *-------------------------------------------------------*         00064699
                                                                        00064799
      *********************************************************         00064899
      *             TECLA F6 SELECIONAR CLIENTE               *         00064999
      *********************************************************         00065099
                                                                        00065199
                                                                        00065299
      *-------------------------------------------------------*         00065399
       2200-ROTINA-SELECAO                        SECTION.              00066099
      *-------------------------------------------------------*         00067099
                                                                        00068099
                MOVE IDI                           TO WRK-CHAVE         00068199
                                                                        00068399
                  EXEC CICS LINK                                        00068499
                    PROGRAM('F03COVSA')                                 00068599
                    COMMAREA(WRK-DADOS)                                 00068699
                    RESP(WRK-RET)                                       00068799
                  END-EXEC.                                             00068899
                                                                        00068999
                EVALUATE WRK-STATUS                                     00069199
                   WHEN '1'                                             00070099
                     MOVE  WRK-CHAVE                TO IDO              00080099
                     MOVE  WRK-NOME                 TO NOMEO            00081099
                     MOVE  WRK-SETOR                TO SETORO           00082099
                     MOVE  WRK-SALARIO              TO SALO             00083099
                     MOVE  WRK-DATAADM              TO DATADMO          00084099
                     MOVE  WRK-EMAIL                TO EMAILO           00085099
                   WHEN '2'                                             00090099
                     MOVE  '-NAO ENCONTRADO-'       TO MSGO             00100099
                   WHEN '3'                                             00110099
                     MOVE  '-SALARIO NAO NUMERICO-' TO WRK-STATUS       00120099
                   WHEN '4'                                             00121099
                     MOVE  '-SALARIO NEGATIVO-'     TO WRK-STATUS       00122099
                   WHEN '5'                                             00123099
                     MOVE  '-EMAIL NAO ENCONTRADO-' TO MSGO             00124099
                END-EVALUATE.                                           00130099
                                                                        00131099
      *-------------------------------------------------------*         00132099
       2200-999-FIM.                              EXIT.                 00133099
      *-------------------------------------------------------*         00133199
      *********************************************************         00133299
      *             TECLA ENTER ATUALIZAR                     *         00133399
      *********************************************************         00133499
                                                                        00133599
                                                                        00133699
      *-------------------------------------------------------*         00133799
       2300-ATUALIZAR                             SECTION.              00133899
      *-------------------------------------------------------*         00133999
                                                                        00134099
                  MOVE SPACES          TO NOMEO SETORO EMAILO           00134199
                  MOVE ZEROS           TO IDO SALO                      00134599
                  MOVE '-PROXIMA CONSULTA-' TO MSGO.                    00134699
                                                                        00134799
      *-------------------------------------------------------*         00134899
       2300-999-FIM.                              EXIT.                 00134999
      *-------------------------------------------------------*         00135099
                                                                        00135199
                                                                        00135299
      *********************************************************         00135399
      *             FINALIZAR PROGRAMA                        *         00135499
      *********************************************************         00135599
                                                                        00135699
                                                                        00135799
      *-------------------------------------------------------*         00135899
       3000-FINALIZAR-CICS                        SECTION.              00135999
      *-------------------------------------------------------*         00136099
                                                                        00136199
               IF WRK-FLAG EQUAL 1                                      00136299
                  EXEC CICS SEND                                        00136399
                    MAPSET('F03CIM1')                                   00136499
                    MAP('MAPTEST')                                      00136599
                    ERASE                                               00136699
                    MAPONLY                                             00136799
                  END-EXEC                                              00136899
                ELSE                                                    00136999
                                                                        00137099
                  EXEC CICS SEND                                        00137199
                    MAPSET('F03CIM1')                                   00138099
                    MAP('MAPTEST')                                      00140099
                    DATAONLY                                            00141099
                  END-EXEC                                              00142099
               END-IF.                                                  00143099
                                                                        00144099
      *-------------------------------------------------------*         00150099
       3000-999-FIM.                              EXIT.                 00160099
      *-------------------------------------------------------*         00161099
                                                                        00162099
