      *=======================================================*         00010000
       IDENTIFICATION                            DIVISION.              00011000
      *=======================================================*         00012000
                                                                        00013000
       PROGRAM-ID. F03COVSA.                                            00014005
                                                                        00015000
      *=======================================================*         00016000
      *             T  R  E  I  N  A  M  E  N  T  O                     00017000
      *=======================================================*         00018000
      *     PROGRAMA......: F03COVSA                                    00019002
      *     TIPO..........: SERVICO DE ACESSO A DADOS                   00020000
      *-------------------------------------------------------*         00021000
      *    PROGRAMADOR(A): AUGUSTO MARTINS  - TREINAMENTO               00021100
      *    ANALISTA......: IVAN PETRUCCI    - TREINAMENTO               00021200
      *    DATA..........: 30/06/2022                                   00021300
      *-------------------------------------------------------*         00021400
      *-------------------------------------------------------*         00021500
      *    OBJETIVO..: CRIAR UM PROGRAMA QUE SERÁ CHAMADO POR *         00021600
      *                OUTRP PROGRAMA                         *         00021700
      *-------------------------------------------------------*         00021800
      *=======================================================*         00021900
       DATA                                       DIVISION.             00022000
      *=======================================================*         00022100
                                                                        00022200
      *-------------------------------------------------------*         00022300
       WORKING-STORAGE                            SECTION.              00022400
      *-------------------------------------------------------*         00022500
                                                                        00022600
                                                                        00022700
      *-------------------------------------------------------*         00022800
       01 FILLER                          PIC X(050)   VALUE            00022900
                 '*******AREA DA  BOOK   ******'.                       00023000
      *-------------------------------------------------------*         00023100
                                                                        00023200
            COPY DFHAID.                                                00023302
                                                                        00023400
      *-------------------------------------------------------*         00025100
       01 FILLER                          PIC X(050)   VALUE            00025200
                '*******AREA DE AUXILIARES********'.                    00025300
      *-------------------------------------------------------*         00025400
                                                                        00025501
       01 WRK-DADOS.                                                    00025601
           05 WRK-CHAVE    PIC X(05).                                   00025701
           05 WRK-NOME     PIC X(30).                                   00025801
           05 WRK-SETOR    PIC X(04).                                   00025901
           05 WRK-SALARIO  PIC X(10).                                   00026001
           05 WRK-DATAADM  PIC X(10).                                   00026101
           05 WRK-EMAIL    PIC X(40).                                   00027001
                                                                        00028001
       77 WRK-RESP         PIC S9(04) COMP.                             00028101
                                                                        00028200
      *=======================================================*         00028301
       LINKAGE                               SECTION.                   00028401
      *=======================================================*         00028501
                                                                        00028601
       01 DFHCOMMAREA.                                                  00028703
          05 LNK-CHAVE    PIC X(05).                                    00028801
          05 LNK-NOME     PIC X(30).                                    00028901
          05 LNK-SETOR    PIC X(04).                                    00029001
          05 LNK-SALARIO  PIC X(10).                                    00029101
          05 LNK-DATAADM  PIC X(10).                                    00029201
          05 LNK-EMAIL    PIC X(40).                                    00029301
          05 LNK-STATUS   PIC X(01).                                    00029401
                                                                        00029501
      *=======================================================*         00029601
       PROCEDURE                                  DIVISION.             00029700
      *=======================================================*         00029800
                                                                        00029900
                                                                        00030000
      *-------------------------------------------------------*         00030100
                                                                        00030200
      *         R O T I N A  P R I N C I P A L                *         00030300
                                                                        00030400
      *-------------------------------------------------------*         00030500
                                                                        00030600
      *-------------------------------------------------------*         00030700
       0000-PRINCIPAL                              SECTION.             00030800
      *-------------------------------------------------------*         00030900
      *       IF EIBCALEN GREATER 0                                     00031002
                                                                        00031102
               MOVE LNK-CHAVE   TO WRK-CHAVE.                           00031202
                                                                        00031302
                EXEC CICS READ                                          00031402
                   FILE('FUNC')                                         00031502
                   RIDFLD(WRK-CHAVE)                                    00031602
                   INTO(WRK-DADOS)                                      00031702
                   RESP(WRK-RESP)                                       00031802
                END-EXEC.                                               00031902
                                                                        00032002
                IF WRK-RESP EQUAL DFHRESP(NORMAL)                       00032104
                   MOVE WRK-CHAVE           TO LNK-CHAVE                00032202
                   MOVE WRK-NOME            TO LNK-NOME                 00032302
                   MOVE WRK-SETOR           TO LNK-SETOR                00032402
                   MOVE WRK-SALARIO         TO LNK-SALARIO              00032502
                   MOVE WRK-DATAADM         TO LNK-DATAADM              00032602
                   MOVE WRK-EMAIL           TO LNK-EMAIL                00032702
                   MOVE '1'                 TO LNK-STATUS               00032802
                END-IF.                                                 00032902
                                                                        00033002
                IF WRK-RESP EQUAL DFHRESP(NOTFND)                       00033102
                   MOVE '2'                 TO LNK-STATUS               00033202
                END-IF.                                                 00033302
                                                                        00033402
      *           PERFORM 1000-INICIAR-CICS                             00033502
                                                                        00033602
      *           PERFORM 2000-PROCESSAR                                00033702
                                                                        00033802
      *           PERFORM 3000-FINALIZAR-CICS                           00033902
                                                                        00034002
                  EXEC CICS                                             00034102
                    RETURN                                              00034202
                  END-EXEC.                                             00034302
                                                                        00034400
      *-------------------------------------------------------*         00035000
       0000-999-FIM.                               EXIT.                00036000
      *-------------------------------------------------------*         00037000
                                                                        00038002
