      *=======================================================*         00010002
       IDENTIFICATION                            DIVISION.              00011002
      *=======================================================*         00012002
                                                                        00013002
       PROGRAM-ID. F03CIP3.                                             00014002
                                                                        00015002
      *=======================================================*         00016002
      *             T  R  E  I  N  A  M  E  N  T  O                     00017002
      *=======================================================*         00018002
      *     PROGRAMA......: F03CIP3                                     00019003
      *     TIPO..........: SERVICO DE ACESSO A DADOS                   00020002
      *-------------------------------------------------------*         00021002
      *    PROGRAMADOR(A): AUGUSTO MARTINS  - TREINAMENTO               00021102
      *    ANALISTA......: IVAN PETRUCCI    - TREINAMENTO               00021202
      *    DATA..........: 29/06/2022                                   00021326
      *-------------------------------------------------------*         00021402
      *-------------------------------------------------------*         00021502
      *    OBJETIVO..: PROGRAMA CRIADO SOMENTE PARA DEVOLVER  *         00021626
      *                UMA CONSULTA.                          *         00021726
      *-------------------------------------------------------*         00022002
      *=======================================================*         00022102
       DATA                                       DIVISION.             00022202
      *=======================================================*         00022302
                                                                        00022402
      *-------------------------------------------------------*         00022502
       WORKING-STORAGE                            SECTION.              00022602
      *-------------------------------------------------------*         00022702
                                                                        00022802
                                                                        00022902
      *-------------------------------------------------------*         00023002
       01 FILLER                          PIC X(050)   VALUE            00023102
                 '*******AREA DA  BOOK   ******'.                       00023202
      *-------------------------------------------------------*         00023302
                                                                        00023402
                                                                        00023529
            COPY DFHAID.                                                00023602
                                                                        00023702
      *-------------------------------------------------------*         00023802
      *01 FILLER                          PIC X(050)   VALUE            00023930
      *          '*******AREA DB2  ********'.                           00024030
      *-------------------------------------------------------*         00024102
                                                                        00024202
                                                                        00024302
                                                                        00025102
      *-------------------------------------------------------*         00025202
       01 FILLER                          PIC X(050)   VALUE            00025302
                '*******AREA DE AUXILIARES********'.                    00025402
      *-------------------------------------------------------*         00025502
                                                                        00025626
       01 WRK-RET         PIC S9(04) COMP.                              00027029
       01 WRK-ENTRADA.                                                  00027126
          05 WRK-TRANS    PIC X(04).                                    00027726
          05 WRK-CHAVE    PIC X(05).                                    00027826
          05 WRK-NOME     PIC X(30).                                    00027926
          05 WRK-SETOR    PIC X(04).                                    00028026
          05 WRK-SALARIO  PIC X(10).                                    00028146
          05 WRK-DATAADM  PIC X(10).                                    00028226
          05 WRK-EMAIL    PIC X(40).                                    00028326
          05 WRK-STATUS   PIC X(01).                                    00028462
                                                                        00028525
       01 WRK-DADOS.                                                    00028626
          05 WRK-CHAVE    PIC X(05).                                    00028726
          05 WRK-NOME     PIC X(30).                                    00028826
          05 WRK-SETOR    PIC X(04).                                    00028926
          05 WRK-SALARIO  PIC X(10).                                    00029026
          05 WRK-DATAADM  PIC X(10).                                    00029126
          05 WRK-EMAIL    PIC X(40).                                    00029233
                                                                        00029333
      *=======================================================*         00029433
       PROCEDURE                                  DIVISION.             00029533
      *=======================================================*         00029633
                                                                        00029733
                                                                        00029833
      *-------------------------------------------------------*         00029933
                                                                        00030033
      *         R O T I N A  P R I N C I P A L                *         00030137
                                                                        00030233
      *-------------------------------------------------------*         00030333
                                                                        00030433
      *-------------------------------------------------------*         00031002
       0000-PRINCIPAL                              SECTION.             00040002
      *-------------------------------------------------------*         00050002
                                                                        00051002
                  PERFORM 1000-INICIAR-CICS                             00051102
                                                                        00051322
                  PERFORM 2000-PROCESSAR                                00051422
                                                                        00051522
                  PERFORM 3000-FINALIZAR-CICS                           00051843
                                                                        00051937
                  EXEC CICS                                             00053119
                    RETURN                                              00053226
                  END-EXEC.                                             00053319
                                                                        00053419
      *-------------------------------------------------------*         00053502
       0000-999-FIM.                               EXIT.                00053602
      *-------------------------------------------------------*         00053702
                                                                        00053802
                                                                        00053902
      *-------------------------------------------------------*         00054002
       1000-INICIAR-CICS                          SECTION.              00054102
      *-------------------------------------------------------*         00054202
                                                                        00054426
               INITIALIZE WRK-ENTRADA                                   00054542
                                                                        00054642
                  EXEC CICS RECEIVE                                     00054726
                    INTO(WRK-ENTRADA)                                   00054826
                  END-EXEC.                                             00054926
                                                                        00055122
      *-------------------------------------------------------*         00056502
       1000-999-FIM.                              EXIT.                 00056602
      *-------------------------------------------------------*         00056702
                                                                        00056802
                                                                        00056902
      *-------------------------------------------------------*         00057002
       2000-PROCESSAR                             SECTION.              00057102
      *-------------------------------------------------------*         00057202
                                                                        00057322
                  EXEC CICS READ                                        00057426
                    FILE('FUNC')                                        00057526
                    RIDFLD(WRK-CHAVE OF WRK-ENTRADA)                    00057626
                    INTO(WRK-DADOS)                                     00057726
                    RESP(WRK-RET)                                       00057826
                  END-EXEC.                                             00058026
                                                                        00059026
               IF WRK-RET NOT EQUAL DFHRESP(NOTFND)                     00059152
                     MOVE  CORR WRK-DADOS         TO WRK-ENTRADA        00059257
                     MOVE  '1'                    TO WRK-STATUS         00059361
                     PERFORM 2100-CONSISTENCIA                          00059457
                ELSE                                                    00060657
                     MOVE  '2'                    TO WRK-STATUS         00060761
              END-IF.                                                   00060856
                                                                        00060956
                  EXEC CICS SEND                                        00061056
                   FROM(WRK-STATUS)                                     00061156
                  END-EXEC.                                             00061256
                                                                        00061356
      *-------------------------------------------------------*         00061456
       2000-999-FIM.                              EXIT.                 00062002
      *-------------------------------------------------------*         00070002
                                                                        00131302
      *********************************************************         00131457
      *             CONSISTENCIA DE DADOS                     *         00131557
      *********************************************************         00131657
                                                                        00131757
                                                                        00131857
      *-------------------------------------------------------*         00131957
       2100-CONSISTENCIA                          SECTION.              00132057
      *-------------------------------------------------------*         00132157
                                                                        00132257
                EVALUATE TRUE                                           00132457
                   WHEN WRK-SALARIO OF WRK-ENTRADA NOT NUMERIC          00132557
                     MOVE  '3'                     TO WRK-STATUS        00132661
                   WHEN WRK-SALARIO OF WRK-ENTRADA EQUAL ZEROS          00132757
                     MOVE  '4'                     TO WRK-STATUS        00132861
                   WHEN WRK-EMAIL   OF WRK-ENTRADA EQUAL SPACES         00132957
                     MOVE  '5'                     TO WRK-STATUS        00133061
                END-EVALUATE.                                           00133158
                                                                        00133557
      *-------------------------------------------------------*         00133757
       2100-999-FIM.                              EXIT.                 00133857
      *-------------------------------------------------------*         00133957
                                                                        00134026
      *********************************************************         00134102
      *             FINALIZAR PROGRAMA                        *         00134226
      *********************************************************         00135002
                                                                        00160002
                                                                        00160126
      *-------------------------------------------------------*         00160202
       3000-FINALIZAR-CICS                        SECTION.              00160302
      *-------------------------------------------------------*         00160402
                                                                        00161027
                  EXEC CICS SEND                                        00161143
                    FROM(WRK-ENTRADA)                                   00161243
                    ERASE                                               00161343
                  END-EXEC.                                             00161443
                                                                        00161543
      *-------------------------------------------------------*         00162802
       3000-999-FIM.                              EXIT.                 00162902
      *-------------------------------------------------------*         00163002
                                                                        00164002
