      *=======================================================*         00010001
       IDENTIFICATION                            DIVISION.              00011001
      *=======================================================*         00012001
                                                                        00013001
       PROGRAM-ID. F03CIP3.                                             00014001
                                                                        00015001
      *=======================================================*         00016001
      *             T  R  E  I  N  A  M  E  N  T  O                     00017001
      *=======================================================*         00018001
      *     PROGRAMA......: F03CIP3                                     00019001
      *     TIPO..........: SERVICO DE ACESSO A DADOS                   00020001
      *-------------------------------------------------------*         00021001
      *    PROGRAMADOR(A): AUGUSTO MARTINS  - TREINAMENTO               00021101
      *    ANALISTA......: IVAN PETRUCCI    - TREINAMENTO               00021201
      *    DATA..........: 28/06/2022                                   00021301
      *-------------------------------------------------------*         00021401
      *-------------------------------------------------------*         00021501
      *    OBJETIVO..: CRIAR FERRAMENTAS PARA MANIPULAR DADOS *         00021601
      *                DENTRO DO CICS.INSERIR,DELETAR,UPDATE  *         00021701
      *                SAIR, CONSULTAR E ATUALIZAR PAGINA.    *         00021801
      *                                                       *         00021901
      *-------------------------------------------------------*         00022001
      *=======================================================*         00022101
       DATA                                       DIVISION.             00022201
      *=======================================================*         00022301
                                                                        00022401
      *-------------------------------------------------------*         00022501
       WORKING-STORAGE                            SECTION.              00022601
      *-------------------------------------------------------*         00022701
                                                                        00022801
                                                                        00022901
      *-------------------------------------------------------*         00023001
       01 FILLER                          PIC X(050)   VALUE            00023101
                 '*******AREA DA  BOOK   ******'.                       00023201
      *-------------------------------------------------------*         00023301
                                                                        00023401
            COPY F03CIM1.                                               00023501
            COPY DFHAID.                                                00023601
                                                                        00023701
      *-------------------------------------------------------*         00023801
       01 FILLER                          PIC X(050)   VALUE            00023901
                 '*******AREA DB2  ********'.                           00024001
      *-------------------------------------------------------*         00024101
                                                                        00024201
                                                                        00024301
                                                                        00024401
      *-------------------------------------------------------*         00024501
       01 FILLER                          PIC X(050)   VALUE            00024601
                '*******AREA DE AUXILIARES********'.                    00024701
      *-------------------------------------------------------*         00024801
       77 WRK-SAIDA       PIC X(40)  VALUE SPACES.                      00024901
       77 WRK-FLAG        PIC S9(04).                                   00027401
       77 WRK-FLAG-CICS   PIC S9(04).                                   00027501
       01 WRK-RET-CICS    PIC S9(04) COMP.                              00027601
       01 WRK-DADOS.                                                    00027701
          05 WRK-CHAVE    PIC X(05).                                    00027801
          05 WRK-NOME     PIC X(30).                                    00027901
          05 WRK-SETOR    PIC X(04).                                    00028001
          05 WRK-SALARIO  PIC X(10).                                    00028101
          05 WRK-DATAADM  PIC X(10).                                    00028201
          05 WRK-EMAIL    PIC X(40).                                    00028301
      *=======================================================*         00028401
       PROCEDURE                                  DIVISION.             00028501
      *=======================================================*         00028601
                                                                        00028701
                                                                        00028801
      *-------------------------------------------------------*         00028901
                                                                        00029001
      *         R O T I N A  P R I N C I P A L *                        00029101
                                                                        00029201
      *-------------------------------------------------------*         00029301
                                                                        00029401
      *-------------------------------------------------------*         00029501
       0000-PRINCIPAL                              SECTION.             00029601
      *-------------------------------------------------------*         00029701
                                                                        00029801
                  PERFORM 1000-INICIAR-CICS                             00029901
                                                                        00030001
                  IF WRK-FLAG-CICS EQUAL 2                              00040001
                     PERFORM 2000-PROCESSAR                             00050001
                  END-IF                                                00051001
                                                                        00051101
                  PERFORM 3000-FINALIZAR-CICS                           00051201
                                                                        00051301
                  EXEC CICS                                             00051401
                    RETURN TRANSID('T033')                              00051501
                  END-EXEC.                                             00051601
                                                                        00051701
      *-------------------------------------------------------*         00051801
       0000-999-FIM.                               EXIT.                00051901
      *-------------------------------------------------------*         00052001
                                                                        00053001
                                                                        00053101
      *-------------------------------------------------------*         00053201
       1000-INICIAR-CICS                          SECTION.              00053301
      *-------------------------------------------------------*         00053401
                                                                        00053501
                EXEC CICS RECEIVE                                       00054301
                  MAPSET('F03CIM1')                                     00054401
                  MAP('MAPTEST')                                        00054501
                  INTO(MAPTESTI)                                        00054601
                  RESP(WRK-RET-CICS)                                    00054701
                END-EXEC.                                               00054801
                                                                        00054901
                IF WRK-RET-CICS = DFHRESP(MAPFAIL)                      00055001
                    MOVE 1 TO WRK-FLAG-CICS                             00055101
                 ELSE                                                   00055201
                    MOVE 2 TO WRK-FLAG-CICS                             00055301
                END-IF.                                                 00055401
                                                                        00055501
      *-------------------------------------------------------*         00055601
       1000-999-FIM.                              EXIT.                 00055701
      *-------------------------------------------------------*         00055801
                                                                        00055901
                                                                        00056001
      *-------------------------------------------------------*         00056101
       2000-PROCESSAR                             SECTION.              00056201
      *-------------------------------------------------------*         00056301
                                                                        00056401
                EVALUATE EIBAID                                         00056501
                  WHEN 6                                                00056601
                    PERFORM 2100-CONSULTAR                              00056701
                  WHEN 5                                                00056801
                    PERFORM 2200-INSERIR                                00056901
                  WHEN 8                                                00057001
                    PERFORM 2300-UPDATE                                 00057101
                  WHEN 9                                                00057201
                    PERFORM 2400-DELETAR                                00057301
                  WHEN 3                                                00057401
                    PERFORM 2500-SAIR                                   00057501
                  WHEN ''''                                             00057601
                    PERFORM 2600-ATUALIZAR                              00057701
                  WHEN OTHER                                            00057801
                    MOVE 'ERRO DE OPERACAO'  TO MSGO                    00057901
                END-EVALUATE.                                           00058001
                                                                        00058101
      *-------------------------------------------------------*         00058201
       2000-999-FIM.                              EXIT.                 00058301
      *-------------------------------------------------------*         00058401
                                                                        00058501
      *********************************************************         00058601
      *             BOTAO F6 - CONSULTAR                      *         00058701
      *********************************************************         00058801
                                                                        00058901
      *-------------------------------------------------------*         00059001
       2100-CONSULTAR                             SECTION.              00060001
      *-------------------------------------------------------*         00060101
                                                                        00060201
                                                                        00060301
               MOVE IDI                 TO WRK-CHAVE                    00060401
                                                                        00060501
               EXEC CICS READ                                           00060601
                    FILE('FUNC')                                        00060701
                    RIDFLD(WRK-CHAVE)                                   00060801
                    INTO(WRK-DADOS)                                     00060901
                    RESP(WRK-RET-CICS)                                  00061001
               END-EXEC                                                 00061101
              IF WRK-RET-CICS EQUAL DFHRESP(NORMAL)                     00061201
                                                                        00061301
                   MOVE WRK-CHAVE       TO IDO                          00061401
                   MOVE WRK-NOME        TO NOMEO                        00061501
                   MOVE WRK-SETOR       TO SETORO                       00061601
                   MOVE WRK-SALARIO     TO SALO                         00061701
                   MOVE WRK-DATAADM     TO DATADMO                      00061801
                   MOVE WRK-EMAIL       TO EMAILO                       00061901
                   MOVE '--ENCONTRADO--' TO MSGO                        00062001
               END-IF                                                   00062101
                                                                        00062201
               IF WRK-RET-CICS EQUAL DFHRESP(NOTFND)                    00062301
                   MOVE '--NAO ENCONTRADO--' TO MSGO                    00062401
               END-IF.                                                  00062501
                                                                        00062601
                                                                        00062701
      *-------------------------------------------------------*         00062801
       2100-999-FIM.                              EXIT.                 00062901
      *-------------------------------------------------------*         00063001
                                                                        00064001
      *********************************************************         00065001
      *             BOTAO F5 - INSERIR                        *         00066001
      *********************************************************         00067001
                                                                        00068001
      *-------------------------------------------------------*         00069001
       2200-INSERIR                               SECTION.              00070001
      *-------------------------------------------------------*         00080001
                                                                        00090001
                                                                        00100001
      *-------------------------------------------------------*         00110001
       2200-999-FIM.                              EXIT.                 00120001
      *-------------------------------------------------------*         00130001
                                                                        00131001
      *********************************************************         00132001
      *             BOTAO F8 - UPDATE                         *         00133001
      *********************************************************         00134001
                                                                        00135001
      *-------------------------------------------------------*         00136001
       2300-UPDATE                                SECTION.              00137001
      *-------------------------------------------------------*         00137101
                                                                        00137201
                                                                        00137301
      *-------------------------------------------------------*         00137401
       2300-999-FIM.                              EXIT.                 00137501
      *-------------------------------------------------------*         00137601
                                                                        00137701
      *********************************************************         00137801
      *             BOTAO F9 - DELETAR                        *         00137901
      *********************************************************         00138001
                                                                        00139001
      *-------------------------------------------------------*         00140001
       2400-DELETAR                               SECTION.              00141001
      *-------------------------------------------------------*         00142001
                                                                        00143001
                                                                        00144001
                                                                        00145001
                                                                        00146001
      *-------------------------------------------------------*         00147001
       2400-999-FIM.                              EXIT.                 00148001
      *-------------------------------------------------------*         00149001
                                                                        00150001
      *********************************************************         00151001
      *             BOTAO F3 - SAIR                           *         00152001
      *********************************************************         00153001
                                                                        00153101
      *-------------------------------------------------------*         00153201
       2500-SAIR                                  SECTION.              00153301
      *-------------------------------------------------------*         00153401
                                                                        00153501
               MOVE '--OBRIGADO--'          TO WRK-SAIDA                00153601
                                                                        00153701
               EXEC CICS SEND TEXT                                      00153801
                 FROM(WRK-SAIDA)                                        00153901
                 ERASE                                                  00154001
               END-EXEC                                                 00154101
                                                                        00154201
               EXEC CICS                                                00154301
                 RETURN                                                 00154401
               END-EXEC.                                                00154501
                                                                        00154601
      *-------------------------------------------------------*         00154701
       2500-999-FIM.                              EXIT.                 00154801
      *-------------------------------------------------------*         00154901
                                                                        00155001
      *********************************************************         00155101
      *             BOTAO ENTER - ATUALIZAR                 *           00155201
      *********************************************************         00155301
                                                                        00155401
      *-------------------------------------------------------*         00155501
       2600-ATUALIZAR                             SECTION.              00155601
      *-------------------------------------------------------*         00155701
                                                                        00155801
                                                                        00155901
                                                                        00156001
               MOVE SPACES                                              00157001
                    TO NOMEO SETORO EMAILO DATADMO                      00158001
               MOVE ZEROS              TO SALO IDO                      00158101
               MOVE 'YYYY-MM-DD'       TO FORMO                         00158201
               MOVE 'PROXIMA OPERACAO' TO MSGO.                         00158301
                                                                        00158401
      *-------------------------------------------------------*         00158501
       2600-999-FIM.                              EXIT.                 00158601
      *-------------------------------------------------------*         00158701
                                                                        00158801
                                                                        00158901
      *-------------------------------------------------------*         00159001
       3000-FINALIZAR-CICS                        SECTION.              00160001
      *-------------------------------------------------------*         00160101
             IF WRK-FLAG-CICS EQUAL 1                                   00160201
                EXEC CICS SEND                                          00160301
                     MAPSET('F03CIM1')                                  00160401
                     MAP('MAPTEST')                                     00160501
                     ERASE                                              00160601
                     MAPONLY                                            00160701
                END-EXEC                                                00160801
            ELSE                                                        00160901
                EXEC CICS SEND                                          00161001
                  MAPSET('F03CIM1')                                     00161101
                  MAP('MAPTEST')                                        00161201
                  DATAONLY                                              00161301
                  FROM(MAPTESTO)                                        00161401
                END-EXEC                                                00161501
                                                                        00161601
            END-IF.                                                     00161701
      *-------------------------------------------------------*         00161801
       3000-999-FIM.                              EXIT.                 00161901
      *-------------------------------------------------------*         00162001
                                                                        00163001
