      *=======================================================*         00011010
       IDENTIFICATION                            DIVISION.              00012010
      *=======================================================*         00013010
                                                                        00014010
       PROGRAM-ID. FIVCIP1.                                             00020010
                                                                        00021010
      *=======================================================*         00021110
      *             T  R  E  I  N  A  M  E  N  T  O                     00021210
      *=======================================================*         00021310
      *      PROGRAMA......: FR03DB10                                   00021410
      *     TIPO..........: SERVICO DE ACESSO A DADOS                   00021510
      *-------------------------------------------------------*         00021610
      *      PROGRAMADOR(A): AUGUSTO MARTINS  - TREINAMENTO             00021710
      *      ANALISTA......: IVAN PETRUCCI    - TREINAMENTO             00021810
      *      DATA..........: 08/06/2022                                 00021910
      *-------------------------------------------------------*         00022010
      *=======================================================*         00023010
       DATA                                       DIVISION.             00024010
      *=======================================================*         00025010
                                                                        00026010
      *-------------------------------------------------------*         00027010
       WORKING-STORAGE                            SECTION.              00028010
      *-------------------------------------------------------*         00029010
            COPY F03CIM1.                                               00050012
       77 WRK-SAIDA      PIC X(30) VALUE SPACES.                        00051010
       77 WRK-IDS        PIC 9(05) VALUE ZEROS.                         00051141
                                                                        00051241
      *=======================================================*         00051341
       PROCEDURE                                  DIVISION.             00051441
      *=======================================================*         00051541
                                                                        00051641
                                                                        00051741
      *-------------------------------------------------------*         00051841
                                                                        00051941
      *         R O T I N A  P R I N C I P A L *                        00052041
                                                                        00052141
      *-------------------------------------------------------*         00052210
                                                                        00052315
      *-------------------------------------------------------*         00052415
       0000-PRINCIPAL                              SECTION.             00052515
      *-------------------------------------------------------*         00052615
                                                                        00052715
                  PERFORM 1000-INICIAR-CICS                             00052815
                  PERFORM 2000-PROCESSAR                                00052915
                  PERFORM 3000-FINALIZAR-CICS.                          00053015
                                                                        00053115
      *-------------------------------------------------------*         00053215
       0000-999-FIM.                               EXIT.                00053315
      *-------------------------------------------------------*         00053415
                                                                        00053515
                                                                        00053615
      *-------------------------------------------------------*         00053715
       1000-INICIAR-CICS                          SECTION.              00053815
      *-------------------------------------------------------*         00053915
                                                                        00054010
            EXEC CICS SEND                                              00070012
              MAPSET('F03CIM1')                                         00080013
              MAP('MAPTEST')                                            00090013
              ERASE                                                     00091013
              MAPONLY                                                   00100013
            END-EXEC.                                                   00120012
                                                                        00121010
            EXEC CICS RECEIVE                                           00121112
              MAPSET('F03CIM1')                                         00121213
              MAP('MAPTEST')                                            00122013
              INTO(MAPTESTI)                                            00123013
            END-EXEC.                                                   00124012
                                                                        00124115
      *-------------------------------------------------------*         00124215
       1000-999-FIM.                              EXIT.                 00124315
      *-------------------------------------------------------*         00124415
                                                                        00124513
                                                                        00124615
      *-------------------------------------------------------*         00124715
       2000-PROCESSAR                             SECTION.              00124815
      *-------------------------------------------------------*         00124915
                                                                        00125022
            IF EIBAID = '3'                                             00125122
               EXEC CICS                                                00125822
                 RETURN                                                 00125922
               END-EXEC                                                 00126022
            END-IF.                                                     00126122
                                                                        00126228
                 IF IDI EQUAL '00004'                                   00126341
                    MOVE 'BRUNO   '           TO NOMEO                  00126544
                    MOVE 'DPTI'               TO SETORO                 00126644
                    MOVE '8.000,00'           TO SALO                   00126847
                    MOVE 'BRUNO@GMAIL.COM'    TO EMAILO                 00126944
                    MOVE '06'                 TO DATADO                 00127049
                    MOVE '20'                 TO DATADMO                00127149
                    MOVE 'PROGRAMADOR'        TO MSGO                   00127248
                END-IF.                                                 00127348
                                                                        00127448
                IF IDI EQUAL '00002'                                    00127548
                    MOVE 'ANDRE    '          TO NOMEO                  00127648
                    MOVE 'DPTI'               TO SETORO                 00127748
                    MOVE '80000'              TO SALO                   00127848
                    MOVE 'ANDRE@GMAIL.COM'    TO EMAILO                 00127948
                    MOVE '06'                 TO DATADO                 00128049
                    MOVE '20'                 TO DATADMO                00128149
                    MOVE 'ANALISTA '          TO MSGO                   00128228
                END-IF.                                                 00128329
                                                                        00128429
                IF IDI EQUAL '00003'                                    00128529
                    MOVE 'AUGUSTO '           TO NOMEO                  00128628
                    MOVE 'DPTI'               TO SETORO                 00128728
                    MOVE '80000'              TO SALO                   00128845
                    MOVE 'AUGUSTO@GMAIL.COM'  TO EMAILO                 00128944
                    MOVE '06'                 TO DATADO                 00129049
                    MOVE '20'                 TO DATADMO                00129149
                    MOVE 'PROGRAMADOR'        TO MSGO                   00129228
                END-IF.                                                 00129334
                                                                        00129428
                IF IDI NOT EQUAL '00002' AND '00003' AND                00129543
                                 '00004'                                00129643
                    MOVE 'ID NÃO ENCONTRADO' TO MSGO                    00129743
                END-IF.                                                 00129843
                                                                        00129910
                                                                        00130025
                                                                        00130125
            EXEC CICS SEND                                              00130212
              MAPSET('F03CIM1')                                         00130313
              MAP('MAPTEST')                                            00130413
              DATAONLY                                                  00130513
            END-EXEC.                                                   00130612
                                                                        00130715
      *-------------------------------------------------------*         00130815
       2000-999-FIM.                              EXIT.                 00130915
      *-------------------------------------------------------*         00131015
                                                                        00131115
                                                                        00136029
      *-------------------------------------------------------*         00170015
       3000-FINALIZAR-CICS                        SECTION.              00171015
      *-------------------------------------------------------*         00172015
                                                                        00173015
            EXEC CICS                                                   00173115
              RETURN TRANSID('T031')                                    00173222
            END-EXEC.                                                   00173315
                                                                        00175015
             MOVE 'FINALIZAR ' TO WRK-SAIDA.                            00175115
                                                                        00175215
      *-------------------------------------------------------*         00176015
       3000-999-FIM.                              EXIT.                 00177015
      *-------------------------------------------------------*         00178015
                                                                        00180010
