      *===========================================================*     00001017
       IDENTIFICATION                             DIVISION.             00002000
      *===========================================================*     00003017
       PROGRAM-ID.  FR03CB09.                                           00004001
      *===========================================================*     00005017
      *     AUTOR    : AUGUSTO MARTINS                                  00006000
      *     EMPRESA  : FOURSYS                                          00007000
      *     DATA     : 20/04/2022                                       00008000
      *     OBJETIVO : OPERADOR ARITMETICO, ADICAO --ADD--              00009000
      *              : SOMAR E DEVOLVER O VALOR PARA WRK-RES,           00010000
      *              : ANTES PRECISA INICIAR A VARIAVEL COM 1.          00011000
      *===========================================================*     00020018
       ENVIRONMENT                                DIVISION              00030018
      *===========================================================*     00040018
       DATA                                       DIVISION.             00050000
      *===========================================================*     00060017
                                                                        00061017
      *-----------------------------------------------------------*     00062017
       WORKING-STORAGE                            SECTION.              00070000
      *-----------------------------------------------------------*     00070117
       01 WRK-OPERADOR-AD.                                              00070200
          05 WRK-N1              PIC 99  VALUE ZEROS.                   00070309
          05 WRK-N2              PIC 99  VALUE ZEROS.                   00070409
       01 WRK-RES                PIC 999 VALUE 1.                       00070615
      *-----------------------------------------------------------*     00070717
                                                                        00070817
      *===========================================================*     00070917
       PROCEDURE                                  DIVISION.             00071005
      *===========================================================*     00071117
                                                                        00071216
           ACCEPT WRK-OPERADOR-AD    FROM SYSIN.                        00071305
      * ---------------------  TO  -------------------------------*     00072017
           ADD WRK-N1 WRK-N2     TO WRK-RES.                            00073012
                                                                        00074016
           DISPLAY '===================================='               00075000
           DISPLAY 'A SOMA DE NUM1:'  WRK-N1                            00076000
                        ',COM NUM2:'  WRK-N2                            00077000
           DISPLAY 'TOTAL:         '  WRK-RES                           00078012
           DISPLAY '==================================== '              00079000
           STOP RUN.                                                    00080000
