      *===========================================================*     00001000
       IDENTIFICATION                             DIVISION.             00002000
      *===========================================================*     00003000
                                                                        00003100
       PROGRAM-ID.  FR03CB21.                                           00003200
                                                                        00003300
      *===========================================================*     00003400
      *              TREINAMENTO MAINFRAME                              00003500
      *===========================================================*     00003600
                                                                        00003700
      *===========================================================*     00003800
      *                                                                 00003900
      *   PROGRAMADOR: AUGUSTO MARTINS                                  00004000
      *   EMPRESA    : FOURSYS                                          00005000
      *   DATA       : 25/04/2022                                       00006000
      *   OBJETIVO   : CRIAR UM PROGRAMA PARA CADASTRO DE PRODUTOS,     00007000
      *              : COM NO MINIMO 25 REGISTROS.                      00008000
      *                                                                 00009000
      *===========================================================*     00010000
                                                                        00011000
                                                                        00012000
      *===========================================================*     00012100
       ENVIRONMENT                                DIVISION.             00012200
      *===========================================================*     00012300
                                                                        00012400
      *-----------------------------------------------------------*     00012500
       CONFIGURATION                              SECTION.              00012600
      *-----------------------------------------------------------*     00012700
                                                                        00012800
       SPECIAL-NAMES.                                                   00012900
           DECIMAL-POINT IS COMMA.                                      00013000
                                                                        00013100
      *===========================================================*     00013200
       DATA                                       DIVISION.             00013300
      *===========================================================*     00013400
                                                                        00013500
                                                                        00013600
      *-----------------------------------------------------------*     00013700
       WORKING-STORAGE                            SECTION.              00013800
      *-----------------------------------------------------------*     00013900
                                                                        00014000
                                                                        00015000
      *-----------------------------------------------------------*     00015100
      *---------    INICIO  DA WORKING - SECTION         ---------*     00015200
      *-----------------------------------------------------------*     00015300
                                                                        00015400
                                                                        00015500
      *-----------------------------------------------------------*     00015600
                                                                        00015700
       01 WRK-CADASTRO.                                                 00015800
           05 WRK-CODIGO               PIC 9(02) VALUE ZEROS.           00015900
           05 WRK-PRODUTO              PIC X(15) VALUE SPACES.          00016003
                                                                        00016400
       01 WRK-MSG                      PIC A(20) VALUE SPACES.          00016500
       01 WRK-ACUM                     PIC 9(02) VALUE ZEROS.           00016605
      *-----------------------------------------------------------*     00016700
                                                                        00016800
                                                                        00016900
      *===========================================================*     00017000
       PROCEDURE                                  DIVISION.             00017100
      *===========================================================*     00017200
                                                                        00017300
      *************************************************************     00017400
      *                    ROTINA PRINCIPAL                       *     00017500
      *************************************************************     00017600
                                                                        00017700
      *-----------------------------------------------------------*     00017800
       0000-PRINCIPAL                               SECTION.            00017900
      *-----------------------------------------------------------*     00018000
                                                                        00018100
            PERFORM 1000-INICIAR.                                       00018200
            PERFORM 2000-PROCESSAR UNTIL WRK-CODIGO EQUAL 25.           00018300
            PERFORM 3000-REGISTROS.                                     00018404
            PERFORM 9999-FIMARQ.                                        00018500
                                                                        00018600
      *-----------------------------------------------------------*     00018700
       0000-99-FIM.                                  EXIT.              00018800
      *-----------------------------------------------------------*     00018900
                                                                        00019000
      *************************************************************     00019100
      *                    PROCEDIMENTO INICIAL                   *     00019200
      *************************************************************     00019300
                                                                        00019400
      *-----------------------------------------------------------*     00019500
       1000-INICIAR                                  SECTION.           00019600
      *-----------------------------------------------------------*     00019700
                                                                        00019800
                                                                        00019908
             ACCEPT WRK-CADASTRO  FROM SYSIN.                           00020008
                                                                        00020108
                    IF WRK-CODIGO EQUAL ZEROS  OR                       00020216
                       WRK-CODIGO NOT NUMERIC                           00020319
                       PERFORM 9000-TRATAR-ERRO                         00020408
                                                                        00020513
                     ELSE                                               00020608
                       MOVE '-INICIAR CADASTROS-' TO WRK-MSG            00020708
                    END-IF.                                             00020811
                                                                        00020908
      * --------------------------------------------------------*       00021019
      *            EVALUATE TRUE                                *       00021119
      *               WHEN WRK-CODIGO EQUAL ZEROS               *       00021219
      *                 PERFORM 9000-TRATAR-ERRO                *       00021319
      *               WHEN WRK-CODIGO NOT NUMERIC               *       00021419
      *                 PERFORM 9000-TRATAR-ERRO                *       00021519
      *               WHEN OTHER                                *       00021619
      *                 MOVE '-INICIAR CADASTROS- ' TO WRK-MSG  *       00021719
      *             END-EVALUATE                                *       00021819
      *---------------------------------------------------------*       00021919
                                                                        00022006
                    DISPLAY '======================'                    00022108
                    DISPLAY         WRK-MSG                             00022208
                    DISPLAY '======================'.                   00022308
                                                                        00022408
      *-----------------------------------------------------------*     00022500
       1000-99-FIM.                                   EXIT.             00022600
      *-----------------------------------------------------------*     00022700
                                                                        00022800
                                                                        00022900
      *************************************************************     00023000
      *                    PROCESSAR                              *     00023100
      *************************************************************     00023200
                                                                        00023300
                                                                        00023400
      *-----------------------------------------------------------*     00023500
       2000-PROCESSAR                                SECTION.           00023600
      *-----------------------------------------------------------*     00024000
               ADD 1            TO WRK-ACUM                             00026504
                                                                        00026604
               DISPLAY 'CODIGO : ' WRK-CODIGO                           00026700
               DISPLAY 'PRODUTO: ' WRK-PRODUTO                          00026802
                                                                        00026904
               ACCEPT WRK-CADASTRO.                                     00027002
      *-----------------------------------------------------------*     00027100
       2000-99-FIM.                                  EXIT.              00027200
      *-----------------------------------------------------------*     00027300
                                                                        00027400
                                                                        00027504
      *-----------------------------------------------------------*     00027604
       3000-REGISTROS                                SECTION.           00027704
      *-----------------------------------------------------------*     00027804
                                                                        00027904
              DISPLAY '=========================================='      00028008
              DISPLAY '-TOTAL DE REGISTROS PROCESSADOS-' WRK-ACUM       00028108
              DISPLAY '=========================================='.     00028309
                                                                        00028408
      *-----------------------------------------------------------*     00028504
       3000-99-FIM.                                  EXIT.              00028604
      *-----------------------------------------------------------*     00028704
                                                                        00028800
      *-----------------------------------------------------------*     00029000
       9000-TRATAR-ERRO                             SECTION.            00030000
      *-----------------------------------------------------------*     00031000
                                                                        00031100
               DISPLAY 'ERRO NO PROCESSAMENTO DE ARQUIVOS'              00031200
               PERFORM 9999-FIMARQ.                                     00031300
                                                                        00031400
      *-----------------------------------------------------------*     00031500
       9000-99-FIM.                                  EXIT.              00031600
      *-----------------------------------------------------------*     00031700
                                                                        00031800
                                                                        00031900
      *-----------------------------------------------------------*     00032000
       9999-FIMARQ                                   SECTION.           00032100
      *-----------------------------------------------------------*     00032200
                                                                        00032300
              DISPLAY 'FIM DO PROCESSAMENTO'.                           00032400
              STOP RUN.                                                 00032500
                                                                        00032600
      *-----------------------------------------------------------*     00032700
       9999-99-FIM.                                   EXIT.             00032800
      *-----------------------------------------------------------*     00032900
