      *============================================================*    00001003
       IDENTIFICATION                            DIVISION.              00010000
      *============================================================*    00011003
                                                                        00012003
       PROGRAM-ID.  FR03CB05.                                           00020000
                                                                        00021003
      *============================================================*    00030003
      *     AUTOR    : AUGUSTO MARTINS                                  00040000
      *     EMPRESA  : FOURSYS                                          00050000
      *     DATA     : 19/04/2022                                       00060000
      *     OBJETIVO : RECEBER UM  VALOR DA SYSIN,                      00070002
      *              : EM UMA VARIAVEL COMPACTADA.                      00071002
      *============================================================*    00072003
                                                                        00072103
      *============================================================*    00072203
       ENVIRONMENT                                DIVISION.             00073003
      *============================================================*    00073103
                                                                        00073204
      *-----------------------------------------------------------*     00073304
       CONFIGURATION                              SECTION.              00073404
      *-----------------------------------------------------------*     00073504
                                                                        00073604
         SPECIAL-NAMES.                                                 00073704
             DECIMAL-POINT IS COMMA.                                    00073804
                                                                        00073904
                                                                        00074403
      *============================================================*    00074503
       DATA                                       DIVISION.             00074600
      *============================================================*    00074703
                                                                        00074803
      *------------------------------------------------------------*    00074903
       WORKING-STORAGE                            SECTION.              00075100
      *------------------------------------------------------------*    00075204
                                                                        00075304
       77 WRK-VALOR           PIC 9(05).                                00076001
       77 WRK-VALOR-COMP      PIC S9(05) COMP-3 VALUE ZEROS.            00080001
                                                                        00080103
      *------------------------------------------------------------*    00080203
                                                                        00080303
      *============================================================*    00080403
       PROCEDURE                                  DIVISION.             00081000
      *============================================================*    00081103
                                                                        00081204
                                                                        00081304
      *************************************************************     00081404
      *                    ROTINA PRINCIPAL                       *     00081504
      *************************************************************     00081604
                                                                        00081704
      *=========================================================*       00081804
       0000-PRINCIPAL                             SECTION.              00081904
      *=========================================================*       00082004
                                                                        00082104
               PERFORM 1000-INICIAR.                                    00082204
               PERFORM 2000-PROCESSAR.                                  00082304
               PERFORM 9999-FIMARQ.                                     00082404
                                                                        00082504
      *=========================================================*       00082604
       0000-99-FIM.                               EXIT.                 00082704
      *=========================================================*       00082804
                                                                        00082904
                                                                        00083004
      ***********************************************************       00083104
      *                    PROCEDIMENTO INICIAL                 *       00083204
      ***********************************************************       00083304
                                                                        00083404
                                                                        00083504
      *=========================================================*       00083604
       1000-INICIAR                               SECTION.              00083704
      *=========================================================*       00083804
                                                                        00084004
           ACCEPT WRK-VALOR   FROM SYSIN.                               00084104
                                                                        00084204
      *=========================================================*       00084304
       1000-99-FIM.                               EXIT.                 00084404
      *=========================================================*       00084504
                                                                        00084604
                                                                        00084704
                                                                        00084804
      ***********************************************************       00084904
      *                    PROCESSAR                            *       00085004
      ***********************************************************       00085104
                                                                        00085204
                                                                        00085304
      *=========================================================*       00085404
       2000-PROCESSAR                             SECTION.              00085505
      *=========================================================*       00085604
                                                                        00086004
           MOVE   WRK-VALOR   TO   WRK-VALOR-COMP.                      00086104
           ADD 1              TO  WRK-VALOR-COMP.                       00086204
           DISPLAY '---------------------'                              00086302
           DISPLAY 'RESULTADO COMPACTADO:' WRK-VALOR-COMP.              00086400
           DISPLAY '---------------------'.                             00086502
                                                                        00086704
      *=========================================================*       00086804
       2000-99-FIM.                               EXIT.                 00086904
      *=========================================================*       00087004
                                                                        00087104
                                                                        00087204
      *=========================================================*       00087304
       9999-FIMARQ                                SECTION.              00087404
      *=========================================================*       00087504
                                                                        00087604
           STOP RUN.                                                    00088000
                                                                        00090004
      *=========================================================*       00091004
       9999-99-FIM.                               EXIT.                 00092004
      *=========================================================*       00093004
                                                                        00100004
                                                                        00110004
