      *========================================================*        00001003
       IDENTIFICATION                            DIVISION.              00010000
      *========================================================*        00011003
                                                                        00012003
       PROGRAM-ID.  FR03CB02.                                           00020002
                                                                        00021003
      *========================================================*        00030003
      *     AUTOR    : AUGUSTO MARTINS                                  00040000
      *     EMPRESA  : FOURSYS                                          00050000
      *     DATA     : 18/04/2022                                       00060000
      *     OBJETIVO : TESTE DE COMPILACAO, VAMOS MOVER                 00070001
      *              : UM TEXTO PARA UMA VARIAVEL.                      00071002
      *=========================================================*       00080003
       ENVIRONMENT                                DIVISION.             00081003
      *=========================================================*       00081103
       DATA                                       DIVISION.             00082000
      *=========================================================*       00082103
                                                                        00082403
      *---------------------------------------------------------*       00082503
       WORKING-STORAGE                            SECTION.              00082600
      *---------------------------------------------------------*       00082703
                                                                        00082803
       77 WRK-NOME               PICTURE X(15).                         00082903
      *---------------------------------------------------------*       00083003
                                                                        00083103
      *=========================================================*       00083203
       PROCEDURE                                  DIVISION.             00083300
      *=========================================================*       00083403
       0000-PRINCIPAL                             SECTION.              00083504
      *=========================================================*       00083703
                                                                        00083803
      *=========================================================*       00083904
       0000-99-FIM.                               EXIT.                 00084004
      *=========================================================*       00084104
           MOVE 'AUGUSTO MARTINS' TO WRK-NOME.                          00084200
           DISPLAY 'MEU PRIMEIRO PROGRAMA - FR03CB02'.                  00084300
           DISPLAY 'FEITO POR --------------' WRK-NOME.                 00085000
           STOP RUN.                                                    00086000
