                                                                        00001000
      *=======================================================*         00002000
       IDENTIFICATION                            DIVISION.              00003000
      *=======================================================*         00004000
                                                                        00005000
       PROGRAM-ID.  FR03DB04.                                           00006000
                                                                        00007000
      *=======================================================*         00008000
      *              TREINAMENTO MAINFRAME                    *         00009000
      *=======================================================*         00010000
      *     AUTOR    : AUGUSTO MARTINS                                  00020000
      *     EMPRESA  : FOURSYS                                          00030000
      *     DATA     : 05/06/2022                                       00040009
      *     OBJETIVO : DELETAR CAMPOS DA TABELA                         00050009
      *              :                                                  00060009
      *=======================================================*         00070000
       ENVIRONMENT                                    DIVISION.         00080000
      *=======================================================*         00081000
                                                                        00081100
      *=======================================================*         00081200
       CONFIGURATION                                  SECTION.          00081300
      *=======================================================*         00081400
                                                                        00081500
          SPECIAL-NAMES.                                                00081600
              DECIMAL-POINT IS COMMA.                                   00081700
                                                                        00081800
      *=======================================================*         00081900
                                                                        00082000
      *=======================================================*         00082100
       DATA                                       DIVISION.             00082200
      *=======================================================*         00082300
                                                                        00082400
      *-------------------------------------------------------*         00082500
       WORKING-STORAGE                            SECTION.              00082600
      *-------------------------------------------------------*         00082700
                                                                        00082800
      *-------------------------------------------------------*         00082900
        01 FILLER                          PIC X(050)   VALUE           00083000
                '*******AREA DE SQL ******'.                            00083100
      *-------------------------------------------------------*         00083200
                                                                        00083300
           EXEC SQL                                                     00083400
                INCLUDE BOOKFUNC                                        00083500
           END-EXEC.                                                    00083600
           EXEC SQL                                                     00083700
                INCLUDE SQLCA                                           00083800
           END-EXEC.                                                    00083900
                                                                        00084000
      *-------------------------------------------------------*         00084100
        01 FILLER                          PIC X(050)   VALUE           00084200
                '*******AREA DE AUXILIARES********'.                    00084300
      *-------------------------------------------------------*         00084400
                                                                        00084500
      *-------------------------------------------------------*         00084600
                                                                        00084700
                                                                        00084800
      *-------------------------------------------------------*         00084900
        01 FILLER                          PIC X(050)   VALUE           00085000
                '*******AREA DE AUXILIARES********'.                    00086000
      *-------------------------------------------------------*         00086100
                                                                        00086200
       77 WRK-SQLCODE       PIC -999.                                   00086300
       77 WRK-INDICATOR     PIC S9(04) COMP VALUE ZEROS.                00086400
                                                                        00086500
       01 WRK-ID            PIC 9(04).                                  00086602
                                                                        00086702
      *-------------------------------------------------------*         00089100
                                                                        00089200
                                                                        00089300
      *=======================================================*         00089400
       PROCEDURE                                  DIVISION.             00089500
      *=======================================================*         00089600
                                                                        00089700
                                                                        00089800
      *-------------------------------------------------------*         00089900
                                                                        00090000
      *         R O T I N A  P R I N C I P A L *                        00090100
                                                                        00090200
      *-------------------------------------------------------*         00090300
                                                                        00090400
                                                                        00090500
      *-------------------------------------------------------*         00090600
       0000-PRINCIPAL                              SECTION.             00090700
      *-------------------------------------------------------*         00090800
                                                                        00090900
            PERFORM 1000-INICIAR.                                       00091000
            PERFORM 2000-PROCESSAR.                                     00091100
            PERFORM 3000-FINALIZAR.                                     00091200
                                                                        00091300
      *-------------------------------------------------------*         00091400
       0000-999-FIM.                               EXIT.                00091500
      *-------------------------------------------------------*         00091600
                                                                        00091700
                                                                        00091800
      *-------------------------------------------------------*         00091900
       1000-INICIAR                               SECTION.              00092000
      *-------------------------------------------------------*         00092100
                                                                        00092200
                                                                        00092300
             ACCEPT WRK-ID.                                             00092400
             MOVE WRK-ID TO DB2-ID.                                     00092501
                                                                        00093000
            EXEC SQL                                                    00093103
               SELECT ID, NOME, SETOR, SALARIO, DATAADM, EMAIL          00093203
                INTO :REG-FUNC                                          00093304
                FROM FOUR001.FUNC                                       00093404
                WHERE ID = :DB2-ID                                      00093506
            END-EXEC.                                                   00093603
                                                                        00093706
                 PERFORM 4000-LER-FUNC.                                 00093806
                                                                        00093906
                                                                        00094000
      *-------------------------------------------------------*         00094100
       1000-999-FIM.                              EXIT.                 00094200
      *-------------------------------------------------------*         00094300
                                                                        00094400
                                                                        00094500
      *-------------------------------------------------------*         00094600
       2000-PROCESSAR                             SECTION.              00094700
      *-------------------------------------------------------*         00094800
                                                                        00094900
                                                                        00095600
            EXEC SQL                                                    00095700
               DELETE FROM FOUR001.FUNC WHERE ID = :DB2-ID              00097402
            END-EXEC.                                                   00097500
                                                                        00097600
                                                                        00097700
             EVALUATE SQLCODE                                           00097800
               WHEN 0                                                   00097900
                DISPLAY 'REGISTRO APAGADO'                              00098002
               WHEN 100                                                 00098702
                DISPLAY 'NAO ENCONTRADO '                               00098802
               WHEN OTHER                                               00098900
                MOVE SQLCODE        TO WRK-SQLCODE                      00099000
                DISPLAY 'ERRO....'  WRK-SQLCODE                         00100000
             END-EVALUATE.                                              00100100
                                                                        00100200
      *-------------------------------------------------------*         00100300
       2000-999-FIM.                              EXIT.                 00100400
      *-------------------------------------------------------*         00100500
                                                                        00100600
                                                                        00100706
      *-------------------------------------------------------*         00100806
       4000-LER-FUNC                              SECTION.              00100906
      *-------------------------------------------------------*         00101006
                                                                        00101106
                DISPLAY '======= DADOS CONFIRMADOS =========='          00101206
                DISPLAY 'ID .......' DB2-ID                             00101306
                DISPLAY 'NOME......' DB2-NOME                           00101406
                DISPLAY 'SETOR.....' DB2-SETOR                          00101506
                DISPLAY 'SALARIO...' DB2-SALARIO                        00101606
                DISPLAY 'DATAADM...' DB2-DATAADM                        00101706
                DISPLAY 'EMAIL.....' DB2-EMAIL.                         00101806
                DISPLAY '===================================='.         00101908
                                                                        00102008
      *-------------------------------------------------------*         00102106
       4000-999-FIM.                              EXIT.                 00102207
      *-------------------------------------------------------*         00102306
                                                                        00102406
      *-------------------------------------------------------*         00102506
       3000-FINALIZAR                             SECTION.              00102606
      *-------------------------------------------------------*         00102706
                                                                        00102806
              STOP RUN.                                                 00103000
                                                                        00103100
      *-------------------------------------------------------*         00103200
       3000-999-FIM.                              EXIT.                 00103300
      *-------------------------------------------------------*         00103400
                                                                        00103500
