      *===========================================================      00001009
       IDENTIFICATION                             DIVISION.             00010009
      *===========================================================      00011009
       PROGRAM-ID.  FR03CB08.                                           00020000
      *===========================================================      00030000
      *     AUTOR    : AUGUSTO MARTINS                                  00040000
      *     EMPRESA  : FOURSYS                                          00050000
      *     DATA     : 20/04/2022                                       00060000
      *     OBJETIVO : OPERADOR ARITMETICO, ADICAO --ADD--              00070000
      *              : SOMAR E DEVOLVER O VALOR PARA WRK-RESULT.        00070112
      *===========================================================*     00070216
                                                                        00070317
                                                                        00070417
      *===========================================================*     00070517
       ENVIRONMENT                                DIVISION.             00070617
      *===========================================================*     00070717
                                                                        00070817
      *-----------------------------------------------------------*     00070917
       CONFIGURATION                              SECTION.              00071017
      *-----------------------------------------------------------*     00071117
                                                                        00071217
       SPECIAL-NAMES.                                                   00071317
           DECIMAL-POINT IS COMMA.                                      00071417
                                                                        00071617
      *-----------------------------------------------------------*     00071717
                                                                        00071817
                                                                        00071917
                                                                        00072017
      *===========================================================*     00072116
       DATA                                       DIVISION.             00072200
      *===========================================================*     00072316
                                                                        00072417
                                                                        00072517
      *-----------------------------------------------------------*     00072617
       WORKING-STORAGE                            SECTION.              00072700
      *-----------------------------------------------------------*     00072817
                                                                        00072917
       01 WRK-OPERADOR-AD.                                              00073000
          05 WRK-N1              PIC 99     VALUE ZEROS.                00073112
          05 WRK-N2              PIC 99     VALUE ZEROS.                00074012
          05 WRK-RES             PIC 999    VALUE ZEROS.                00076612
                                                                        00076717
      *-----------------------------------------------------------*     00076817
                                                                        00076917
                                                                        00077017
      *============================================================*    00077117
       PROCEDURE                                  DIVISION.             00077200
      *============================================================*    00077317
                                                                        00077415
                                                                        00077517
      *************************************************************     00077617
      *                    ROTINA PRINCIPAL                       *     00077717
      *************************************************************     00077817
                                                                        00077917
                                                                        00078017
      *============================================================*    00078117
       0000-PRINCIPAL                             SECTION.              00078217
      *============================================================*    00078317
                                                                        00078417
                  PERFORM 1000-INICIAR.                                 00078517
                  PERFORM 2000-PROCESSAR.                               00078617
                  PERFORM 9999-FIMARQ.                                  00078717
                                                                        00078817
      *============================================================*    00078917
       0000-99-FIM.                               EXIT.                 00079017
      *============================================================*    00079117
                                                                        00079217
                                                                        00079317
      *************************************************************     00079417
      *                    PROCEDIMENTO INICIAL                   *     00079517
      *************************************************************     00079617
                                                                        00079717
                                                                        00079817
      *============================================================*    00079917
       1000-INICIAR                               SECTION.              00080017
      *============================================================*    00080117
                                                                        00080217
                                                                        00080317
           ACCEPT WRK-OPERADOR-AD  FROM SYSIN.                          00080417
                                                                        00080517
      *============================================================*    00080617
       1000-99-FIM.                               EXIT.                 00080717
      *============================================================*    00080817
                                                                        00080917
                                                                        00081017
      *************************************************************     00081117
      *                    PROCESSAR                              *     00081217
      *************************************************************     00081317
                                                                        00081417
                                                                        00081517
      *============================================================*    00081617
       2000-PROCESSAR                             SECTION.              00081718
      *============================================================*    00081817
                                                                        00082717
      *     ---------------  GIVING  ------------------ *               00083120
                                                                        00083217
           ADD WRK-N1 WRK-N2       GIVING WRK-RES.                      00083317
                                                                        00083415
           DISPLAY '===================================='               00083505
           DISPLAY 'A SOMA DE NUM1:'  WRK-N1                            00083613
                        ',COM NUM2:'  WRK-N2                            00083713
           DISPLAY 'TOTAL:         '  WRK-RES                           00083820
           DISPLAY '==================================== '.             00083920
                                                                        00084017
      *============================================================*    00084117
       2000-99-FIM.                               EXIT.                 00084219
      *============================================================*    00084317
                                                                        00084417
                                                                        00084617
      *============================================================*    00084717
       9999-FIMARQ                                SECTION.              00084817
      *============================================================*    00084917
                                                                        00085017
           STOP RUN.                                                    00090001
                                                                        00100017
      *============================================================*    00120017
       9999-99-FIM.                               EXIT.                 00130017
      *============================================================*    00140017
