                                                                        00001004
      *=======================================================*         00002004
       IDENTIFICATION                            DIVISION.              00003004
      *=======================================================*         00004004
                                                                        00005004
       PROGRAM-ID.  FR03DB07.                                           00006004
                                                                        00007004
      *=======================================================*         00008004
      *              TREINAMENTO MAINFRAME                    *         00009004
      *=======================================================*         00010004
      *     AUTOR    : AUGUSTO MARTINS                                  00020004
      *     EMPRESA  : FOURSYS                                          00030004
      *     DATA     : 07/06/2022                                       00040004
      *     OBJETIVO : CONSULTA DE DADOS INSERIDOS NA TABELA.           00050004
      *              :                                                  00060004
      *=======================================================*         00070004
       ENVIRONMENT                                    DIVISION.         00080004
      *=======================================================*         00081004
                                                                        00081104
      *=======================================================*         00081204
       CONFIGURATION                                  SECTION.          00081304
      *=======================================================*         00081404
                                                                        00081504
          SPECIAL-NAMES.                                                00081604
              DECIMAL-POINT IS COMMA.                                   00081704
                                                                        00081804
      *=======================================================*         00081904
                                                                        00082004
      *=======================================================*         00082104
       DATA                                       DIVISION.             00082204
      *=======================================================*         00082304
                                                                        00082404
      *-------------------------------------------------------*         00082504
       WORKING-STORAGE                            SECTION.              00082604
      *-------------------------------------------------------*         00082704
                                                                        00082804
      *-------------------------------------------------------*         00082904
        01 FILLER                          PIC X(050)   VALUE           00083004
                '*******AREA DE SQL ******'.                            00083104
      *-------------------------------------------------------*         00083204
                                                                        00083304
           EXEC SQL                                                     00083404
                INCLUDE BKFUNC2                                         00083504
           END-EXEC.                                                    00083604
           EXEC SQL                                                     00083704
                INCLUDE SQLCA                                           00083804
           END-EXEC.                                                    00083904
                                                                        00084004
           EXEC SQL                                                     00084104
               DECLARE CFUNC2 CURSOR  FOR                               00084204
                SELECT * FROM FOUR001.FUNC2                             00084304
                 ORDER BY NOME                                          00084404
           END-EXEC.                                                    00084504
                                                                        00084604
      *-------------------------------------------------------*         00084704
        01 FILLER                          PIC X(050)   VALUE           00084804
                '*******AREA DE ACUMULADORES******'.                    00084904
      *-------------------------------------------------------*         00085004
                                                                        00085104
       77 WRK-ACUM-TOT   PIC 9(08)V99 VALUE ZEROS.                      00085204
       77 WRK-ACUM-SALAR PIC 99.999.999,99.                             00085304
       77 WRK-ACUM-MEDIA PIC 99.999.999,99.                             00085404
       77 WRK-ACUM-LIDOS PIC 9(02) VALUE ZEROS.                         00085504
                                                                        00085604
      *-------------------------------------------------------*         00085704
                                                                        00085804
                                                                        00085904
      *-------------------------------------------------------*         00086004
        01 FILLER                          PIC X(050)   VALUE           00086104
                '*******AREA DE AUXILIARES********'.                    00086204
      *-------------------------------------------------------*         00086304
                                                                        00086404
       77 WRK-ID        PIC 9(04).                                      00086504
       77 WRK-SQLCODE   PIC -999.                                       00086604
       77 WRK-INDICADOR PIC S9(04) COMP VALUE ZEROS.                    00086714
       77 WRK-MAX       PIC 9(10)  VALUE ZEROS.                         00086804
       77 WRK-MAIOR     PIC 9(08)V99 VALUE ZEROS.                       00086904
       77 WRK-AUX       PIC 99.999.999,99.                              00087004
                                                                        00087104
      *-------------------------------------------------------*         00087204
                                                                        00087304
                                                                        00087404
      *=======================================================*         00087504
       PROCEDURE                                  DIVISION.             00087604
      *=======================================================*         00087704
                                                                        00087804
                                                                        00087904
      *-------------------------------------------------------*         00088004
                                                                        00088104
      *         R O T I N A  P R I N C I P A L *                        00088204
                                                                        00088304
      *-------------------------------------------------------*         00088404
                                                                        00088504
                                                                        00088604
      *-------------------------------------------------------*         00088704
       0000-PRINCIPAL                              SECTION.             00088804
      *-------------------------------------------------------*         00088904
                                                                        00089004
            PERFORM 1000-INICIAR.                                       00089104
            PERFORM 2000-PROCESSAR UNTIL SQLCODE EQUAL 100.             00089204
            PERFORM 3000-FINALIZAR.                                     00089304
            STOP RUN.                                                   00089404
                                                                        00089504
      *-------------------------------------------------------*         00089604
       0000-999-FIM.                               EXIT.                00089704
      *-------------------------------------------------------*         00089804
                                                                        00089904
                                                                        00090004
      *-------------------------------------------------------*         00090104
       1000-INICIAR                               SECTION.              00090204
      *-------------------------------------------------------*         00090304
           EXEC SQL                                                     00090404
              OPEN CFUNC2                                               00090504
           END-EXEC.                                                    00090604
            EVALUATE SQLCODE                                            00090704
             WHEN 0                                                     00090804
               MOVE DB2-SALARIO     TO WRK-MAX                          00090904
               PERFORM 4000-LER-FUNC                                    00091004
             WHEN 100                                                   00091104
               DISPLAY 'SEM FUNCIONARIOS'                               00091204
             WHEN OTHER                                                 00091304
               MOVE SQLCODE  TO WRK-SQLCODE                             00091404
               DISPLAY 'ERRO'   WRK-SQLCODE  ' NO OPEN CURSOR'          00091510
               STOP RUN                                                 00091604
            END-EVALUATE.                                               00091704
      *-------------------------------------------------------*         00091804
       1000-999-FIM.                              EXIT.                 00091904
      *-------------------------------------------------------*         00092004
                                                                        00092104
                                                                        00092204
      *-------------------------------------------------------*         00092304
       2000-PROCESSAR                             SECTION.              00092404
      *-------------------------------------------------------*         00092504
                                                                        00092604
              DISPLAY '-------------------------'.                      00092704
                                                                        00092804
              DISPLAY 'ID ........'  DB2-ID                             00092904
              DISPLAY 'NOME ..... '  DB2-NOME                           00093004
              DISPLAY 'SETOR..... '  DB2-SETOR                          00093104
              DISPLAY 'SALARIO ...'  DB2-SALARIO                        00093204
              DISPLAY 'DATAADM ...'  DB2-DATAADM                        00093304
               IF WRK-INDICADOR = 0                                     00093615
                  DISPLAY 'EMAIL ..' DB2-EMAIL                          00093709
               ELSE                                                     00093807
                  DISPLAY '--- SEM EMAIL'                               00093908
               END-IF                                                   00094007
              DISPLAY 'TELEFONE...'  DB2-TELEFONE.                      00094108
                                                                        00094207
               PERFORM 4000-LER-FUNC.                                   00094307
                                                                        00094407
                                                                        00094507
      *-------------------------------------------------------*         00094607
       2000-999-FIM.                              EXIT.                 00094707
      *-------------------------------------------------------*         00094807
                                                                        00094907
                                                                        00095007
      *-------------------------------------------------------*         00095107
       4000-LER-FUNC                              SECTION.              00095207
      *-------------------------------------------------------*         00095307
                                                                        00096211
           EXEC SQL                                                     00096313
             FETCH CFUNC2                                               00096413
              INTO :DB2-ID,                                             00096513
                   :DB2-NOME,                                           00096613
                   :DB2-SETOR,                                          00096713
                   :DB2-SALARIO,                                        00096813
                   :DB2-DATAADM,                                        00096913
                   :DB2-EMAIL :WRK-INDICADOR,                           00097014
                   :DB2-TELEFONE                                        00097113
           END-EXEC.                                                    00097213
                                                                        00097307
           EVALUATE SQLCODE                                             00097407
             WHEN 0                                                     00097507
                 IF WRK-MAX GREATER DB2-SALARIO                         00097607
                    MOVE WRK-MAX      TO WRK-MAIOR                      00097707
                    MOVE WRK-MAIOR    TO WRK-AUX                        00097807
                 ELSE                                                   00097907
                    MOVE DB2-SALARIO  TO WRK-MAX                        00098007
                 END-IF                                                 00098107
                                                                        00098204
                 ADD 1                TO WRK-ACUM-LIDOS                 00098304
                 ADD DB2-SALARIO      TO WRK-ACUM-TOT                   00098404
                 MOVE WRK-ACUM-TOT    TO WRK-ACUM-SALAR                 00098504
                 CONTINUE                                               00098604
                                                                        00098704
             WHEN 100                                                   00098804
                 DISPLAY WRK-ID 'FIM DA TABELA'                         00098904
                                                                        00099004
             WHEN OTHER                                                 00099104
              MOVE  SQLCODE          TO   WRK-SQLCODE                   00099204
              DISPLAY 'ERRO....'  WRK-SQLCODE                           00099304
           END-EVALUATE.                                                00099404
                                                                        00099504
                                                                        00099604
      *-------------------------------------------------------*         00099704
       4000-999-FIM.                              EXIT.                 00099804
      *-------------------------------------------------------*         00099904
                                                                        00100004
                                                                        00100104
      *-------------------------------------------------------*         00100216
       5000-CALCULAR                             SECTION.               00100316
      *-------------------------------------------------------*         00100416
                                                                        00100516
                 DIVIDE WRK-ACUM-TOT   BY WRK-ACUM-LIDOS                00100616
                                       GIVING WRK-ACUM-TOT              00100716
                 END-DIVIDE                                             00100816
                 MOVE WRK-ACUM-TOT    TO WRK-ACUM-MEDIA.                00100917
                                                                        00101016
      *-------------------------------------------------------*         00101216
       5000-999-FIM.                              EXIT.                 00101316
      *-------------------------------------------------------*         00101416
                                                                        00101504
                                                                        00101616
      *-------------------------------------------------------*         00101704
       3000-FINALIZAR                             SECTION.              00101804
      *-------------------------------------------------------*         00101904
                                                                        00102004
           PERFORM 5000-CALCULAR                                        00102116
           EXEC SQL                                                     00102204
             CLOSE CFUNC2                                               00102306
           END-EXEC.                                                    00102404
                                                                        00102504
            DISPLAY '========================================'.         00102604
            DISPLAY '********* ESTATISTICA DE DADOS *********'.         00102704
            DISPLAY 'REGISTROS LIDOS:      ' WRK-ACUM-LIDOS.            00102804
            DISPLAY 'SOMA DOS SALARIOS:  R$' WRK-ACUM-SALAR.            00102904
            DISPLAY 'MEDIA SALARIAL:     R$' WRK-ACUM-MEDIA.            00103004
            DISPLAY 'MARIO SALARIO:      R$' WRK-AUX.                   00103104
            DISPLAY '========================================'.         00103204
                                                                        00103304
      *-------------------------------------------------------*         00103404
       3000-999-FIM.                              EXIT.                 00103504
      *-------------------------------------------------------*         00103604
                                                                        00104004
