                                                                        00001010
      *=======================================================*         00002010
       IDENTIFICATION                            DIVISION.              00010000
      *=======================================================*         00012009
                                                                        00013010
       PROGRAM-ID.  FR03CB01.                                           00020000
                                                                        00021011
      *=======================================================*         00021110
      *              TREINAMENTO MAINFRAME                    *         00022014
      *=======================================================*         00031010
      *     AUTOR    : AUGUSTO MARTINS                                  00040000
      *     EMPRESA  : FOURSYS                                          00050000
      *     DATA     : 18/04/2022                                       00060000
      *     OBJETIVO : TESTE DE COMPILACAO, INSERIR UM                  00070008
      *              : TEXTO NO DISPLAY.                                00071008
      *=======================================================*         00080009
       ENVIRONMENT                                    DIVISION.         00081013
      *=======================================================*         00081112
                                                                        00081206
      *=======================================================*         00081312
       DATA                                       DIVISION.             00082012
      *=======================================================*         00083012
       PROCEDURE                                  DIVISION.             00090000
      *=======================================================*         00091012
       0000-PRINCIPAL                             SECTION.              00091112
      *=======================================================*         00091212
                                                                        00091312
           PERFORM 1000-INICIAR.                                        00092012
                                                                        00092112
      *=======================================================*         00092212
       1000-INICIAR                                SECTION.             00093012
      *=======================================================*         00093112
                                                                        00096012
           DISPLAY 'MEU PRIMEIRO PROGRAMA - FR03CB01'.                  00100005
           DISPLAY 'MAINFRAME'.                                         00101015
           STOP RUN.                                                    00110001
                                                                        00111012
      *=======================================================*         00112012
       1000-99-FIM.                                 EXIT.               00113012
      *=======================================================*         00120012
