      *===========================================================      00001000
       IDENTIFICATION                             DIVISION.             00002000
      *===========================================================      00003000
       PROGRAM-ID.  FR03CB11.                                           00004000
      *===========================================================      00005000
      *     AUTOR    : AUGUSTO MARTINS                                  00006000
      *     EMPRESA  : FOURSYS                                          00007000
      *     DATA     : 20/04/2022                                       00008000
      *     OBJETIVO : OPERADOR ARITMETICO, SUBTRACT.                   00009000
      *              : RECEBER DA SYSIN DOIS VALORES E DEVOLVER         00010000
      *              : O RESULTADO PARA VARIAVEL WRK-RES.               00011000
      *===========================================================      00012000
      *ENVIROMENT                                                       00013000
      *===========================================================      00014000
       DATA                                       DIVISION.             00015000
      *===========================================================      00016000
       WORKING-STORAGE                            SECTION.              00017000
      *===========================================================      00018000
       01 WRK-OPERADOR-AD.                                              00019000
          05 WRK-N1              PIC 99  VALUE ZEROS.                   00020000
          05 WRK-N2              PIC 99  VALUE ZEROS.                   00030000
          05 WRK-RES             PIC 999 VALUE ZEROS.                   00040000
      *==========================================================       00050000
       PROCEDURE                                  DIVISION.             00060000
      *==========================================================       00070000
      *                                                                 00071000
           ACCEPT WRK-OPERADOR-AD    FROM SYSIN.                        00071100
      * ----------------- SUBTRACT -------------------                  00071200
           SUBTRACT WRK-N1           FROM WRK-N2  GIVING WRK-RES.       00071300
      *                                                                 00071400
           DISPLAY '===================================='               00071500
           DISPLAY 'A SUBTRACAO DE NUM2:' WRK-N1                        00071601
                        ',POR NUM1:'      WRK-N2                        00071701
           DISPLAY 'TOTAL:'                WRK-RES                      00071800
           DISPLAY '==================================== '              00071900
           STOP RUN.                                                    00072900
