      *===========================================================*     00001000
       IDENTIFICATION                             DIVISION.             00002000
      *===========================================================*     00003000
                                                                        00003100
       PROGRAM-ID.  FR03CB18.                                           00003200
                                                                        00003300
      *===========================================================*     00003400
      *              TREINAMENTO MAINFRAME                              00003500
      *===========================================================*     00003600
                                                                        00003700
      *===========================================================*     00003800
      *                                                                 00003900
      *   PROGRAMADOR: AUGUSTO MARTINS                                  00004000
      *   EMPRESA    : FOURSYS                                          00005000
      *   DATA       : 25/04/2022                                       00006000
      *   OBJETIVO   : CALCULAR O VALOR DO FRETE, DE ACORDO COM A       00007000
      *              : REGIAO.                                          00008000
      *                                                                 00009000
      *===========================================================*     00010000
                                                                        00011000
                                                                        00012000
      *===========================================================*     00012100
       ENVIRONMENT                                DIVISION.             00012200
      *===========================================================*     00012300
                                                                        00012400
      *-----------------------------------------------------------*     00012500
       CONFIGURATION                              SECTION.              00012600
      *-----------------------------------------------------------*     00012700
                                                                        00012800
       SPECIAL-NAMES.                                                   00012900
           DECIMAL-POINT IS COMMA.                                      00013000
                                                                        00013100
      *===========================================================*     00013200
       DATA                                       DIVISION.             00013300
      *===========================================================*     00013400
                                                                        00013500
                                                                        00013600
      *-----------------------------------------------------------*     00013700
       WORKING-STORAGE                            SECTION.              00013800
      *-----------------------------------------------------------*     00013900
                                                                        00014000
                                                                        00015000
      *-----------------------------------------------------------*     00015100
      *---------    INICIO  DA WORKING - SECTION         ---------*     00015200
      *-----------------------------------------------------------*     00015300
                                                                        00015400
                                                                        00015500
      *-----------------------------------------------------------*     00015600
                                                                        00015700
        01 WRK-CUST-FRET.                                               00015800
           05 WRK-CODIGO               PIC 9(05) VALUE ZEROS.           00015900
           05 WRK-PRODUTO              PIC X(15) VALUE SPACES.          00016000
           05 WRK-VALOR                PIC 9(08)V99 VALUE ZEROS.        00016100
           05 WRK-ESTADO               PIC X(02) VALUE SPACES.          00016200
        01 WRK-FRETE                   PIC 9(08)V99 VALUE ZEROS.        00016300
        01 WRK-MSG                     PIC X(25) VALUE SPACES.          00016400
                                                                        00016700
      *-----------------------------------------------------------*     00016800
                                                                        00016900
                                                                        00017000
      *===========================================================*     00017100
       PROCEDURE                                  DIVISION.             00017200
      *===========================================================*     00017300
                                                                        00017400
      *************************************************************     00017500
      *                    ROTINA PRINCIPAL                       *     00017600
      *************************************************************     00017700
                                                                        00017800
      *-----------------------------------------------------------*     00017900
       0000-PRINCIPAL                               SECTION.            00018000
      *-----------------------------------------------------------*     00019000
                                                                        00019100
            PERFORM 1000-INICIAR                                        00019201
            PERFORM 2000-PROCESSAR                                      00019301
            PERFORM 9999-FIMARQ.                                        00019401
                                                                        00019500
      *-----------------------------------------------------------*     00020000
       0000-99-FIM.                                  EXIT.              00020100
      *-----------------------------------------------------------*     00020200
                                                                        00020300
      *************************************************************     00020400
      *                    PROCEDIMENTO INICIAL                   *     00020500
      *************************************************************     00020600
                                                                        00020700
      *-----------------------------------------------------------*     00020800
       1000-INICIAR                                  SECTION.           00020900
      *-----------------------------------------------------------*     00021000
                                                                        00021100
             ACCEPT WRK-CUST-FRET FROM SYSIN.                           00021200
                                                                        00021300
      *-----------------------------------------------------------*     00021400
       1000-99-FIM.                                   EXIT.             00021500
      *-----------------------------------------------------------*     00021600
                                                                        00021700
                                                                        00025500
      *************************************************************     00025600
      *                    PROCESSAR                              *     00025700
      *************************************************************     00025800
                                                                        00025900
                                                                        00026000
      *-----------------------------------------------------------*     00026100
       2000-PROCESSAR                                SECTION.           00026200
      *-----------------------------------------------------------*     00026300
                                                                        00026400
              IF WRK-VALOR GREATER THAN OR EQUAL 1000                   00026500
                 EVALUATE WRK-ESTADO                                    00026601
                    WHEN 'SP'                                           00026700
                      COMPUTE WRK-FRETE = WRK-VALOR * 0,10              00026807
                    WHEN 'RJ'                                           00026900
                      COMPUTE WRK-FRETE = WRK-VALOR * 0,15              00027107
                    WHEN 'MG'                                           00027200
                      COMPUTE WRK-FRETE = WRK-VALOR * 0,20              00027307
                  WHEN OTHER                                            00027400
                      MOVE 'NAO ENTREGAMOS'   TO WRK-MSG                00027500
                END-EVALUATE                                            00027601
               ELSE                                                     00027700
                      MOVE 'RETIRADA SOMENTE NA LOJA' TO WRK-MSG        00027800
              END-IF                                                    00027900
                                                                        00028000
             DISPLAY 'CODIGO: ' WRK-CODIGO                              00029000
             DISPLAY 'PRODUTO:' WRK-PRODUTO                             00029100
             DISPLAY 'VALOR:  ' WRK-VALOR                               00029200
                                                                        00029300
              IF WRK-FRETE EQUAL ZEROS                                  00029400
                 DISPLAY WRK-MSG                                        00029500
               ELSE                                                     00029600
                 DISPLAY 'VALOR FRETE: ' WRK-FRETE                      00029700
             END-IF.                                                    00029800
                                                                        00029900
      *-----------------------------------------------------------*     00030200
       2000-99-FIM.                                  EXIT.              00030300
      *-----------------------------------------------------------*     00030400
                                                                        00038000
                                                                        00038100
      *-----------------------------------------------------------*     00039000
       9999-FIMARQ                                   SECTION.           00040000
      *-----------------------------------------------------------*     00050000
                                                                        00051000
              DISPLAY 'FIM DO PROCESSAMENTO'.                           00053000
              STOP RUN.                                                 00054000
                                                                        00055000
      *-----------------------------------------------------------*     00056000
       9999-99-FIM.                                   EXIT.             00057000
      *-----------------------------------------------------------*     00058000
