                                                                        00001000
      *=======================================================*         00002000
       IDENTIFICATION                            DIVISION.              00003000
      *=======================================================*         00004000
                                                                        00005000
       PROGRAM-ID.  FR03DB02.                                           00006000
                                                                        00007000
      *=======================================================*         00008000
      *              TREINAMENTO MAINFRAME                    *         00009000
      *=======================================================*         00010000
      *     AUTOR    : AUGUSTO MARTINS                                  00020000
      *     EMPRESA  : FOURSYS                                          00030000
      *     DATA     : 01/06/2022                                       00040000
      *     OBJETIVO : CONSULTA DE DADOS INSERIDOS NA TABELA.           00050000
      *              :                                                  00060000
      *=======================================================*         00070000
       ENVIRONMENT                                    DIVISION.         00080000
      *=======================================================*         00081000
                                                                        00081100
      *=======================================================*         00081200
       CONFIGURATION                                  SECTION.          00081300
      *=======================================================*         00081400
                                                                        00081500
          SPECIAL-NAMES.                                                00081600
              DECIMAL-POINT IS COMMA.                                   00081700
                                                                        00081800
      *=======================================================*         00081900
                                                                        00082200
      *=======================================================*         00082300
       DATA                                       DIVISION.             00082400
      *=======================================================*         00082500
                                                                        00082600
      *-------------------------------------------------------*         00082700
       WORKING-STORAGE                            SECTION.              00082800
      *-------------------------------------------------------*         00082900
                                                                        00083000
      *-------------------------------------------------------*         00083100
        01 FILLER                          PIC X(050)   VALUE           00083200
                '*******AREA DE SQL ******'.                            00083300
      *-------------------------------------------------------*         00083400
                                                                        00083500
           EXEC SQL                                                     00084100
                INCLUDE BOOKFUNC                                        00084201
           END-EXEC.                                                    00084300
           EXEC SQL                                                     00084400
                INCLUDE SQLCA                                           00084500
           END-EXEC.                                                    00084600
                                                                        00084700
           EXEC SQL                                                     00084800
               DECLARE CFUNC CURSOR  FOR                                00084900
                SELECT * FROM FOUR001.FUNC                              00085000
                 ORDER BY NOME                                          00085100
           END-EXEC.                                                    00085200
                                                                        00085300
      *-------------------------------------------------------*         00085400
        01 FILLER                          PIC X(050)   VALUE           00085500
                '*******AREA DE ACUMULADORES******'.                    00085600
      *-------------------------------------------------------*         00085700
                                                                        00085800
       77 WRK-ACUM-TOT   PIC 9(08)V99 VALUE ZEROS.                      00085900
       77 WRK-ACUM-SALAR PIC 99.999.999,99.                             00086000
       77 WRK-ACUM-MEDIA PIC 99.999.999,99.                             00086100
       77 WRK-ACUM-LIDOS PIC 9(02) VALUE ZEROS.                         00086200
                                                                        00086300
      *-------------------------------------------------------*         00086400
                                                                        00086500
                                                                        00086600
      *-------------------------------------------------------*         00086700
        01 FILLER                          PIC X(050)   VALUE           00086800
                '*******AREA DE AUXILIARES********'.                    00086900
      *-------------------------------------------------------*         00087000
                                                                        00087100
       77 WRK-ID        PIC 9(04).                                      00087200
       77 WRK-SQLCODE   PIC -999.                                       00087300
       77 WRK-INDICATOR PIC S9(04) COMP VALUE ZEROS.                    00087400
       77 WRK-COMP      PIC 9(10)  VALUE ZEROS.                         00087500
       77 WRK-MAIOR     PIC 9(08)V99 VALUE ZEROS.                       00087600
       77 WRK-AUX       PIC 99.999.999,99.                              00087700
                                                                        00087800
      *-------------------------------------------------------*         00087900
                                                                        00088000
                                                                        00088100
      *=======================================================*         00088200
       PROCEDURE                                  DIVISION.             00088300
      *=======================================================*         00088400
                                                                        00088500
                                                                        00088600
      *-------------------------------------------------------*         00088700
                                                                        00088800
      *         R O T I N A  P R I N C I P A L *                        00088900
                                                                        00089000
      *-------------------------------------------------------*         00089100
                                                                        00089200
                                                                        00089300
      *-------------------------------------------------------*         00089400
       0000-PRINCIPAL                              SECTION.             00089500
      *-------------------------------------------------------*         00089600
                                                                        00089700
            PERFORM 1000-INICIAR.                                       00089800
            PERFORM 2000-PROCESSAR UNTIL SQLCODE EQUAL 100.             00089900
            PERFORM 3000-FINALIZAR.                                     00090000
            STOP RUN.                                                   00090100
                                                                        00090200
      *-------------------------------------------------------*         00090300
       0000-999-FIM.                               EXIT.                00090400
      *-------------------------------------------------------*         00090500
                                                                        00090600
                                                                        00090700
      *-------------------------------------------------------*         00090800
       1000-INICIAR                               SECTION.              00090900
      *-------------------------------------------------------*         00091000
           EXEC SQL                                                     00091100
              OPEN CFUNC                                                00091200
           END-EXEC.                                                    00091300
            EVALUATE SQLCODE                                            00091400
             WHEN 0                                                     00091500
               MOVE DB2-SALARIO     TO WRK-COMP                         00091600
               PERFORM 4000-LER-FUNC                                    00091700
             WHEN 1000                                                  00091900
               DISPLAY 'SEM FUNCIONARIOS'                               00092000
             WHEN OTHER                                                 00092100
               MOVE SQLCODE  TO WRK-SQLCODE                             00092200
               DISPLAY 'ERRO'   WRK-SQLCODE  ' NO OPEN CURSOSR'         00092300
               STOP RUN                                                 00092400
            END-EVALUATE.                                               00092500
      *-------------------------------------------------------*         00092600
       1000-999-FIM.                              EXIT.                 00092700
      *-------------------------------------------------------*         00092800
                                                                        00092900
                                                                        00093000
      *-------------------------------------------------------*         00093100
       2000-PROCESSAR                             SECTION.              00093200
      *-------------------------------------------------------*         00093300
                                                                        00093400
              DISPLAY '-------------------------'.                      00093500
                                                                        00093600
              DISPLAY 'ID ........'  DB2-ID                             00093700
              DISPLAY 'NOME ..... '  DB2-NOME                           00093800
              DISPLAY 'SETOR..... '  DB2-SETOR                          00093900
              DISPLAY 'SALARIO ...'  DB2-SALARIO                        00094000
              DISPLAY 'DATAADM ...'  DB2-DATAADM                        00094100
              DISPLAY 'EMAIL .....'  DB2-EMAIL                          00094200
               IF WRK-INDICATOR = 0                                     00094300
                 DISPLAY 'EMAIL ..' DB2-EMAIL                           00094400
               ELSE                                                     00094500
                 DISPLAY '--- SEM EMAIL'                                00094600
               END-IF                                                   00094700
                                                                        00094800
               PERFORM 4000-LER-FUNC.                                   00094900
                                                                        00095000
                                                                        00095100
      *-------------------------------------------------------*         00095200
       2000-999-FIM.                              EXIT.                 00095300
      *-------------------------------------------------------*         00095400
                                                                        00095500
                                                                        00095600
      *-------------------------------------------------------*         00095700
       4000-LER-FUNC                              SECTION.              00095800
      *-------------------------------------------------------*         00095900
                                                                        00096000
           EXEC SQL                                                     00096100
             FETCH CFUNC                                                00096200
              INTO :DB2-ID,                                             00096300
                   :DB2-NOME,                                           00096400
                   :DB2-SETOR,                                          00096500
                   :DB2-SALARIO,                                        00096600
                   :DB2-DATAADM,                                        00096700
                   :DB2-EMAIL  :WRK-INDICATOR                           00096800
           END-EXEC.                                                    00096900
                                                                        00097000
           EVALUATE SQLCODE                                             00097100
             WHEN 0                                                     00097200
                 IF WRK-COMP GREATER DB2-SALARIO                        00097300
                    MOVE WRK-COMP     TO WRK-MAIOR                      00097500
                    MOVE WRK-MAIOR    TO WRK-AUX                        00097600
                 ELSE                                                   00097700
                    MOVE DB2-SALARIO  TO WRK-COMP                       00097800
                 END-IF                                                 00097900
                                                                        00098000
                 ADD 1                TO WRK-ACUM-LIDOS                 00098100
                 ADD DB2-SALARIO      TO WRK-ACUM-TOT                   00098200
                 MOVE WRK-ACUM-TOT    TO WRK-ACUM-SALAR                 00098300
                 CONTINUE                                               00098400
                                                                        00098500
             WHEN 100                                                   00098600
                 DISPLAY WRK-ID 'FIM DA TABELA'                         00098700
                                                                        00098800
             WHEN OTHER                                                 00098900
              MOVE  SQLCODE          TO   WRK-SQLCODE                   00099000
              DISPLAY 'ERRO....'  WRK-SQLCODE                           00099100
           END-EVALUATE.                                                00099200
                                                                        00099300
                                                                        00099400
      *-------------------------------------------------------*         00099500
       4000-999-FIM.                              EXIT.                 00099600
      *-------------------------------------------------------*         00099700
                                                                        00099800
                                                                        00099900
                                                                        00100000
      *-------------------------------------------------------*         00100100
       3000-FINALIZAR                             SECTION.              00100200
      *-------------------------------------------------------*         00100300
                                                                        00100400
           EXEC SQL                                                     00100500
             CLOSE CFUNC                                                00100600
           END-EXEC.                                                    00100700
                 DIVIDE WRK-ACUM-TOT   BY WRK-ACUM-LIDOS                00100800
                                       GIVING WRK-ACUM-TOT              00100900
                 END-DIVIDE                                             00101000
                 MOVE WRK-ACUM-TOT    TO WRK-ACUM-MEDIA                 00101100
                                                                        00101200
            DISPLAY '========================================'.         00101300
            DISPLAY '********* ESTATISTICA DE DADOS *********'.         00101400
            DISPLAY 'REGISTROS LIDOS:      ' WRK-ACUM-LIDOS.            00101500
            DISPLAY 'SOMA DOS SALARIOS:  R$' WRK-ACUM-SALAR.            00101600
            DISPLAY 'MEDIA SALARIAL:     R$' WRK-ACUM-MEDIA.            00101700
            DISPLAY 'MARIO SALARIO:      R$' WRK-AUX.                   00101800
            DISPLAY '========================================'.         00101900
                                                                        00102000
      *-------------------------------------------------------*         00102100
       3000-999-FIM.                              EXIT.                 00102200
      *-------------------------------------------------------*         00103000
                                                                        00110000
