      *===========================================================*     00001000
       IDENTIFICATION                             DIVISION.             00002000
      *===========================================================*     00003000
                                                                        00003100
       PROGRAM-ID.  FR03CB15.                                           00004000
                                                                        00004100
      *===========================================================*     00004200
      *              TREINAMENTO MAINFRAME                              00004300
      *===========================================================*     00004400
                                                                        00004500
      *===========================================================*     00005000
      *                                                                 00005100
      *   PROGRAMADOR: AUGUSTO MARTINS                                  00006000
      *   EMPRESA    : FOURSYS                                          00007000
      *   DATA       : 25/04/2022                                       00008000
      *   OBJETIVO   : ATUALIZAR ESTRUTURA BASE DO CODIGO,              00009000
      *              : E ATUALIZA O VALOR DO SALARIO CORRIGIDO          00010001
      *                                                                 00011000
      *===========================================================*     00012000
                                                                        00012100
                                                                        00012200
      *===========================================================*     00012300
       ENVIRONMENT                                DIVISION.             00013000
      *===========================================================*     00014000
                                                                        00014200
      *-----------------------------------------------------------*     00014300
       CONFIGURATION                              SECTION.              00014400
      *-----------------------------------------------------------*     00014500
                                                                        00014700
      *===========================================================*     00014800
       DATA                                       DIVISION.             00015000
      *===========================================================*     00015200
                                                                        00015400
                                                                        00015500
      *-----------------------------------------------------------*     00016000
       WORKING-STORAGE                            SECTION.              00017000
      *-----------------------------------------------------------*     00018000
                                                                        00018100
                                                                        00018200
      *-----------------------------------------------------------*     00018300
      *---------    INICIO  DA WORKING - SECTION         ---------*     00018400
      *-----------------------------------------------------------*     00018600
                                                                        00018700
                                                                        00018800
      *-----------------------------------------------------------*     00018900
        01 WRK-SALARIO-COMP         PIC 9(06) COMP-3 VALUE ZEROS.       00019000
        01 WRK-INDICE-COMP          PIC 9(03) COMP-3 VALUE ZEROS.       00019100
        01 WRK-TOTAL-C              PIC 9(06) COMP-3 VALUE ZEROS.       00019200
        01 WRK-SAL-CORR             PIC 9(04) COMP-3 VALUE ZEROS.       00019300
        01 WRK-DIVIDE.                                                  00019400
           05 WRK-SALARIO           PIC 9(06) VALUE ZEROS.              00019500
           05 WRK-INDICE            PIC 9(03) VALUE ZEROS.              00019600
           05 WRK-TOTAL             PIC 9(06) VALUE ZEROS.              00019700
           05 WRK-CORR              PIC 9(04) VALUE ZEROS.              00019800
      *-----------------------------------------------------------*     00019900
                                                                        00020100
                                                                        00020200
      *===========================================================*     00020300
       PROCEDURE                                  DIVISION.             00020400
      *===========================================================*     00020500
                                                                        00020600
      *************************************************************     00020700
      *                    ROTINA PRINCIPAL                       *     00020800
      *************************************************************     00020900
                                                                        00021100
      *-----------------------------------------------------------*     00021200
       0000-PRINCIPAL                               SECTION.            00021300
      *-----------------------------------------------------------*     00021400
                                                                        00021500
            PERFORM 1000-INICIAR                                        00021600
            PERFORM 2000-PROCESSAR                                      00021700
            PERFORM 9999-FIMARQ.                                        00021800
                                                                        00021900
      *-----------------------------------------------------------*     00022000
       0000-99-FIM.                                  EXIT.              00022100
      *-----------------------------------------------------------*     00022200
                                                                        00022300
      *************************************************************     00022400
      *                    PROCEDIMENTO INICIAL                   *     00022500
      *************************************************************     00022600
                                                                        00022700
      *-----------------------------------------------------------*     00022800
       1000-INICIAR                                  SECTION.           00022900
      *-----------------------------------------------------------*     00023000
                                                                        00023100
           ACCEPT WRK-DIVIDE     FROM SYSIN.                            00023200
                                                                        00023300
           MOVE   WRK-SALARIO        TO WRK-SALARIO-COMP.               00023400
           MOVE   WRK-INDICE         TO WRK-INDICE-COMP.                00023500
           MOVE   WRK-TOTAL          TO WRK-TOTAL-C.                    00023600
           MOVE   WRK-CORR           TO WRK-SAL-CORR.                   00023700
                                                                        00023800
      *-----------------------------------------------------------*     00024600
       1000-99-FIM.                                   EXIT.             00024700
      *-----------------------------------------------------------*     00024800
                                                                        00024900
                                                                        00025000
      *************************************************************     00025100
      *                    PROCESSAR                              *     00025200
      *************************************************************     00026000
                                                                        00027000
      *-----------------------------------------------------------*     00028000
       2000-PROCESSAR                                SECTION.           00029000
      *-----------------------------------------------------------*     00029100
           MULTIPLY WRK-SALARIO-COMP BY WRK-INDICE-COMP                 00030000
                                     GIVING WRK-TOTAL-C                 00040000
                                     ON SIZE ERROR PERFORM 9000-ERROR   00050000
                                                                        00050100
           END-MULTIPLY.                                                00050200
                                                                        00050300
           COMPUTE WRK-SAL-CORR = WRK-SALARIO-COMP + WRK-SALARIO-COMP * 00051000
                                                  WRK-INDICE-COMP / 100.00052000
                                                                        00053000
      *  *********** MOVER VARIAVEL SEM COMP   ********************     00053100
                                                                        00053200
           MOVE   WRK-SALARIO-COMP   TO WRK-SALARIO.                    00053300
           MOVE   WRK-INDICE-COMP    TO WRK-INDICE.                     00053400
           MOVE   WRK-TOTAL-C        TO WRK-TOTAL.                      00053500
           MOVE   WRK-SAL-CORR       TO WRK-CORR.                       00053600
                                                                        00053700
                                                                        00053800
                                                                        00053900
      *-----------------------------------------------------------*     00054000
       2000-99-FIM.                                  EXIT.              00054100
      *-----------------------------------------------------------*     00055000
                                                                        00058000
      *-----------------------------------------------------------*     00058100
       9000-ERROR                                    SECTION.           00058200
      *-----------------------------------------------------------*     00058300
           DISPLAY 'ERRO NO PROCESSAMENTO'                              00058400
           PERFORM  9999-FIMARQ.                                        00058500
      *-----------------------------------------------------------*     00058600
       9000-99-FIM.                                  EXIT.              00058700
      *-----------------------------------------------------------*     00058800
                                                                        00058900
      *-----------------------------------------------------------*     00059000
       9999-FIMARQ                                   SECTION.           00059100
      *-----------------------------------------------------------*     00059200
                                                                        00059300
           DISPLAY '===================================='               00059400
           DISPLAY 'VALOR SALARIO     : ' WRK-SALARIO.                  00059500
           DISPLAY 'INDICE            : ' WRK-INDICE.                   00059600
           DISPLAY 'TOTAL SALARIO     : ' WRK-TOTAL.                    00059700
           DISPLAY 'SALARIO CORRIGIDO : ' WRK-CORR.                     00059800
           DISPLAY '==================================== '.             00059900
           DISPLAY 'FIM DE PROCESSAMENTO. '                             00060000
           STOP RUN.                                                    00060100
      *-----------------------------------------------------------*     00060200
       9999-99-FIM.                                   EXIT.             00060300
      *-----------------------------------------------------------*     00060400
