      *===========================================================*     00001018
       IDENTIFICATION                             DIVISION.             00002018
      *===========================================================*     00003018
                                                                        00003118
       PROGRAM-ID.  FR03CB16.                                           00003218
                                                                        00003318
      *===========================================================*     00003418
      *              TREINAMENTO MAINFRAME                              00003518
      *===========================================================*     00003618
                                                                        00003718
      *===========================================================*     00003818
      *                                                                 00003918
      *   PROGRAMADOR: AUGUSTO MARTINS                                  00004018
      *   EMPRESA    : FOURSYS                                          00005018
      *   DATA       : 25/04/2022                                       00006018
      *   OBJETIVO   : CALCULAR VALOR DO COMBUSTIVEL, E TRAZER O        00007018
      *              : MELHOR CUSTO-BENEFICIO.                          00008018
      *                                                                 00009018
      *===========================================================*     00010018
                                                                        00011018
                                                                        00012018
      *===========================================================*     00012118
       ENVIRONMENT                                DIVISION.             00012218
      *===========================================================*     00012318
                                                                        00012418
      *-----------------------------------------------------------*     00012518
       CONFIGURATION                              SECTION.              00012618
      *-----------------------------------------------------------*     00012718
                                                                        00012818
       SPECIAL-NAMES.                                                   00012918
           DECIMAL-POINT IS COMMA.                                      00013018
                                                                        00013118
      *===========================================================*     00013218
       DATA                                       DIVISION.             00013318
      *===========================================================*     00013418
                                                                        00013518
                                                                        00013618
      *-----------------------------------------------------------*     00013718
       WORKING-STORAGE                            SECTION.              00013818
      *-----------------------------------------------------------*     00013918
                                                                        00014018
                                                                        00015018
      *-----------------------------------------------------------*     00015118
      *---------    INICIO  DA WORKING - SECTION         ---------*     00015218
      *-----------------------------------------------------------*     00015318
                                                                        00015418
                                                                        00015518
      *-----------------------------------------------------------*     00015618
                                                                        00015718
        01 WRK-CUSTO.                                                   00015818
           05 WRK-GASOLINA             PIC 9(04) VALUE ZEROS.           00015925
           05 WRK-ALCOOL               PIC 9(04) VALUE ZEROS.           00016025
        01 WRK-TOTAL                   PIC 9(04) VALUE ZEROS.           00017025
        01 WRK-NUMERIC                 PIC X(25) VALUE SPACES.          00017118
                                                                        00018018
      *-----------------------------------------------------------*     00019018
                                                                        00019118
                                                                        00019218
      *===========================================================*     00019318
       PROCEDURE                                  DIVISION.             00019418
      *===========================================================*     00019518
                                                                        00019618
      *************************************************************     00019718
      *                    ROTINA PRINCIPAL                       *     00019818
      *************************************************************     00019918
                                                                        00020018
      *-----------------------------------------------------------*     00020118
       0000-PRINCIPAL                               SECTION.            00020218
      *-----------------------------------------------------------*     00020318
             PERFORM 1000-INICIAR.                                      00020418
             PERFORM 2000-VERIFICADOR-NUMERIC                           00020518
             PERFORM 3000-PROCESSAR.                                    00020618
      *-----------------------------------------------------------*     00020718
       0000-99-FIM.                                  EXIT.              00020818
      *-----------------------------------------------------------*     00020918
                                                                        00021018
      *************************************************************     00022018
      *                    PROCEDIMENTO INICIAL                   *     00022118
      *************************************************************     00022218
                                                                        00022318
      *-----------------------------------------------------------*     00022418
       1000-INICIAR                                  SECTION.           00022518
      *-----------------------------------------------------------*     00022618
                                                                        00022718
             ACCEPT WRK-CUSTO FROM SYSIN.                               00022818
                                                                        00022918
      *-----------------------------------------------------------*     00023018
       1000-99-FIM.                                   EXIT.             00023118
      *-----------------------------------------------------------*     00023218
                                                                        00023418
      *-----------------------------------------------------------*     00023518
       2000-VERIFICADOR-NUMERIC                      SECTION.           00023618
      *-----------------------------------------------------------*     00023718
                                                                        00023818
             IF WRK-CUSTO IS  NUMERIC THEN                              00023918
              MOVE 'VALOR NUMERICO'    TO WRK-NUMERIC                   00024126
                                                                        00024221
             ELSE                                                       00024318
              GO                       TO 8000-TRATAR-ERRO              00024418
                                                                        00024518
             END-IF.                                                    00024618
                                                                        00024718
      *-----------------------------------------------------------*     00024818
       2000-99-FIM.                                   EXIT.             00024918
      *-----------------------------------------------------------*     00025018
                                                                        00025118
                                                                        00025218
      *************************************************************     00025318
      *                    PROCESSAR                              *     00025418
      *************************************************************     00025518
                                                                        00025618
                                                                        00025718
      *-----------------------------------------------------------*     00025818
       3000-PROCESSAR                                SECTION.           00025919
      *-----------------------------------------------------------*     00026018
                                                                        00026118
           COMPUTE WRK-TOTAL =  WRK-GASOLINA * WRK-ALCOOL               00026218
                                                                        00026318
           END-COMPUTE.                                                 00026418
                                                                        00026518
             IF WRK-TOTAL GREATER 070                                   00026618
               DISPLAY 'COLOCAR GASOLINA'                               00026718
             ELSE                                                       00026818
               DISPLAY 'COLOCAR ALCOOL'                                 00026918
             END-IF.                                                    00027018
               DISPLAY WRK-NUMERIC.                                     00027123
                                                                        00027221
             PERFORM 9999-FIMARQ.                                       00028018
      *-----------------------------------------------------------*     00029018
       3000-99-FIM.                                  EXIT.              00030019
      *-----------------------------------------------------------*     00040018
                                                                        00050018
                                                                        00051018
      *-----------------------------------------------------------*     00052018
       8000-TRATAR-ERRO                             SECTION.            00053018
      *-----------------------------------------------------------*     00054018
           DISPLAY 'NAO E UM VALOR NUMERICO'                            00055018
           PERFORM  P9000-FIM.                                          00056018
      *-----------------------------------------------------------*     00057018
       8000-99-FIM.                                  EXIT.              00058018
      *-----------------------------------------------------------*     00058118
                                                                        00058218
                                                                        00058318
      *-----------------------------------------------------------*     00058418
       9999-FIMARQ                                   SECTION.           00058518
      *-----------------------------------------------------------*     00058618
                                                                        00058718
       P9000-FIM.                                                       00058818
              DISPLAY 'FIM DO PROCESSAMENTO'.                           00058918
              STOP RUN.                                                 00059018
                                                                        00059118
      *-----------------------------------------------------------*     00059218
       9999-99-FIM.                                   EXIT.             00059318
      *-----------------------------------------------------------*     00059418
