                                                                        00001000
      *=======================================================*         00002000
       IDENTIFICATION                            DIVISION.              00003000
      *=======================================================*         00004000
                                                                        00005000
       PROGRAM-ID.  FR03DB05.                                           00006008
                                                                        00007000
      *=======================================================*         00008000
      *              TREINAMENTO MAINFRAME                    *         00009000
      *=======================================================*         00010000
      *     AUTOR    : AUGUSTO MARTINS                                  00020000
      *     EMPRESA  : FOURSYS                                          00030000
      *     DATA     : 05/06/2022                                       00040042
      *     OBJETIVO : FAZER UPDATE DE DADOS, E IMPRIMIR O QUE          00050039
      *              : FOI ALTERADO.                                    00060039
      *=======================================================*         00070000
       ENVIRONMENT                                    DIVISION.         00080000
      *=======================================================*         00081000
                                                                        00081100
      *=======================================================*         00081200
       CONFIGURATION                                  SECTION.          00081300
      *=======================================================*         00081400
                                                                        00081500
          SPECIAL-NAMES.                                                00081600
              DECIMAL-POINT IS COMMA.                                   00081700
                                                                        00081800
      *=======================================================*         00081900
                                                                        00082000
      *=======================================================*         00082100
       DATA                                       DIVISION.             00082200
      *=======================================================*         00082300
                                                                        00082400
      *-------------------------------------------------------*         00082500
       WORKING-STORAGE                            SECTION.              00082600
      *-------------------------------------------------------*         00082700
                                                                        00082800
      *-------------------------------------------------------*         00082900
        01 FILLER                          PIC X(050)   VALUE           00083000
                '*******AREA DE SQL ******'.                            00083100
      *-------------------------------------------------------*         00083200
                                                                        00083300
           EXEC SQL                                                     00083400
                INCLUDE BOOKFUNC                                        00083500
           END-EXEC.                                                    00083600
           EXEC SQL                                                     00083700
                INCLUDE SQLCA                                           00083800
           END-EXEC.                                                    00083900
                                                                        00084000
      *-------------------------------------------------------*         00084100
        01 FILLER                          PIC X(050)   VALUE           00084200
                '*******AREA DE AUXILIARES********'.                    00084300
      *-------------------------------------------------------*         00084400
                                                                        00084500
      *-------------------------------------------------------*         00084600
                                                                        00084700
                                                                        00084800
      *-------------------------------------------------------*         00084900
        01 FILLER                          PIC X(050)   VALUE           00085000
                '*******AREA DE AUXILIARES********'.                    00086000
      *-------------------------------------------------------*         00086100
                                                                        00086200
       77 WRK-SQLCODE       PIC -999.                                   00086300
       77 WRK-INDICATOR     PIC S9(04) COMP VALUE ZEROS.                00086400
       77 WRK-ID-DB         PIC  9(04).                                 00086557
                                                                        00086655
       01 WRK-ID.                                                       00086715
          02 FILLER         PIC X(10).                                  00086808
          02 WRK-ID-AC      PIC 9(04).                                  00086962
                                                                        00087008
                                                                        00087208
       01 WRK-NOME.                                                     00087315
          02 FILLER         PIC X(10).                                  00087408
          02 WRK-NOME-AC    PIC X(30).                                  00087508
                                                                        00087608
       01 WRK-SETOR.                                                    00087708
          02 FILLER         PIC X(10).                                  00087808
          02 WRK-SETOR-AC   PIC X(04).                                  00087908
                                                                        00088008
       01 WRK-SALARIO.                                                  00088108
          02 FILLER         PIC X(10).                                  00088208
          02 WRK-SALARIO-AC PIC 9(08)V9(02).                            00088373
                                                                        00088408
       01 WRK-DATAADM.                                                  00088508
          02 FILLER         PIC X(10).                                  00088608
          02 WRK-DATAADM-AC PIC X(10).                                  00088708
                                                                        00088808
       01 WRK-EMAIL.                                                    00088908
          02 FILLER         PIC X(10).                                  00089008
          02 WRK-EMAIL-AC   PIC X(40).                                  00089108
                                                                        00089208
                                                                        00089308
      *-------------------------------------------------------*         00089408
                                                                        00089508
                                                                        00089608
      *=======================================================*         00089708
       PROCEDURE                                  DIVISION.             00089808
      *=======================================================*         00089908
                                                                        00090008
                                                                        00090108
      *-------------------------------------------------------*         00090208
                                                                        00090308
      *         R O T I N A  P R I N C I P A L *                        00090408
                                                                        00090508
      *-------------------------------------------------------*         00090608
                                                                        00090708
                                                                        00090808
      *-------------------------------------------------------*         00090908
       0000-PRINCIPAL                              SECTION.             00091008
      *-------------------------------------------------------*         00091108
                                                                        00091208
            PERFORM 1000-INICIAR.                                       00091308
            PERFORM 2000-PROCESSAR.                                     00091408
            PERFORM 3000-FINALIZAR.                                     00091508
                                                                        00091608
      *-------------------------------------------------------*         00091708
       0000-999-FIM.                               EXIT.                00091808
      *-------------------------------------------------------*         00091908
                                                                        00092008
                                                                        00092108
      *-------------------------------------------------------*         00092208
       1000-INICIAR                               SECTION.              00092308
      *-------------------------------------------------------*         00092408
                                                                        00092508
              ACCEPT WRK-ID-AC.                                         00092661
              ACCEPT WRK-NOME-AC.                                       00092964
              ACCEPT WRK-SETOR-AC                                       00093067
              ACCEPT WRK-SALARIO-AC.                                    00093167
              ACCEPT WRK-DATAADM-AC.                                    00093267
              ACCEPT WRK-EMAIL-AC.                                      00093367
                MOVE WRK-ID-AC     TO DB2-ID.                           00093460
                                                                        00093755
                                                                        00093855
           EXEC SQL                                                     00093935
             SELECT ID, NOME, SETOR, SALARIO, DATAADM, EMAIL            00094035
              INTO :REG-FUNC                                            00094135
               FROM FOUR001.FUNC                                        00094235
               WHERE ID = :DB2-ID                                       00094335
           END-EXEC.                                                    00094435
                                                                        00094551
                                                                        00094651
              PERFORM 4000-DADOS-ATUAIS.                                00095156
                                                                        00095251
      *-------------------------------------------------------*         00095351
       1000-999-FIM.                              EXIT.                 00095451
      *-------------------------------------------------------*         00095551
                                                                        00095651
                                                                        00095751
      *-------------------------------------------------------*         00095851
       2000-PROCESSAR                             SECTION.              00095951
      *-------------------------------------------------------*         00096051
                                                                        00097051
               IF WRK-NOME-AC      NOT EQUAL                            00098164
                  DB2-NOME         AND                                  00098264
                  WRK-NOME-AC      NOT EQUAL SPACES                     00098364
                  MOVE WRK-NOME-AC TO DB2-NOME                          00098464
               END-IF                                                   00098564
                                                                        00098636
                IF WRK-SETOR-AC     NOT EQUAL                           00098765
                   DB2-SETOR        AND                                 00098865
                   WRK-SETOR-AC     NOT EQUAL SPACES                    00098965
                   MOVE WRK-SETOR-AC TO DB2-SETOR                       00099065
                END-IF                                                  00099165
                                                                        00099343
               IF WRK-SALARIO-AC   NOT EQUAL                            00099474
                  DB2-SALARIO      AND                                  00099574
                  WRK-SALARIO-AC   NOT EQUAL ZEROS                      00099674
                  MOVE WRK-SALARIO-AC TO DB2-SALARIO                    00099774
               END-IF                                                   00099874
                                                                        00099943
               IF WRK-DATAADM-AC   NOT EQUAL                            00100072
                  DB2-DATAADM      AND                                  00100172
                  WRK-DATAADM-AC   NOT EQUAL SPACES                     00100272
                  MOVE WRK-DATAADM-AC TO DB2-DATAADM                    00100372
               END-IF                                                   00100472
                                                                        00100565
               IF WRK-EMAIL-AC     NOT EQUAL                            00100670
                  DB2-EMAIL        AND                                  00100770
                  WRK-EMAIL-AC     NOT EQUAL SPACES                     00100870
                  MOVE WRK-EMAIL-AC   TO DB2-EMAIL                      00100970
               END-IF                                                   00101070
                                                                        00101143
           EXEC SQL                                                     00101264
             UPDATE FOUR001.FUNC                                        00101364
               SET  NOME     =:DB2-NOME,                                00101464
                    SETOR    =:DB2-SETOR,                               00101564
                    SALARIO  =:DB2-SALARIO,                             00101664
                    DATAADM  =:DB2-DATAADM,                             00101764
                    EMAIL    =:DB2-EMAIL                                00101864
                    WHERE  ID=:DB2-ID                                   00101964
           END-EXEC.                                                    00102064
                                                                        00102136
            EVALUATE SQLCODE                                            00102236
              WHEN 0                                                    00102336
               DISPLAY 'DADOS ATUALIZADOS COM SUCESSO'                  00102474
               DISPLAY 'ID.........'  DB2-ID                            00102571
               DISPLAY 'NOME.......'  DB2-NOME                          00102671
               DISPLAY 'SETOR......'  DB2-SETOR                         00102771
               DISPLAY 'SALARIO....'  DB2-SALARIO                       00102871
               DISPLAY 'DATAADM....'  DB2-DATAADM                       00102971
               DISPLAY 'EMAIL......'  DB2-EMAIL                         00103071
              WHEN 100                                                  00103136
               DISPLAY 'FIM DE PROCESSAMENTO'                           00103236
              WHEN OTHER                                                00103336
               DISPLAY 'ERRO DE PROCESSAMENTO '                         00103436
            END-EVALUATE.                                               00103541
                                                                        00103640
      *-------------------------------------------------------*         00103736
       2000-999-FIM.                              EXIT.                 00103836
      *-------------------------------------------------------*         00103936
                                                                        00104036
                                                                        00104136
      *-------------------------------------------------------*         00104236
       4000-DADOS-ATUAIS                          SECTION.              00104336
      *-------------------------------------------------------*         00104436
                                                                        00104536
                DISPLAY '----------------------------------'.           00104666
                DISPLAY '--------- ATUALIZAR DADOS --------'.           00104771
                DISPLAY 'ID.........'     DB2-ID.                       00104871
                DISPLAY 'NOME.......'     DB2-NOME.                     00104971
                DISPLAY 'SETOR......'     DB2-SETOR.                    00105071
                DISPLAY 'SALARIO....'     DB2-SALARIO.                  00105171
                DISPLAY 'DATAADMID..'     DB2-DATAADM                   00105271
                DISPLAY 'EMAIL......'     DB2-EMAIL.                    00105371
                DISPLAY '----------------------------------'.           00105471
                DISPLAY '----------------------------------'.           00105571
                                                                        00105671
      *-------------------------------------------------------*         00105771
       4000-999-FIM.                              EXIT.                 00105871
      *-------------------------------------------------------*         00105971
                                                                        00106071
                                                                        00106171
      *-------------------------------------------------------*         00106271
       3000-FINALIZAR                             SECTION.              00106371
      *-------------------------------------------------------*         00106471
                                                                        00106571
              STOP RUN.                                                 00106671
                                                                        00106771
      *-------------------------------------------------------*         00106871
       3000-999-FIM.                              EXIT.                 00106971
      *-------------------------------------------------------*         00107071
                                                                        00108071
