                                                                        00001000
      *=======================================================*         00002000
       IDENTIFICATION                            DIVISION.              00003000
      *=======================================================*         00004000
                                                                        00005000
       PROGRAM-ID.  FR03DB06.                                           00006000
                                                                        00007000
      *=======================================================*         00008000
      *              TREINAMENTO MAINFRAME                    *         00009000
      *=======================================================*         00010000
      *     AUTOR    : AUGUSTO MARTINS                                  00020000
      *     EMPRESA  : FOURSYS                                          00030000
      *     DATA     : 07/06/2022                                       00040017
      *     OBJETIVO : PROGRAMA SERVE PARA BUSCAR UMA CHAVE E           00050017
      *              : LER DADOS DE UM USUARIO.                         00060017
      *=======================================================*         00070000
       ENVIRONMENT                                    DIVISION.         00080000
      *=======================================================*         00081000
                                                                        00081100
      *=======================================================*         00081200
       CONFIGURATION                                  SECTION.          00081300
      *=======================================================*         00081400
                                                                        00081500
          SPECIAL-NAMES.                                                00081600
              DECIMAL-POINT IS COMMA.                                   00081700
                                                                        00081800
      *=======================================================*         00081900
                                                                        00082000
      *=======================================================*         00082100
       DATA                                       DIVISION.             00082200
      *=======================================================*         00082300
                                                                        00082400
      *-------------------------------------------------------*         00082500
       WORKING-STORAGE                            SECTION.              00082600
      *-------------------------------------------------------*         00082700
                                                                        00082800
      *-------------------------------------------------------*         00082900
        01 FILLER                          PIC X(050)   VALUE           00083000
                '*******AREA DE SQL ******'.                            00083100
      *-------------------------------------------------------*         00083200
                                                                        00083300
           EXEC SQL                                                     00083400
                INCLUDE BKFUNC2                                         00083501
           END-EXEC.                                                    00083600
           EXEC SQL                                                     00083700
                INCLUDE SQLCA                                           00083800
           END-EXEC.                                                    00083900
                                                                        00084000
                                                                        00085000
      *-------------------------------------------------------*         00086000
        01 FILLER                          PIC X(050)   VALUE           00086100
                '*******AREA DE AUXILIARES********'.                    00086200
      *-------------------------------------------------------*         00086300
                                                                        00086400
       77 WRK-ID        PIC 9(05).                                      00086521
       77 WRK-SQLCODE   PIC -999.                                       00086600
       77 WRK-INDICATOR PIC S9(04) COMP VALUE ZEROS.                    00086700
                                                                        00086800
      *-------------------------------------------------------*         00086900
                                                                        00087000
                                                                        00087100
      *=======================================================*         00087200
       PROCEDURE                                  DIVISION.             00087300
      *=======================================================*         00087400
                                                                        00087500
                                                                        00087600
      *-------------------------------------------------------*         00087700
                                                                        00087800
      *         R O T I N A  P R I N C I P A L *                        00087900
                                                                        00088000
      *-------------------------------------------------------*         00088100
                                                                        00088200
                                                                        00088300
      *-------------------------------------------------------*         00088400
       0000-PRINCIPAL                              SECTION.             00088500
      *-------------------------------------------------------*         00088600
                                                                        00088700
            PERFORM 1000-INICIAR.                                       00088800
            PERFORM 2000-PROCESSAR.                                     00088900
            PERFORM 3000-FINALIZAR.                                     00089000
                                                                        00089100
                                                                        00089200
      *-------------------------------------------------------*         00089300
       0000-999-FIM.                               EXIT.                00089400
      *-------------------------------------------------------*         00089500
                                                                        00089600
                                                                        00089700
      *-------------------------------------------------------*         00089800
       1000-INICIAR                               SECTION.              00089900
      *-------------------------------------------------------*         00090000
                                                                        00090100
              ACCEPT WRK-ID  FROM SYSIN .                               00090200
              MOVE   WRK-ID  TO   DB2-ID.                               00090300
                                                                        00090400
      *-------------------------------------------------------*         00090500
       1000-999-FIM.                              EXIT.                 00090600
      *-------------------------------------------------------*         00090700
                                                                        00090800
                                                                        00090900
      *-------------------------------------------------------*         00091000
       2000-PROCESSAR                             SECTION.              00092000
      *-------------------------------------------------------*         00092100
                                                                        00093001
           EXEC SQL                                                     00093111
             SELECT ID, NOME, SETOR, SALARIO, DATAADM, EMAIL, TELEFONE  00093211
              INTO :REG-FUNC2                                           00093311
               FROM FOUR001.FUNC2                                       00093411
               WHERE ID = :DB2-ID                                       00093511
           END-EXEC.                                                    00093611
                                                                        00093700
             PERFORM 4000-LER-FUNC.                                     00094000
                                                                        00094115
                                                                        00094215
      *-------------------------------------------------------*         00094300
       2000-999-FIM.                              EXIT.                 00095000
      *-------------------------------------------------------*         00095100
                                                                        00095200
                                                                        00095300
      *-------------------------------------------------------*         00095400
       4000-LER-FUNC                              SECTION.              00095500
      *-------------------------------------------------------*         00095600
                                                                        00095700
              IF (SQLCODE   NOT EQUAL ZEROS AND +100) OR                00095812
                 (SQLWARN0   EQUAL 'W')                                 00099718
                 MOVE SQLCODE  TO WRK-SQLCODE                           00099812
              END-IF.                                                   00099912
                                                                        00100012
              IF (SQLCODE   EQUAL +100)                                 00100112
                 DISPLAY WRK-ID '.. NAO ENCONTRADO'                     00100212
              END-IF.                                                   00100312
                                                                        00100412
             EXEC SQL                                                   00100622
              SELECT ID, NOME, SETOR, SALARIO, DATAADM, EMAIL, TELEFONE 00100722
                 INTO :REG-FUNC2                                        00100822
                 FROM FOUR001.FUNC2                                     00100922
                 WHERE ID = :DB2-ID                                     00101022
             END-EXEC.                                                  00101122
                                                                        00101222
                   DISPLAY 'ID ........'  DB2-ID                        00101315
                   DISPLAY 'NOME ..... '  DB2-NOME                      00101412
                   DISPLAY 'SETOR..... '  DB2-SETOR                     00101512
                   DISPLAY 'SALARIO ...'  DB2-SALARIO                   00101612
                   DISPLAY 'DATAADM ...'  DB2-DATAADM                   00101712
                    IF WRK-INDICATOR = 0                                00101812
                       DISPLAY 'EMAIL ..' DB2-EMAIL                     00101924
                     ELSE                                               00102015
                       DISPLAY '--- SEM EMAIL'                          00102115
                    END-IF                                              00102216
                   DISPLAY 'TELEFONE...'  DB2-TELEFONE.                 00102316
                                                                        00102412
                                                                        00102514
                                                                        00102612
      *-------------------------------------------------------*         00102912
       4000-999-FIM.                              EXIT.                 00103012
      *-------------------------------------------------------*         00103100
                                                                        00103200
                                                                        00103300
                                                                        00103400
      *-------------------------------------------------------*         00103500
       3000-FINALIZAR                             SECTION.              00103600
      *-------------------------------------------------------*         00103700
                                                                        00103800
              STOP RUN.                                                 00103900
                                                                        00104000
      *-------------------------------------------------------*         00104100
       3000-999-FIM.                              EXIT.                 00104200
      *-------------------------------------------------------*         00104300
                                                                        00105000
