                                                                        00001000
      *=======================================================*         00002000
       IDENTIFICATION                            DIVISION.              00003000
      *=======================================================*         00004000
                                                                        00005000
       PROGRAM-ID.  FR03DB09.                                           00006000
                                                                        00007000
      *=======================================================*         00008000
      *              TREINAMENTO MAINFRAME                    *         00009000
      *=======================================================*         00010000
      *     AUTOR    : AUGUSTO MARTINS                                  00020000
      *     EMPRESA  : FOURSYS                                          00030000
      *     DATA     : 07/06/2022                                       00040000
      *     OBJETIVO : DELETAR CAMPOS DA TABELA.                        00050000
      *              :                                                  00060000
      *=======================================================*         00070000
       ENVIRONMENT                                    DIVISION.         00080000
      *=======================================================*         00081000
                                                                        00081100
      *=======================================================*         00081200
       CONFIGURATION                                  SECTION.          00081300
      *=======================================================*         00081400
                                                                        00081500
          SPECIAL-NAMES.                                                00081600
              DECIMAL-POINT IS COMMA.                                   00081700
                                                                        00081800
      *=======================================================*         00081900
                                                                        00082000
      *=======================================================*         00082100
       DATA                                       DIVISION.             00082200
      *=======================================================*         00082300
                                                                        00082400
      *-------------------------------------------------------*         00082500
       WORKING-STORAGE                            SECTION.              00082600
      *-------------------------------------------------------*         00082700
                                                                        00082800
      *-------------------------------------------------------*         00082900
        01 FILLER                          PIC X(050)   VALUE           00083000
                '*******AREA DE SQL ******'.                            00083100
      *-------------------------------------------------------*         00083200
                                                                        00083300
           EXEC SQL                                                     00083400
                INCLUDE BKFUNC2                                         00083500
           END-EXEC.                                                    00083600
           EXEC SQL                                                     00083700
                INCLUDE SQLCA                                           00083800
           END-EXEC.                                                    00083900
                                                                        00084000
      *-------------------------------------------------------*         00084100
        01 FILLER                          PIC X(050)   VALUE           00084200
                '*******AREA DE AUXILIARES********'.                    00084300
      *-------------------------------------------------------*         00084400
                                                                        00084500
      *-------------------------------------------------------*         00084600
                                                                        00084700
                                                                        00084800
      *-------------------------------------------------------*         00084900
        01 FILLER                          PIC X(050)   VALUE           00085000
                '*******AREA DE AUXILIARES********'.                    00086000
      *-------------------------------------------------------*         00086100
                                                                        00086200
       77 WRK-SQLCODE       PIC -999.                                   00086300
       77 WRK-INDICATOR     PIC S9(04) COMP VALUE ZEROS.                00086400
                                                                        00086500
       01 WRK-ID            PIC 9(05).                                  00086600
                                                                        00086700
      *-------------------------------------------------------*         00086800
                                                                        00086900
                                                                        00087000
      *=======================================================*         00088000
       PROCEDURE                                  DIVISION.             00089000
      *=======================================================*         00089100
                                                                        00089200
                                                                        00089300
      *-------------------------------------------------------*         00089400
                                                                        00089500
      *         R O T I N A  P R I N C I P A L *                        00089600
                                                                        00089700
      *-------------------------------------------------------*         00089800
                                                                        00089900
                                                                        00090000
      *-------------------------------------------------------*         00090100
       0000-PRINCIPAL                              SECTION.             00090200
      *-------------------------------------------------------*         00090300
                                                                        00090400
            PERFORM 1000-INICIAR.                                       00090500
            PERFORM 2000-PROCESSAR.                                     00090600
            PERFORM 3000-FINALIZAR.                                     00090700
                                                                        00090800
      *-------------------------------------------------------*         00090900
       0000-999-FIM.                               EXIT.                00091000
      *-------------------------------------------------------*         00091100
                                                                        00091200
                                                                        00091300
      *-------------------------------------------------------*         00091400
       1000-INICIAR                               SECTION.              00091500
      *-------------------------------------------------------*         00091600
                                                                        00091700
                                                                        00091800
             ACCEPT WRK-ID.                                             00091900
             MOVE WRK-ID TO DB2-ID.                                     00092000
                                                                        00093000
            EXEC SQL                                                    00093100
               SELECT ID, NOME, SETOR, SALARIO, DATAADM, EMAIL,TELEFONE 00093200
                INTO :REG-FUNC2                                         00093300
                FROM FOUR001.FUNC2                                      00093400
                WHERE ID = :DB2-ID                                      00093500
            END-EXEC.                                                   00093600
                                                                        00093700
                 PERFORM 4000-LER-FUNC.                                 00093800
                                                                        00093900
                                                                        00094000
      *-------------------------------------------------------*         00094100
       1000-999-FIM.                              EXIT.                 00094200
      *-------------------------------------------------------*         00094300
                                                                        00094400
                                                                        00094500
      *-------------------------------------------------------*         00094600
       2000-PROCESSAR                             SECTION.              00094700
      *-------------------------------------------------------*         00094800
                                                                        00094900
                                                                        00095000
            EXEC SQL                                                    00096000
               DELETE FROM FOUR001.FUNC2 WHERE ID = :DB2-ID             00097000
            END-EXEC.                                                   00097100
                                                                        00097200
                                                                        00097300
             EVALUATE SQLCODE                                           00097400
               WHEN 0                                                   00097500
                DISPLAY 'REGISTRO APAGADO'                              00097600
               WHEN 100                                                 00097700
                DISPLAY 'NAO ENCONTRADO '                               00097800
               WHEN OTHER                                               00097900
                MOVE SQLCODE        TO WRK-SQLCODE                      00098000
                DISPLAY 'ERRO....'  WRK-SQLCODE                         00099000
             END-EVALUATE.                                              00100000
                                                                        00100100
      *-------------------------------------------------------*         00100200
       2000-999-FIM.                              EXIT.                 00100300
      *-------------------------------------------------------*         00100400
                                                                        00100500
                                                                        00100600
      *-------------------------------------------------------*         00100700
       4000-LER-FUNC                              SECTION.              00100800
      *-------------------------------------------------------*         00100900
                                                                        00101000
                DISPLAY '======= DADOS CONFIRMADOS =========='          00101100
                DISPLAY 'ID .......' DB2-ID                             00101200
                DISPLAY 'NOME......' DB2-NOME                           00101300
                DISPLAY 'SETOR.....' DB2-SETOR                          00101400
                DISPLAY 'SALARIO...' DB2-SALARIO                        00101500
                DISPLAY 'DATAADM...' DB2-DATAADM                        00101600
                DISPLAY 'EMAIL.....' DB2-EMAIL-TEXT                     00101700
                DISPLAY 'TELEFONE..' DB2-TELEFONE.                      00101800
                DISPLAY '===================================='.         00101900
                                                                        00102000
      *-------------------------------------------------------*         00102100
       4000-999-FIM.                              EXIT.                 00102200
      *-------------------------------------------------------*         00102300
                                                                        00102400
      *-------------------------------------------------------*         00102500
       3000-FINALIZAR                             SECTION.              00102600
      *-------------------------------------------------------*         00102700
                                                                        00102800
              STOP RUN.                                                 00102900
                                                                        00103000
      *-------------------------------------------------------*         00103100
       3000-999-FIM.                              EXIT.                 00103200
      *-------------------------------------------------------*         00103300
                                                                        00103400
