      *===========================================================*     00001004
       IDENTIFICATION                             DIVISION.             00002000
      *===========================================================*     00003004
       PROGRAM-ID.  FR03CB10.                                           00004000
      *===========================================================*     00005004
      *     AUTOR    : AUGUSTO MARTINS                                  00006000
      *     EMPRESA  : FOURSYS                                          00007000
      *     DATA     : 20/04/2022                                       00008000
      *     OBJETIVO : OPERADOR ARITMETICO, ADICAO --ADD--              00009000
      *              : SOMAR E DEVOLVER O VALOR PARA WRK-RES,           00010000
      *              : E ACRESCENTAR + 10 AO RESULTADO FINAL.           00011000
      *===========================================================*     00012004
       ENVIRONMENT                                DIVISION              00013004
      *===========================================================*     00014004
       DATA                                       DIVISION.             00015000
      *===========================================================*     00016004
                                                                        00016105
      *-----------------------------------------------------------*     00016205
       WORKING-STORAGE                            SECTION.              00017000
      *-----------------------------------------------------------*     00018105
                                                                        00018205
       01 WRK-OPERADOR-AD.                                              00019000
          05 WRK-N1              PIC 99  VALUE ZEROS.                   00020000
          05 WRK-N2              PIC 99  VALUE ZEROS.                   00030000
          05 WRK-N3              PIC 99  VALUE ZEROS.                   00031002
          05 WRK-RES             PIC 999 VALUE ZEROS.                   00040000
                                                                        00041005
      *-----------------------------------------------------------*     00042005
                                                                        00043005
      *===========================================================*     00044005
       PROCEDURE                                  DIVISION.             00060000
      *===========================================================*     00070005
                                                                        00071001
           ACCEPT WRK-OPERADOR-AD    FROM SYSIN.                        00071100
      * -----------------  TO  ------------------                       00071200
           ADD WRK-N1 WRK-N2 WRK-N3  TO WRK-RES.                        00071302
                                                                        00071401
           DISPLAY '===================================='               00071500
           DISPLAY 'A SOMA DE N1:'  WRK-N1                              00071602
                        ',COM N2:'  WRK-N2                              00071702
                        ' E N4: '    WRK-N3                             00071803
           DISPLAY 'TOTAL:         '  WRK-RES                           00071900
           DISPLAY '==================================== '              00072000
                                                                        00072101
           ADD 10                     TO WRK-RES                        00072200
                                                                        00072301
           DISPLAY '====================================='              00072400
           DISPLAY 'VAMOS ACRESCENTAR + 10'                             00072500
           DISPLAY 'A SOMA DE NUM1:'  WRK-N1                            00072600
                        ',COM NUM2:'  WRK-N2                            00072700
                        ' E N3: '     WRK-N3                            00072802
           DISPLAY 'TOTAL:         '  WRK-RES                           00072900
           DISPLAY '==================================== ' .            00073002
           STOP RUN.                                                    00074000
