      *==============================================================*  00001003
       IDENTIFICATION                            DIVISION.              00010000
      *==============================================================*  00011003
                                                                        00012003
       PROGRAM-ID.  FR03CB06.                                           00020000
                                                                        00021003
      *==============================================================*  00030003
      *     AUTOR    : AUGUSTO MARTINS                                  00040000
      *     EMPRESA  : FOURSYS                                          00050000
      *     DATA     : 20/04/2022                                       00060000
      *     OBJETIVO : RECEBER DADOS DA SYSIN E IMPRIMIR, COM           00070002
      *              : FORMATO FILLER ENTRE AS VARIAVEIS.               00071002
      *==============================================================*  00072003
       ENVIRONMENT                                DIVISION.             00073003
      *==============================================================*  00073103
                                                                        00073204
                                                                        00073304
      *-----------------------------------------------------------*     00073404
       CONFIGURATION                              SECTION.              00073504
      *-----------------------------------------------------------*     00073604
                                                                        00073704
        SPECIAL-NAMES.                                                  00073804
            DECIMAL-POINT IS COMMA.                                     00073904
                                                                        00074004
                                                                        00074104
      *-----------------------------------------------------------*     00074204
                                                                        00074704
                                                                        00074804
      *==============================================================*  00074904
       DATA                                       DIVISION.             00075000
      *==============================================================*  00075104
                                                                        00075203
      *--------------------------------------------------------------*  00075303
                                                                        00075403
       WORKING-STORAGE                            SECTION.              00075500
       01 WRK-DADOS.                                                    00076000
          05 WRK-CODIGO          PIC 9(05) VALUE ZEROS.                 00077000
          05 WRK-NOME            PIC X(15) VALUE SPACES.                00077100
          05 FILLER              PIC X(10) VALUE SPACES.                00077200
          05 WRK-CARGO           PIC X(15) VALUE SPACES.                00077300
          05 FILLER              PIC X(15) VALUE SPACES.                00077400
                                                                        00077503
      *--------------------------------------------------------------*  00077603
                                                                        00077703
      *==============================================================*  00077803
       PROCEDURE                                  DIVISION.             00078000
      *==============================================================*  00078103
                                                                        00078204
                                                                        00078304
      *************************************************************     00078404
      *                    ROTINA PRINCIPAL                       *     00078504
      *************************************************************     00078604
                                                                        00078704
      *=========================================================*       00078804
       0000-PRINCIPAL                             SECTION.              00078904
      *=========================================================*       00079004
                                                                        00079104
                 PERFORM 1000-INICIAR.                                  00079205
                 PERFORM 2000-PROCESSAR.                                00079304
                 PERFORM 9999-FIMARQ.                                   00079404
                                                                        00079604
      *=========================================================*       00079704
       0000-99-FIM.                                EXIT.                00079804
      *=========================================================*       00079904
                                                                        00080004
                                                                        00080104
                                                                        00080204
      *************************************************************     00080304
      *                    ROTINA INICIAL                         *     00080404
      *************************************************************     00080504
                                                                        00080604
                                                                        00080704
                                                                        00080804
      *=========================================================*       00080904
       1000-INICIAR                                SECTION.             00081004
      *=========================================================*       00081104
                                                                        00081404
           ACCEPT WRK-DADOS   FROM SYSIN.                               00081504
                                                                        00081604
      *=========================================================*       00081704
       1000-99-FIM.                                EXIT.                00081804
      *=========================================================*       00081904
                                                                        00082004
                                                                        00082104
      *************************************************************     00082204
      *                    PROCESSAR                              *     00082304
      *************************************************************     00082404
                                                                        00082504
                                                                        00082604
      *=========================================================*       00082804
       2000-PROCESSAR                              SECTION.             00082904
      *=========================================================*       00083004
                                                                        00083104
           DISPLAY '------------------------'                           00083200
           DISPLAY 'CODIGO...  :' WRK-CODIGO.                           00083300
           DISPLAY 'NOME.....  :' WRK-NOME.                             00083400
           DISPLAY 'CARGO....  :' WRK-CARGO.                            00083500
           DISPLAY '------------------------'.                          00083600
                                                                        00083804
      *=========================================================*       00083904
       2000-99-FIM.                                EXIT.                00084004
      *=========================================================*       00084104
                                                                        00084204
                                                                        00084304
      *=========================================================*       00084404
       9999-FIMARQ                                 SECTION.             00084504
      *=========================================================*       00084604
                                                                        00084704
           STOP RUN.                                                    00085000
                                                                        00086004
      *=========================================================*       00087004
       9999-99-FIM.                                EXIT.                00088004
      *=========================================================*       00089004
