      *================================================================*
       IDENTIFICATION                  DIVISION.
      *================================================================*

       PROGRAM-ID. FR03DB11.
       AUTHOR.     AUGUSTO.

      *================================================================*
      *                T  R  E  I  N  A  M  E  N  T  O                 *
      *================================================================*
      *    PROGRAMA....: FR03BD11                                      *
      *    PROGRAMADOR.: AUGUSTO MARTINS       - TREINAMENTO           *
      *    ANALISTA....: IVAN PETRUCCI         - TREINAMENTO           *
      *    DATA........: 10/04/2019                                    *
      *----------------------------------------------------------------*
      *    OBJETIVO....:  CRIAR UM ARQUIVO DE SAIDA PARA LEITURA       *
      *                   DE CAMPOS DA TABELA FOUR001.FUNC             *
      *                                                                *
      *----------------------------------------------------------------*
      *    ARQUIVOS....:                                               *
      *      DDNAME            I/O                   INCLUDE/BOOK      *
      *     EARQCDTR            I                      RESCWCDT        *
      *     EARQSTAT            I                      RESCWSTA        *
      *     SARQENCR            O                      RESCWECR        *
      *----------------------------------------------------------------*
      *    INC'S.......:                                               *
      *    I#BRAD7C - AREA PARA GRAVACAO DE ERROS                      *
      *    RESCWECR - LAYOUT DO ARQUIVO DE SAIDA ENCERRADOS            *
      *----------------------------------------------------------------*

      *================================================================*

      *================================================================*
       ENVIRONMENT                     DIVISION.
      *================================================================*

      *----------------------------------------------------------------*
       CONFIGURATION                   SECTION.
      *----------------------------------------------------------------*

       SPECIAL-NAMES.
           DECIMAL-POINT               IS COMMA.

      *----------------------------------------------------------------*
       INPUT-OUTPUT                    SECTION.
      *----------------------------------------------------------------*

       FILE-CONTROL.
            SELECT RELDB02  ASSIGN      TO RELDB02
                       FILE STATUS      IS WRK-FS-RELDB.


      *================================================================*
       DATA                            DIVISION.
      *================================================================*

      *----------------------------------------------------------------*
       FILE                            SECTION.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
      *    INPUT - DADOS DO ARQUIVO DE ENTRADA(EARQCDTR)               *
      *                                -  LRECL   = 098                *
      *----------------------------------------------------------------*

       FD  RELDB02
           RECORDING MODE IS F
           LABEL RECORD IS STANDARD
           BLOCK CONTAINS 0 RECORDS.
       01  FD-RELDB2                  PIC  X(098).

      *----------------------------------------------------------------*
       WORKING-STORAGE                 SECTION.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
       01  FILLER                      PIC  X(050)         VALUE
           '*** INICIO DA WORKING RESCDS15 ***'.
      *----------------------------------------------------------------*

      *----------------------------------------------------------------*
       01  FILLER                      PIC  X(050)         VALUE
           '*** AREA DE ACUMULADORES ***'.
      *----------------------------------------------------------------*

       01  ACU-LIDOS-EARQCDTR          PIC  9(009) COMP-3  VALUE ZEROS.
       01  ACU-LIDOS-EARQSTAT          PIC  9(009) COMP-3  VALUE ZEROS.

      *----------------------------------------------------------------*
       01  FILLER                      PIC  X(050)         VALUE
           '*** TESTE DE FILE STATUS ***'.
      *----------------------------------------------------------------*

       01  WRK-FS-RELDB         PIC  X(002)        VALUE SPACES.

      *----------------------------------------------------------------*
       01  FILLER                      PIC  X(050)         VALUE
           '*** AREA DO ARQUIVO DE SAIDA SARQENCR***'.
      *----------------------------------------------------------------*

           COPY 'B#RELDB2'.

      *----------------------------------------------------------------*
       01  FILLER                      PIC  X(050)         VALUE
           '*** AREA DE VARIAVEIS AUXILIARES ***'.
      *----------------------------------------------------------------*
       77 WRK-SQLCODE                  PIC -999.
       77 WRK-INDICATOR                PIC S9(04) COMP VALUE ZEROS.

       01  WRK-AUX-INCONS              PIC  X(001)         VALUE SPACES.
       01  WRK-ERRO-OPEN               PIC  X(020)         VALUE SPACES.

       01  WRK-CATEGORIA.
           05 FILLER                   PIC X(04)        VALUE 'ID'.
           05 FILLER                   PIC X(04)        VALUE SPACES.
           05 FILLER                   PIC X(30)        VALUE 'NOME'.
           05 FILLER                   PIC X(04)        VALUE SPACES.
           05 FILLER                   PIC X(05)        VALUE 'SETOR'.
           05 FILLER                   PIC X(04)        VALUE SPACES.
           05 FILLER                   PIC X(10)        VALUE 'SALARIO'.

      *----------------------------------------------------------------*
       01  FILLER                      PIC  X(050)         VALUE
           '*** AREA DB2  ***'.
      *----------------------------------------------------------------*

           EXEC SQL
                INCLUDE BOOKFUNC
           END-EXEC.
           EXEC SQL
              INCLUDE SQLCA
           END-EXEC.

            EXEC SQL
              DECLARE CFUNC CURSOR  FOR
                SELECT * FROM FOUR001.FUNC
                 ORDER BY NOME
            END-EXEC.



      *================================================================*
       PROCEDURE                       DIVISION.
      *================================================================*

      ******************************************************************
      *                                                                *
      *            ROTINA PRINCIPAL                                    *
      *                                                                *
      ******************************************************************

      *----------------------------------------------------------------*
       0000-PRINCIPAL                  SECTION.
      *----------------------------------------------------------------*

           PERFORM 1000-INICIAR

           PERFORM 2000-VERIFICAR-VAZIO

           PERFORM 3000-PROCESSAR  UNTIL SQLCODE EQUAL 100.


           PERFORM 4000-FINALIZAR.

      *----------------------------------------------------------------*
       0000-99-FIM.                    EXIT.
      *----------------------------------------------------------------*

      ******************************************************************
      *                                                                *
      *            PROCEDIMENTOS INICIAIS                              *
      *                                                                *
      ******************************************************************

      *----------------------------------------------------------------*
       1000-INICIAR                    SECTION.
      *----------------------------------------------------------------*

             EXEC SQL
                 OPEN CFUNC
             END-EXEC.

             EVALUATE SQLCODE
               WHEN 0
                  CONTINUE
               WHEN 100
                  DISPLAY 'SEM FUNCIONARIOS'
               WHEN OTHER
                  MOVE SQLCODE  TO WRK-SQLCODE
                  DISPLAY 'ERRO'   WRK-SQLCODE  ' NO OPEN CURSOSR'
                 STOP RUN
               END-EVALUATE


             OPEN OUTPUT RELDB02

             PERFORM 1100-TESTAR-FILE-STATUS.


             WRITE FD-RELDB2    FROM WRK-CATEGORIA.

      *----------------------------------------------------------------*
       1000-99-FIM.                    EXIT.
      *----------------------------------------------------------------*

      ******************************************************************
      *                                                                *
      *            TESTE DE FILE STATUS                                *
      *                                                                *
      ******************************************************************
      *----------------------------------------------------------------*
       1100-TESTAR-FILE-STATUS         SECTION.
      *----------------------------------------------------------------*

             IF WRK-FS-RELDB NOT EQUAL ZEROS
                MOVE ' ERRO NO OPEN: '  TO WRK-ERRO-OPEN
                PERFORM 9999-TRATAR-ERRO
             END-IF.


      *----------------------------------------------------------------*
       1100-99-FIM.                    EXIT.
      *----------------------------------------------------------------*

      ******************************************************************
      *                                                                *
      *            VERIFICAR ARQUIVO VAZIO                             *
      *                                                                *
      ******************************************************************

      *----------------------------------------------------------------*
       2000-VERIFICAR-VAZIO            SECTION.
      *----------------------------------------------------------------*


           IF WRK-FS-RELDB          EQUAL '10'
              DISPLAY '***************** RESCDS15 ******************'
              DISPLAY '*                                           *'
              DISPLAY '*           ARQUIVO EARQCDTR VAZIO          *'
              DISPLAY '*                                           *'
              DISPLAY '***************** RESCDS15 ******************'
              PERFORM 4000-FINALIZAR
           END-IF.


      *----------------------------------------------------------------*
       2000-99-FIM.                    EXIT.
      *----------------------------------------------------------------*

      ******************************************************************
      *                                                                *
      *    PROCESSAMENTO PRINCIPAL                                     *
      *                                                                *
      ******************************************************************

      *----------------------------------------------------------------*
       3000-PROCESSAR                  SECTION.
      *----------------------------------------------------------------*



              PERFORM 3100-LER-FUNC

              MOVE DB2-ID               TO WRK-ID

              MOVE DB2-NOME             TO WRK-NOME

              MOVE DB2-SETOR            TO WRK-SETOR

              MOVE DB2-SALARIO          TO WRK-SALARIO


              PERFORM 3110-GRAVAR-RELDB2.


      *----------------------------------------------------------------*
       3000-99-FIM.                    EXIT.
      *----------------------------------------------------------------*

      ******************************************************************
      *                                                                *
      *    LER DADOS TABELA FOUR001.FUNC                                *
      *                                                                *
      ******************************************************************

      *----------------------------------------------------------------*
       3100-LER-FUNC                    SECTION.
      *----------------------------------------------------------------*

            EXEC SQL
              FETCH CFUNC
               INTO :DB2-ID,
                    :DB2-NOME,
                    :DB2-SETOR,
                    :DB2-SALARIO,
                    :DB2-DATAADM,
                    :DB2-EMAIL  :WRK-INDICATOR
            END-EXEC.


            EVALUATE SQLCODE
               WHEN 0
                 DISPLAY 'REG: ' DB2-ID DB2-NOME DB2-SETOR DB2-EMAIL
               WHEN 100
                    DISPLAY 'FIM DO PROCESSAMENTO:'

               WHEN OTHER
                    MOVE  SQLCODE      TO   WRK-SQLCODE
                  DISPLAY 'ERRO....'  WRK-SQLCODE
               END-EVALUATE.

      *----------------------------------------------------------------*
       3100-99-FIM.                    EXIT.
      *----------------------------------------------------------------*


      ******************************************************************
      *                                                                *
      *            GRAVAR ARQUIVO DE SAIDA - RELDB2                    *
      *                                                                *
      ******************************************************************

      *----------------------------------------------------------------*
       3110-GRAVAR-RELDB2              SECTION.
      *----------------------------------------------------------------*

             WRITE FD-RELDB2           FROM WRK-REG-RELDB2.

      *----------------------------------------------------------------*
       3110-99-FIM.                    EXIT.
      *----------------------------------------------------------------*

      ******************************************************************
      *                                                                *
      *            TRATAR ERRO                                         *
      *                                                                *
      ******************************************************************

      *----------------------------------------------------------------*
       9999-TRATAR-ERRO                  SECTION.
      *----------------------------------------------------------------*

           DISPLAY WRK-ERRO-OPEN ':' WRK-FS-RELDB

           PERFORM 4000-FINALIZAR.

      *----------------------------------------------------------------*
       9999-99-FIM.                    EXIT.
      *----------------------------------------------------------------*


      ******************************************************************
      *                                                                *
      *            FINALIZACAO                                         *
      *                                                                *
      ******************************************************************

      *----------------------------------------------------------------*
       4000-FINALIZAR                  SECTION.
      *----------------------------------------------------------------*

           EXEC SQL
             CLOSE CFUNC
           END-EXEC.

           CLOSE RELDB02

           STOP RUN.

      *----------------------------------------------------------------*
       4000-99-FIM.                    EXIT.
      *----------------------------------------------------------------*
