      *===========================================================*     00001000
       IDENTIFICATION                             DIVISION.             00002000
      *===========================================================*     00003000
                                                                        00003100
       PROGRAM-ID.  FR03CB19.                                           00003200
                                                                        00003300
      *===========================================================*     00003400
      *              TREINAMENTO MAINFRAME                              00003500
      *===========================================================*     00003600
                                                                        00003700
      *===========================================================*     00003800
      *                                                                 00003900
      *   PROGRAMADOR: AUGUSTO MARTINS                                  00004000
      *   EMPRESA    : FOURSYS                                          00005000
      *   DATA       : 25/04/2022                                       00006000
      *   OBJETIVO   : CALCULAR A MEDIA DE UM ALUNO, E RETORNAR         00007001
      *              : COM A NOTA E STATUS.                             00008001
      *                                                                 00009000
      *===========================================================*     00010000
                                                                        00011000
                                                                        00012000
      *===========================================================*     00012100
       ENVIRONMENT                                DIVISION.             00012200
      *===========================================================*     00012300
                                                                        00012400
      *-----------------------------------------------------------*     00012500
       CONFIGURATION                              SECTION.              00012600
      *-----------------------------------------------------------*     00012700
                                                                        00012800
       SPECIAL-NAMES.                                                   00012900
           DECIMAL-POINT IS COMMA.                                      00013000
                                                                        00013100
      *===========================================================*     00013200
       DATA                                       DIVISION.             00013300
      *===========================================================*     00013400
                                                                        00013500
                                                                        00013600
      *-----------------------------------------------------------*     00013700
       WORKING-STORAGE                            SECTION.              00013800
      *-----------------------------------------------------------*     00013900
                                                                        00014000
                                                                        00015000
      *-----------------------------------------------------------*     00015100
      *---------    INICIO  DA WORKING - SECTION         ---------*     00015200
      *-----------------------------------------------------------*     00015300
                                                                        00015400
                                                                        00015500
      *-----------------------------------------------------------*     00015600
                                                                        00015700
        01 WRK-REGISTRO.                                                00015802
           05 WRK-NOTA1                PIC 9(02)V99 VALUE ZEROS.        00015904
           05 WRK-NOTA2                PIC 9(02)V99 VALUE ZEROS.        00016004
        01 WRK-MEDIA                   PIC 9(02)V99 VALUE ZEROS.        00016304
        01 WRK-MSG                     PIC X(15) VALUE SPACES.          00016401
                                                                        00016500
      *-----------------------------------------------------------*     00016600
                                                                        00016700
                                                                        00016800
      *===========================================================*     00016900
       PROCEDURE                                  DIVISION.             00017000
      *===========================================================*     00017100
                                                                        00017200
      *************************************************************     00017300
      *                    ROTINA PRINCIPAL                       *     00017400
      *************************************************************     00017500
                                                                        00017600
      *-----------------------------------------------------------*     00017700
       0000-PRINCIPAL                               SECTION.            00017800
      *-----------------------------------------------------------*     00017900
                                                                        00018000
            PERFORM 1000-INICIAR                                        00019000
            PERFORM 2000-PROCESSAR                                      00019100
            PERFORM 9999-FIMARQ.                                        00019200
                                                                        00019300
      *-----------------------------------------------------------*     00019400
       0000-99-FIM.                                  EXIT.              00019500
      *-----------------------------------------------------------*     00019600
                                                                        00019700
      *************************************************************     00019800
      *                    PROCEDIMENTO INICIAL                   *     00019900
      *************************************************************     00020000
                                                                        00020100
      *-----------------------------------------------------------*     00020200
       1000-INICIAR                                  SECTION.           00020300
      *-----------------------------------------------------------*     00020400
                                                                        00020500
             ACCEPT WRK-REGISTRO  FROM SYSIN.                           00020602
                                                                        00020700
      *-----------------------------------------------------------*     00020800
       1000-99-FIM.                                   EXIT.             00020900
      *-----------------------------------------------------------*     00021000
                                                                        00022000
                                                                        00023000
      *************************************************************     00024000
      *                    PROCESSAR                              *     00025000
      *************************************************************     00025100
                                                                        00025200
                                                                        00025300
      *-----------------------------------------------------------*     00025400
       2000-PROCESSAR                                SECTION.           00025500
      *-----------------------------------------------------------*     00025600
                                                                        00025700
               COMPUTE WRK-MEDIA =(WRK-NOTA1 + WRK-NOTA2) / 2,00.       00025814
                                                                        00025911
               EVALUATE WRK-MEDIA                                       00026101
                  WHEN 0,00 THRU 2,01                                   00027321
                     MOVE 'REPROVADO'   TO WRK-MSG                      00027422
                  WHEN 2,00 THRU 5,99                                   00027521
                     MOVE 'RECUPERACAO' TO WRK-MSG                      00027621
                  WHEN 6,00 THRU 8,99                                   00027721
                     MOVE 'APROVADO'    TO WRK-MSG                      00027821
                  WHEN 9,00 THRU 10,00                                  00027921
                     MOVE 'DE GLORIA '  TO WRK-MSG                      00028021
                  WHEN OTHER                                            00028121
                     MOVE 'ERRO '       TO WRK-MSG                      00028221
               END-EVALUATE.                                            00029321
                                                                        00029411
                                                                        00030511
               DISPLAY 'STATUS NOTA1 : ' WRK-NOTA1.                     00030609
               DISPLAY 'STATUS NOTA2 : ' WRK-NOTA2.                     00030709
               DISPLAY 'STATUS MEDIA : ' WRK-MEDIA.                     00030809
               DISPLAY 'STATUS       : ' WRK-MSG.                       00030909
                                                                        00031009
                                                                        00031109
      *-----------------------------------------------------------*     00031209
       2000-99-FIM.                                  EXIT.              00031309
      *-----------------------------------------------------------*     00031409
                                                                        00031509
                                                                        00031609
      *-----------------------------------------------------------*     00031709
       9999-FIMARQ                                   SECTION.           00031809
      *-----------------------------------------------------------*     00031909
                                                                        00032009
              DISPLAY 'FIM DO PROCESSAMENTO'.                           00032109
              STOP RUN.                                                 00032200
                                                                        00033000
      *-----------------------------------------------------------*     00034000
       9999-99-FIM.                                   EXIT.             00035000
      *-----------------------------------------------------------*     00036000
