                                                                        00001000
      *=======================================================*         00002000
       IDENTIFICATION                            DIVISION.              00003000
      *=======================================================*         00004000
                                                                        00005000
       PROGRAM-ID.  FR03DB08.                                           00006000
                                                                        00007000
      *=======================================================*         00008000
      *              TREINAMENTO MAINFRAME                    *         00009000
      *=======================================================*         00010000
      *     AUTOR    : AUGUSTO MARTINS                                  00020000
      *     EMPRESA  : FOURSYS                                          00030000
      *     DATA     : 08/06/2022                                       00040031
      *     OBJETIVO : INSERIR DADOS DA SYSIN,COM O FORMATO DOS         00050000
      *              : DADOS DA TABELA FOUR001.FUNC2                    00060017
      *=======================================================*         00070000
       ENVIRONMENT                                    DIVISION.         00080000
      *=======================================================*         00081000
                                                                        00081100
      *=======================================================*         00081200
       CONFIGURATION                                  SECTION.          00081300
      *=======================================================*         00081400
                                                                        00081500
          SPECIAL-NAMES.                                                00081600
              DECIMAL-POINT IS COMMA.                                   00081700
                                                                        00081800
      *=======================================================*         00081900
                                                                        00082000
      *=======================================================*         00082100
       DATA                                       DIVISION.             00082200
      *=======================================================*         00082300
                                                                        00082400
      *-------------------------------------------------------*         00082500
       WORKING-STORAGE                            SECTION.              00082600
      *-------------------------------------------------------*         00082700
                                                                        00082800
      *-------------------------------------------------------*         00082900
        01 FILLER                          PIC X(050)   VALUE           00083000
                '*******AREA DE SQL ******'.                            00083100
      *-------------------------------------------------------*         00083200
                                                                        00083300
           EXEC SQL                                                     00083400
                INCLUDE BKFUNC2                                         00083500
           END-EXEC.                                                    00083600
           EXEC SQL                                                     00083700
                INCLUDE SQLCA                                           00083800
           END-EXEC.                                                    00083900
                                                                        00084000
      *-------------------------------------------------------*         00084100
        01 FILLER                          PIC X(050)   VALUE           00084200
                '*******AREA DE AUXILIARES********'.                    00084300
      *-------------------------------------------------------*         00084400
                                                                        00084500
      *-------------------------------------------------------*         00084600
                                                                        00084700
                                                                        00084800
      *-------------------------------------------------------*         00084900
        01 FILLER                          PIC X(050)   VALUE           00085000
                '*******AREA DE AUXILIARES********'.                    00086000
      *-------------------------------------------------------*         00086100
                                                                        00086200
       77 WRK-SQLCODE       PIC -999.                                   00086313
       77 WRK-INDICATOR     PIC S9(04) COMP VALUE ZEROS.                00086400
       77 WRK-CONT          PIC 9(09).                                  00086528
       77 WRK-POS           PIC 9(09) VALUE ZEROS.                      00086630
                                                                        00086724
       01 WRK-ID.                                                       00086824
          02 FILLER         PIC X(10).                                  00086924
          02 WRK-ID-AC      PIC 9(05).                                  00087024
                                                                        00087124
       01 WRK-NOME.                                                     00087224
          02 FILLER         PIC X(10).                                  00087324
          02 WRK-NOME-AC    PIC X(30).                                  00087424
                                                                        00087524
       01 WRK-SETOR.                                                    00087624
          02 FILLER         PIC X(10).                                  00087724
          02 WRK-SETOR-AC   PIC X(04).                                  00087824
                                                                        00087924
       01 WRK-SALARIO.                                                  00088024
          02 FILLER         PIC X(10).                                  00088124
          02 WRK-SALARIO-AC PIC 9(08)V99.                               00088224
                                                                        00088324
       01 WRK-DATAADM.                                                  00088424
          02 FILLER         PIC X(10).                                  00088524
          02 WRK-DATAADM-AC PIC X(10).                                  00088624
                                                                        00088724
       01 WRK-EMAIL.                                                    00088824
          02 FILLER         PIC X(10).                                  00088924
          02 WRK-EMAIL-AC   PIC X(40).                                  00089024
                                                                        00089124
                                                                        00089224
       01 WRK-TELEFONE.                                                 00089324
          02 FILLER          PIC X(10).                                 00089424
          02 WRK-TELEFONE-AC PIC X(11).                                 00089524
                                                                        00089624
                                                                        00089724
      *-------------------------------------------------------*         00089824
                                                                        00089924
                                                                        00090024
      *=======================================================*         00090124
       PROCEDURE                                  DIVISION.             00090224
      *=======================================================*         00090324
                                                                        00090424
                                                                        00090524
      *-------------------------------------------------------*         00090624
                                                                        00090724
      *         R O T I N A  P R I N C I P A L *                        00090824
                                                                        00090924
      *-------------------------------------------------------*         00091024
                                                                        00091124
                                                                        00091224
      *-------------------------------------------------------*         00091324
       0000-PRINCIPAL                              SECTION.             00091424
      *-------------------------------------------------------*         00091524
                                                                        00091624
            PERFORM 1000-INICIAR.                                       00091724
            PERFORM 2000-PROCESSAR.                                     00091824
            PERFORM 3000-FINALIZAR.                                     00091924
                                                                        00092024
      *-------------------------------------------------------*         00092124
       0000-999-FIM.                               EXIT.                00092224
      *-------------------------------------------------------*         00092324
                                                                        00092424
                                                                        00092524
      *-------------------------------------------------------*         00092624
       1000-INICIAR                               SECTION.              00092724
      *-------------------------------------------------------*         00092824
                                                                        00092924
                                                                        00093024
             ACCEPT WRK-ID.                                             00093124
             ACCEPT WRK-NOME.                                           00093224
             ACCEPT WRK-SETOR.                                          00093324
             ACCEPT WRK-SALARIO.                                        00093424
             ACCEPT WRK-DATAADM.                                        00093524
             ACCEPT WRK-EMAIL.                                          00093624
             ACCEPT WRK-TELEFONE.                                       00093724
                                                                        00093824
                                                                        00094000
      *-------------------------------------------------------*         00094100
       1000-999-FIM.                              EXIT.                 00094200
      *-------------------------------------------------------*         00094300
                                                                        00094400
                                                                        00094500
      *-------------------------------------------------------*         00094600
       2000-PROCESSAR                             SECTION.              00094700
      *-------------------------------------------------------*         00094800
                                                                        00094900
            MOVE    WRK-ID-AC            TO DB2-ID.                     00095000
            MOVE    WRK-NOME-AC          TO DB2-NOME.                   00095100
            MOVE    WRK-SETOR-AC         TO DB2-SETOR.                  00095200
            MOVE    WRK-SALARIO-AC       TO DB2-SALARIO.                00095300
            MOVE    WRK-DATAADM-AC       TO DB2-DATAADM.                00095400
                                                                        00095524
            PERFORM VARYING WRK-CONT      FROM 40                       00095624
                  BY -1 UNTIL WRK-CONT    EQUAL 0                       00095724
             IF WRK-EMAIL-AC (WRK-CONT:1) EQUAL SPACES                  00095829
               MOVE WRK-CONT              TO WRK-POS                    00095926
             END-IF                                                     00096024
            END-PERFORM                                                 00096124
                                                                        00096224
            MOVE    WRK-POS              TO DB2-EMAIL-LEN.              00096324
            MOVE    WRK-EMAIL-AC         TO DB2-EMAIL-TEXT.             00096424
            MOVE    WRK-TELEFONE-AC      TO DB2-TELEFONE.               00096604
                                                                        00096700
            EXEC SQL                                                    00096800
              INSERT INTO                                               00096900
           FOUR001.FUNC2(ID,NOME,SETOR,SALARIO,DATAADM,EMAIL,TELEFONE)  00097011
              VALUES(:DB2-ID,                                           00097101
                     :DB2-NOME,                                         00097201
                     :DB2-SETOR,                                        00097300
                     :DB2-SALARIO,                                      00097400
                     :DB2-DATAADM,                                      00097500
                     :DB2-EMAIL,                                        00097615
                     :DB2-TELEFONE)                                     00097700
            END-EXEC.                                                   00097800
                                                                        00097900
                                                                        00098000
             EVALUATE SQLCODE                                           00098100
               WHEN 0                                                   00098200
                DISPLAY 'DADOS GRAVADOS'                                00098300
                DISPLAY 'ID......'  DB2-ID                              00098400
                DISPLAY 'NOME....'  DB2-NOME                            00098500
                DISPLAY 'SETOR...'  DB2-SETOR                           00098600
                DISPLAY 'SALARIO.'  DB2-SALARIO                         00098700
                DISPLAY 'DATAADM.'  DB2-DATAADM                         00098800
                DISPLAY 'EMAIL...'  DB2-EMAIL-TEXT                      00098927
                DISPLAY 'TELEFONE ' DB2-TELEFONE                        00099007
               WHEN -181                                                00099107
                DISPLAY 'ERRO COM FORMATO DA DATA ' WRK-DATAADM-AC      00099223
               WHEN OTHER                                               00099307
                MOVE SQLCODE        TO WRK-SQLCODE                      00099407
                DISPLAY 'ERRO....'  WRK-SQLCODE                         00100000
             END-EVALUATE.                                              00100100
                                                                        00100218
      *-------------------------------------------------------*         00101300
       2000-999-FIM.                              EXIT.                 00101400
      *-------------------------------------------------------*         00101500
                                                                        00101600
                                                                        00101700
      *-------------------------------------------------------*         00101800
       3000-FINALIZAR                             SECTION.              00101900
      *-------------------------------------------------------*         00102000
                                                                        00102100
              STOP RUN.                                                 00103000
                                                                        00103100
      *-------------------------------------------------------*         00103200
       3000-999-FIM.                              EXIT.                 00103300
      *-------------------------------------------------------*         00103400
                                                                        00103500
