                                                                        00001000
      *=======================================================*         00002000
       IDENTIFICATION                            DIVISION.              00003000
      *=======================================================*         00004000
                                                                        00005000
       PROGRAM-ID.  FR03DB01.                                           00006000
                                                                        00007000
      *=======================================================*         00008000
      *              TREINAMENTO MAINFRAME                    *         00009000
      *=======================================================*         00010000
      *     AUTOR    : AUGUSTO MARTINS                                  00020000
      *     EMPRESA  : FOURSYS                                          00030000
      *     DATA     : 01/06/2022                                       00040000
      *     OBJETIVO : LEITURA DE DADOS DA TABELA, DE ACORDO            00050000
      *              : COM ID IDENTIFICADO NA SYSIN.                    00060000
      *=======================================================*         00070000
       ENVIRONMENT                                    DIVISION.         00080000
      *=======================================================*         00081000
                                                                        00081100
      *=======================================================*         00081200
       CONFIGURATION                                  SECTION.          00081300
      *=======================================================*         00081400
                                                                        00081500
          SPECIAL-NAMES.                                                00081600
              DECIMAL-POINT IS COMMA.                                   00081700
                                                                        00081800
      *=======================================================*         00081900
                                                                        00082000
      *=======================================================*         00082100
       DATA                                       DIVISION.             00082200
      *=======================================================*         00082300
                                                                        00082400
      *-------------------------------------------------------*         00082500
       WORKING-STORAGE                            SECTION.              00082600
      *-------------------------------------------------------*         00082700
                                                                        00082800
      *-------------------------------------------------------*         00082900
        01 FILLER                          PIC X(050)   VALUE           00083000
                '*******AREA DE SQL ******'.                            00083100
      *-------------------------------------------------------*         00083200
                                                                        00083300
           EXEC SQL                                                     00083400
                INCLUDE BOOKFUNC                                        00083500
           END-EXEC.                                                    00083600
           EXEC SQL                                                     00083700
                INCLUDE SQLCA                                           00083800
           END-EXEC.                                                    00083900
                                                                        00084000
                                                                        00084600
      *-------------------------------------------------------*         00086000
        01 FILLER                          PIC X(050)   VALUE           00086100
                '*******AREA DE AUXILIARES********'.                    00086200
      *-------------------------------------------------------*         00086300
                                                                        00086400
       77 WRK-ID        PIC 9(04).                                      00086500
       77 WRK-SQLCODE   PIC -999.                                       00086600
       77 WRK-INDICATOR PIC S9(04) COMP VALUE ZEROS.                    00086700
                                                                        00087100
      *-------------------------------------------------------*         00087200
                                                                        00087300
                                                                        00087400
      *=======================================================*         00087500
       PROCEDURE                                  DIVISION.             00087600
      *=======================================================*         00087700
                                                                        00087800
                                                                        00087900
      *-------------------------------------------------------*         00088000
                                                                        00088100
      *         R O T I N A  P R I N C I P A L *                        00088200
                                                                        00088300
      *-------------------------------------------------------*         00088400
                                                                        00088500
                                                                        00088600
      *-------------------------------------------------------*         00088700
       0000-PRINCIPAL                              SECTION.             00088800
      *-------------------------------------------------------*         00088900
                                                                        00089000
            PERFORM 1000-INICIAR.                                       00089100
            PERFORM 2000-PROCESSAR.                                     00089200
            PERFORM 3000-FINALIZAR.                                     00089300
                                                                        00089400
                                                                        00089500
      *-------------------------------------------------------*         00089600
       0000-999-FIM.                               EXIT.                00089700
      *-------------------------------------------------------*         00089800
                                                                        00089900
                                                                        00090000
      *-------------------------------------------------------*         00090100
       1000-INICIAR                               SECTION.              00090200
      *-------------------------------------------------------*         00090300
                                                                        00090400
              ACCEPT WRK-ID  FROM SYSIN .                               00090500
              MOVE   WRK-ID  TO   DB2-ID.                               00090600
                                                                        00090700
      *-------------------------------------------------------*         00091800
       1000-999-FIM.                              EXIT.                 00091900
      *-------------------------------------------------------*         00092000
                                                                        00092100
                                                                        00092200
      *-------------------------------------------------------*         00092300
       2000-PROCESSAR                             SECTION.              00092400
      *-------------------------------------------------------*         00092500
                                                                        00092600
           EXEC SQL                                                     00092700
             SELECT ID, NOME, SETOR, SALARIO, DATAADM,EMAIL             00092800
              INTO :REG-FUNC                                            00092900
               FROM FOUR001.FUNC                                        00093500
               WHERE ID = :DB2-ID                                       00093600
           END-EXEC.                                                    00093700
                                                                        00095100
             PERFORM 4000-LER-FUNC.                                     00095200
      *-------------------------------------------------------*         00095300
       2000-999-FIM.                              EXIT.                 00095400
      *-------------------------------------------------------*         00095500
                                                                        00095600
                                                                        00095700
      *-------------------------------------------------------*         00095800
       4000-LER-FUNC                              SECTION.              00095900
      *-------------------------------------------------------*         00096000
                                                                        00096100
                                                                        00096300
           EVALUATE SQLCODE                                             00096400
             WHEN 0                                                     00096500
                DISPLAY 'ID ........'  DB2-ID                           00096600
                DISPLAY 'NOME ..... '  DB2-NOME                         00096700
                DISPLAY 'SETOR..... '  DB2-SETOR                        00096800
                DISPLAY 'SALARIO ...'  DB2-SALARIO                      00096900
                DISPLAY 'DATAADM ...'  DB2-DATAADM                      00097000
                DISPLAY 'EMAIL .....'  DB2-EMAIL                        00098000
                 IF WRK-INDICATOR = 0                                   00099000
                   DISPLAY 'EMAIL ..' DB2-EMAIL                         00099100
                 ELSE                                                   00099200
                   DISPLAY '--- SEM EMAIL'                              00099300
                 END-IF                                                 00099400
                                                                        00099500
              WHEN 100                                                  00099600
                   DISPLAY 'NAO ENCONTRADO '                            00099700
              WHEN OTHER                                                00099800
                   MOVE SQLCODE  TO WRK-SQLCODE                         00099900
                   DISPLAY ' ERRO .. ' WRK-SQLCODE                      00100000
            END-EVALUATE.                                               00100100
                                                                        00100200
      *-------------------------------------------------------*         00100300
       4000-999-FIM.                              EXIT.                 00100400
      *-------------------------------------------------------*         00100500
                                                                        00100600
                                                                        00100700
                                                                        00100800
      *-------------------------------------------------------*         00100900
       3000-FINALIZAR                             SECTION.              00101000
      *-------------------------------------------------------*         00101100
                                                                        00101200
              STOP RUN.                                                 00102800
                                                                        00102900
      *-------------------------------------------------------*         00103000
       3000-999-FIM.                              EXIT.                 00103100
      *-------------------------------------------------------*         00103200
                                                                        00104000
