      *===========================================================*     00001000
       IDENTIFICATION                             DIVISION.             00002000
      *===========================================================*     00003000
                                                                        00003100
       PROGRAM-ID.  FR03CB17.                                           00003200
                                                                        00003300
      *===========================================================*     00003400
      *              TREINAMENTO MAINFRAME                              00003500
      *===========================================================*     00003600
                                                                        00003700
      *===========================================================*     00003800
      *                                                                 00003900
      *   PROGRAMADOR: AUGUSTO MARTINS                                  00004000
      *   EMPRESA    : FOURSYS                                          00005000
      *   DATA       : 25/04/2022                                       00006000
      *   OBJETIVO   : CALCULAR O VALOR DO FRETE, DE ACORDO COM A       00007048
      *              : REGIAO.                                          00008000
      *                                                                 00009000
      *===========================================================*     00010000
                                                                        00011000
                                                                        00012000
      *===========================================================*     00012100
       ENVIRONMENT                                DIVISION.             00012200
      *===========================================================*     00012300
                                                                        00012400
      *-----------------------------------------------------------*     00012500
       CONFIGURATION                              SECTION.              00012600
      *-----------------------------------------------------------*     00012700
                                                                        00012800
       SPECIAL-NAMES.                                                   00012900
           DECIMAL-POINT IS COMMA.                                      00013000
                                                                        00013100
      *===========================================================*     00013200
       DATA                                       DIVISION.             00013300
      *===========================================================*     00013400
                                                                        00013500
                                                                        00013600
      *-----------------------------------------------------------*     00013700
       WORKING-STORAGE                            SECTION.              00013800
      *-----------------------------------------------------------*     00013900
                                                                        00014000
                                                                        00015000
      *-----------------------------------------------------------*     00015100
      *---------    INICIO  DA WORKING - SECTION         ---------*     00015200
      *-----------------------------------------------------------*     00015300
                                                                        00015400
                                                                        00015500
      *-----------------------------------------------------------*     00015600
                                                                        00015700
        01 WRK-FRETE.                                                   00015800
           05 WRK-CODIGO               PIC X(05) VALUE ZEROS.           00015922
           05 WRK-PRODUTO              PIC X(08) VALUE SPACES.          00016028
           05 WRK-VALOR                PIC 9(08)V99 VALUE ZEROS.        00016137
           05 WRK-ESTADO               PIC X(02) VALUE SPACES.          00016227
        01 WRK-TOTAL-FRETE             PIC 9(08)V99 VALUE ZEROS.        00017037
        01 WRK-TAXA                    PIC 9(03)V99 VALUE ZEROS.        00017138
        01 WRK-AUX                     PIC 9(01) VALUE ZEROS.           00017209
        01 WRK-MIN                     PIC 9(04) VALUE 500.             00017347
                                                                        00017417
      *-----------------------------------------------------------*     00017517
                                                                        00017617
                                                                        00017717
      *===========================================================*     00017817
       PROCEDURE                                  DIVISION.             00017917
      *===========================================================*     00018017
                                                                        00018117
      *************************************************************     00018217
      *                    ROTINA PRINCIPAL                       *     00019000
      *************************************************************     00019100
                                                                        00019200
      *-----------------------------------------------------------*     00019300
       0000-PRINCIPAL                               SECTION.            00019400
      *-----------------------------------------------------------*     00019500
             PERFORM 1000-INICIAR.                                      00019600
             PERFORM 2000-VERIFICADOR.                                  00019700
                                                                        00019800
             IF WRK-VALOR LESS 1000 AND WRK-AUX NOT EQUAL 1 THEN        00019908
                          DISPLAY 'RETIRADA DO PRODUTO NA LOJA'         00020000
                          PERFORM 9999-FIMARQ                           00020100
             END-IF                                                     00020213
                                                                        00020300
             PERFORM 3000-PROCESSAR.                                    00020400
      *-----------------------------------------------------------*     00020500
       0000-99-FIM.                                  EXIT.              00020600
      *-----------------------------------------------------------*     00020700
                                                                        00020800
      *************************************************************     00020900
      *                    PROCEDIMENTO INICIAL                   *     00021000
      *************************************************************     00021100
                                                                        00021200
      *-----------------------------------------------------------*     00021300
       1000-INICIAR                                  SECTION.           00021400
      *-----------------------------------------------------------*     00021500
                                                                        00021600
             ACCEPT WRK-FRETE FROM SYSIN.                               00022000
                                                                        00022100
      *-----------------------------------------------------------*     00022200
       1000-99-FIM.                                   EXIT.             00022300
      *-----------------------------------------------------------*     00022400
                                                                        00022500
      *-----------------------------------------------------------*     00022600
       2000-VERIFICADOR                              SECTION.           00022700
      *-----------------------------------------------------------*     00022800
                                                                        00022900
             IF ( WRK-PRODUTO  IS NOT NUMERIC ) AND                     00023419
                ( WRK-VALOR    GREATER THAN OR EQUAL WRK-MIN) AND       00023822
                ( WRK-ESTADO   IS NOT NUMERIC ) THEN                    00024216
                                                                        00024308
                 MOVE 1                   TO WRK-AUX                    00024408
                                                                        00024900
              ELSE                                                      00025000
                 GO                       TO 8000-TRATAR-ERRO           00025100
                                                                        00025200
             END-IF.                                                    00025300
                                                                        00025400
      *-----------------------------------------------------------*     00025500
       2000-99-FIM.                                   EXIT.             00025600
      *-----------------------------------------------------------*     00025700
                                                                        00025800
                                                                        00025900
      *************************************************************     00026000
      *                    PROCESSAR                              *     00026100
      *************************************************************     00026200
                                                                        00026300
                                                                        00026400
      *-----------------------------------------------------------*     00026500
       3000-PROCESSAR                                SECTION.           00026600
      *-----------------------------------------------------------*     00026700
                                                                        00027200
             IF WRK-ESTADO EQUAL 'SP'   THEN                            00027325
                  MOVE 10               TO WRK-TAXA                     00027447
                                                                        00027600
               IF WRK-ESTADO EQUAL 'RJ' THEN                            00027700
                  MOVE 015              TO WRK-TAXA                     00027800
                                                                        00028000
                 IF WRK-ESTADO EQUAL 'MG' THEN                          00028100
                    MOVE 020              TO WRK-TAXA                   00028200
                                                                        00028400
                  ELSE                                                  00028500
                     DISPLAY 'NAO ENTREGAMOS '                          00028646
                     PERFORM 9999-FIMARQ                                00028700
                                                                        00028800
                  END-IF                                                00028900
                                                                        00029000
                END-IF                                                  00029100
                                                                        00029200
             END-IF.                                                    00029300
                                                                        00029400
             PERFORM  4000-PROCESSAR-FRETE.                             00029505
                                                                        00029600
      *-----------------------------------------------------------*     00029700
       4000-PROCESSAR-FRETE                         SECTION.            00029805
      *-----------------------------------------------------------*     00029900
                                                                        00030000
            COMPUTE WRK-TOTAL-FRETE = WRK-VALOR * WRK-TAXA / 100.       00030147
                                                                        00030300
             DISPLAY '======================='                          00030430
             DISPLAY 'VALOR TOTAL COM FRETE :'  WRK-TOTAL-FRETE         00030530
             DISPLAY 'PARA: ' WRK-ESTADO                                00030630
             DISPLAY '======================='.                         00030741
                                                                        00030800
                                                                        00030932
                                                                        00031030
           PERFORM 9999-FIMARQ.                                         00031106
                                                                        00031200
      *-----------------------------------------------------------*     00031300
       4000-99-FIM.                                 EXIT.               00031405
      *-----------------------------------------------------------*     00031500
       3000-99-FIM.                                  EXIT.              00031600
      *-----------------------------------------------------------*     00031700
                                                                        00031800
                                                                        00031900
      *-----------------------------------------------------------*     00032000
       8000-TRATAR-ERRO                             SECTION.            00032100
      *-----------------------------------------------------------*     00032200
           DISPLAY ' TRATAR ERRO '                                      00032300
           PERFORM  P9000-FIM.                                          00033000
      *-----------------------------------------------------------*     00040000
       8000-99-FIM.                                  EXIT.              00050000
      *-----------------------------------------------------------*     00051000
                                                                        00052000
                                                                        00053000
      *-----------------------------------------------------------*     00054000
       9999-FIMARQ                                   SECTION.           00055000
      *-----------------------------------------------------------*     00056000
                                                                        00057000
       P9000-FIM.                                                       00058000
              DISPLAY 'FIM DO PROCESSAMENTO'.                           00058100
              STOP RUN.                                                 00058200
                                                                        00058300
      *-----------------------------------------------------------*     00058400
       9999-99-FIM.                                   EXIT.             00058500
      *-----------------------------------------------------------*     00058600
